#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_QNM_Kawaii

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_QNM_Kawaii.ABP_QNM_Kawaii_C
// 0x2790 (0x2A50 - 0x02C0)
class UABP_QNM_Kawaii_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x02C8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x03E0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0410(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0528(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0558(0x0118)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0670(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x0690(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x0EF0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x1750(0x0860)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1FB0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x1FD0(0x0860)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x2830(0x0030)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x2860(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2920(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2950(0x00E0)()
	class FString                                 __CustomProperty_CurrentKawaiiState_0192396E4104D212C0BBC9B477BAAC08; // 0x2A30(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableKawaiiSetting_0192396E4104D212C0BBC9B477BAAC08; // 0x2A40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_QNM_Kawaii(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void NewKawaiiLayer(const struct FPoseLink& InPose, bool bEnableKawaiiSetting, const class FString& CurrentKawaiiState, class UPlayerAnimInstance* OwnerInstance, bool IsPhantom, struct FPoseLink* NewKawaiiLayer_0);
	void ChestLayer(const struct FPoseLink& InPose_0, struct FPoseLink* ChestLayer_0);
	void InteractiveKawaiiLayer(const struct FPoseLink& InPose_2, bool bEnableKawaiiSetting, const class FString& CurrentKawaiiState, class UPlayerAnimInstance* OwnerInstance1, struct FPoseLink* InteractiveKawaiiLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_QNM_Kawaii_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_QNM_Kawaii_C")
	}
	static class UABP_QNM_Kawaii_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_QNM_Kawaii_C>();
	}
};
DUMPER7_ASSERTS_UABP_QNM_Kawaii_C;

}

