#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_LN_Kawaii

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_LN_Kawaii.ABP_LN_Kawaii_C
// 0x2FF0 (0x32B0 - 0x02C0)
class UABP_LN_Kawaii_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x02C8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x03E0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0410(0x0118)()
	uint8                                         Pad_528[0x8];                                      // 0x0528(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x0530(0x0860)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0D90(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0DB0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x0DD0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x1630(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x1E90(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x26F0(0x0860)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x2F50(0x0030)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x2F80(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x3040(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x3070(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x3188(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x3268(0x0030)()
	class FString                                 __CustomProperty_CurrentKawaiiState_06F1601446BD6260076E059239FDA7C9; // 0x3298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableKawaiiSetting_06F1601446BD6260076E059239FDA7C9; // 0x32A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_LN_Kawaii(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void NewKawaiiLayer(const struct FPoseLink& InPose, bool bEnableKawaiiSetting, const class FString& CurrentKawaiiState, class UPlayerAnimInstance* OwnerInstance, bool IsPhantom, struct FPoseLink* NewKawaiiLayer_0);
	void ChestLayer(const struct FPoseLink& InPose_0, struct FPoseLink* ChestLayer_0);
	void InteractiveKawaiiLayer(const struct FPoseLink& InPose_2, bool bEnableKawaiiSetting, const class FString& CurrentKawaiiState, class UPlayerAnimInstance* OwnerInstance1, struct FPoseLink* InteractiveKawaiiLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_LN_Kawaii_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_LN_Kawaii_C")
	}
	static class UABP_LN_Kawaii_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_LN_Kawaii_C>();
	}
};
DUMPER7_ASSERTS_UABP_LN_Kawaii_C;

}

