#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Custom_NPC

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Custom_NPC.ABP_Custom_NPC_C
// 0xFDD0 (0x10480 - 0x06B0)
class UABP_Custom_NPC_C : public UNPCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_6B8[0x8];                                      // 0x06B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0x06C0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x0F20(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x1780(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x1FE0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x2840(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x30A0(0x0860)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x3900(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x3930(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x3A48(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x3A78(0x0118)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x3B90(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x3BD8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x3C20(0x0158)()
	uint8                                         Pad_3D78[0x8];                                     // 0x3D78(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x3D80(0x0860)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x45E0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x4628(0x0158)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x4780(0x0860)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x4FE0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x5008(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x5030(0x00A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x50D0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x5930(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x6190(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x69F0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x7250(0x0860)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x7AB0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x7AD8(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x7AF8(0x0158)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x7C50(0x0860)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x84B0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x84D0(0x0860)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x8D30(0x0030)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x8D60(0x01E0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x8F40(0x01E0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x9120(0x0118)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x9238(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x9340(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x9448(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x9550(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x9658(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x9760(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x9780(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x97A0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x97D0(0x0118)()
	uint8                                         Pad_98E8[0x8];                                     // 0x98E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x98F0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0xA150(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0xA9B0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0xB210(0x0860)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xBA70(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0xBA90(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0xBBE8(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xBC10(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0xBC30(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0xBD38(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0xBE40(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0xBF48(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0xC050(0x0030)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0xC080(0x00C0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0xC140(0x0860)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_1;                       // 0xC9A0(0x0058)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0xC9F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0xCA20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0xCA48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0xCA70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0xCA98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0xCAC0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0xCAE8(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0xCBC8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0xCBF8(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0xCCD8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0xCD08(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0xCDE8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0xCE88(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0xCF68(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0xCF98(0x00C0)()
	uint8                                         Pad_D058[0x8];                                     // 0xD058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0xD060(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0xD8C0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0xE120(0x0860)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0xE980(0x0158)()
	uint8                                         Pad_EAD8[0x8];                                     // 0xEAD8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0xEAE0(0x0860)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0xF340(0x0118)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0xF458(0x00C0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0xF518(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0xF5D8(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0xF620(0x0030)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode;                       // 0xF650(0x00A0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0xF6F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0xF718(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0xF740(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0xF768(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0xF790(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0xF7B8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0xF7E0(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0xF8C0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0xF8F0(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0xF9D0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0xFA00(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0xFAE0(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0xFB80(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0xFC60(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0xFC90(0x00C0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0xFD50(0x00A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0xFDF0(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0xFF08(0x0030)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0xFF38(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x10090(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x100B8(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x10158(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x10180(0x0058)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x101D8(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x10298(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x102E0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x10328(0x00C8)()
	class FString                                 __CustomProperty_CurrentKawaiiState_BC5FC67C47D3E833F59AD6A5BE3FFEB0; // 0x103F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableKawaiiSetting_BC5FC67C47D3E833F59AD6A5BE3FFEB0; // 0x10400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10401[0x3];                                    // 0x10401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x10404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableTalkAction;                                 // 0x10408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bUseIK;                                            // 0x10409(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1040A[0x2];                                    // 0x1040A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LookAtDistanceAlph;                                // 0x1040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LookAtTarget_0;                                    // 0x10410(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1041C[0x4];                                    // 0x1041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  NewVar_0;                                          // 0x10420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  PawnOwner;                                         // 0x10428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               DefaultHeadRotate;                                 // 0x10430(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               NewVar_1;                                          // 0x1043C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         PitchAngleFix;                                     // 0x10448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PitchOutRangeMin;                                  // 0x1044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PitchOutRangeMax;                                  // 0x10450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YawOutRangeMin;                                    // 0x10454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YawOutRangeMax;                                    // 0x10458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spine_02_Out_Range_Min;                            // 0x1045C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spine_02_Out_Range_Max;                            // 0x10460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spine_03_Out_Range_Min;                            // 0x10464(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spine_03_Out_Range_Max;                            // 0x10468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1046C[0x4];                                    // 0x1046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPoseAsset*                             Pose_Asset;                                        // 0x10470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_Custom_NPC(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_TransitionResult_E8BA924045196CDCC6CDF3B3F6311C68();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_TransitionResult_FC2A80904E6434D9FCB4B6B2D1BB297F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_TransitionResult_A532A6D3419C2C128748BDA1514EC595();
	void BlueprintBeginPlay();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_TransitionResult_BC4F1BB94158ADB8B0351096AE5793AF();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_TransitionResult_1AF88867409F73CF49DB98BA5432B918();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_TransitionResult_0DFA1AEF44F3650B7E507F90D1890D63();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_BlendListByBool_1A6AC5074FDCFBE3CBF2A6AC51173D09();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_TwoBoneIK_08A41B054836F3538D379CAA9D184703();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_TwoBoneIK_80873382489B3CFAB02A7DB204D21986();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_ModifyBone_31A839104FBA5D9A911B5C828ED2A8D4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_ModifyBone_1790E7BC4930155B4CFCC7B049C8C960();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_ModifyBone_82430E4448E0276C0DF8B9B3111DFEF5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_ModifyBone_B54137BF428CB00A2913D5B3D28FEE54();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_ModifyBone_BA8E88684681BFE6115691AF5E2C3C6B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_ModifyBone_014453F64CF4D706C376B38C4DA682B8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_ModifyBone_3EA269F942FE61971EB34DAEA3C1C656();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_ModifyBone_543FCA1C459A391A49C9F3AA9933C1FA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_TransitionResult_9E31279C42A7BBB497729281E4AB40FA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_TransitionResult_3E369BE641918E55357E44BBFE3FE746();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_TransitionResult_3AC1A420416143AD38FF56B661D22A1C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_TransitionResult_8E304958463776102499A18303F86B02();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_TransitionResult_4B90978E4690384F0CC4DE929EB954A3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Custom_NPC_AnimGraphNode_TransitionResult_1CF88EF044500FEA72AFD78559037A7A();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void LookIK(const struct FPoseLink& InPose, struct FPoseLink* LookIK_0);
	void FootIK(const struct FPoseLink& InPose_0, struct FPoseLink* FootIK_0);
	void BodyLayer(const struct FPoseLink& MainPose, struct FPoseLink* BodyLayer_0);
	void ChestLayer(const struct FPoseLink& InPose_0, struct FPoseLink* ChestLayer_0);
	void NewKawaiiLayer(const struct FPoseLink& InPose, bool bEnableKawaiiSetting_0, const class FString& CurrentKawaiiState_0, class UPlayerAnimInstance* OwnerInstance, bool IsPhantom, struct FPoseLink* NewKawaiiLayer_0);
	void InteractiveKawaiiLayer(const struct FPoseLink& InPose_2, bool bEnableKawaiiSetting_0, const class FString& CurrentKawaiiState_0, class UPlayerAnimInstance* OwnerInstance1, struct FPoseLink* InteractiveKawaiiLayer_0);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Custom_NPC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Custom_NPC_C")
	}
	static class UABP_Custom_NPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Custom_NPC_C>();
	}
};
DUMPER7_ASSERTS_UABP_Custom_NPC_C;

}

