#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PetBiped_Base

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PetBiped_Base.ABP_PetBiped_Base_C
// 0x0860 (0x0B20 - 0x02C0)
class UABP_PetBiped_Base_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x02F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0320(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0348(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0370(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0398(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x03C0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x03E8(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x04C8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x04F8(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x05D8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0608(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0630(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0710(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0740(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0820(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0850(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0910(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0940(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0A20(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0A50(0x00C0)()
	int32                                         PetStates;                                         // 0x0B10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EatRepeatTime;                                     // 0x0B14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_PetBiped_Base(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PetBiped_Base_AnimGraphNode_TransitionResult_FD5D9C5C480812F4FCA607844281609B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PetBiped_Base_AnimGraphNode_TransitionResult_B56990F04B6B782E175CCA8E74039A4D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PetBiped_Base_AnimGraphNode_TransitionResult_F17234C349B43AD7677F70870D1A15D4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PetBiped_Base_AnimGraphNode_TransitionResult_8B59434141F4E5AF7D0259A0C0F061B8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PetBiped_Base_AnimGraphNode_TransitionResult_9E1B6AC04FB1B01B753EA49778C8376A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PetBiped_Base_AnimGraphNode_TransitionResult_0208DD114CB381EB985DCCA7D7B57E41();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_PetBiped_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_PetBiped_Base_C")
	}
	static class UABP_PetBiped_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PetBiped_Base_C>();
	}
};
DUMPER7_ASSERTS_UABP_PetBiped_Base_C;

}

