#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: ABP_Heitao_Kawaii

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Heitao_Kawaii.ABP_Heitao_Kawaii_C
// 0xF670 (0xF930 - 0x02C0)
class UABP_Heitao_Kawaii_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x02C8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x0388(0x0030)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x03B8(0x0020)()
	uint8                                         Pad_3D8[0x8];                                      // 0x03D8(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0x03E0(0x0860)()
	struct FAnimNode_SwingBone                    AnimGraphNode_SwingBone_9;                         // 0x0C40(0x0108)()
	struct FAnimNode_SwingBone                    AnimGraphNode_SwingBone_8;                         // 0x0D48(0x0108)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0x0E50(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0x16B0(0x0860)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x1F10(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1F30(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1F58(0x00A0)()
	uint8                                         Pad_1FF8[0x8];                                     // 0x1FF8(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x2000(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x2860(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x30C0(0x0860)()
	struct FAnimNode_SwingBone                    AnimGraphNode_SwingBone_7;                         // 0x3920(0x0108)()
	struct FAnimNode_SwingBone                    AnimGraphNode_SwingBone_6;                         // 0x3A28(0x0108)()
	struct FAnimNode_SwingBone                    AnimGraphNode_SwingBone_5;                         // 0x3B30(0x0108)()
	struct FAnimNode_SwingBone                    AnimGraphNode_SwingBone_4;                         // 0x3C38(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x3D40(0x00E0)()
	struct FAnimNode_SwingBone                    AnimGraphNode_SwingBone_3;                         // 0x3E20(0x0108)()
	struct FAnimNode_SwingBone                    AnimGraphNode_SwingBone_2;                         // 0x3F28(0x0108)()
	struct FAnimNode_SwingBone                    AnimGraphNode_SwingBone_1;                         // 0x4030(0x0108)()
	struct FAnimNode_SwingBone                    AnimGraphNode_SwingBone;                           // 0x4138(0x0108)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x4240(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x4AA0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x5300(0x0860)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x5B60(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x5B88(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x5BB0(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x5C50(0x0158)()
	uint8                                         Pad_5DA8[0x8];                                     // 0x5DA8(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x5DB0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x6610(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x6E70(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x76D0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x7F30(0x0860)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x8790(0x0158)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x88E8(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x8908(0x00C0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x89C8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x89E8(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x8A10(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x8B28(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x8B58(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x8B78(0x0020)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_2;                        // 0x8B98(0x0128)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_1;                        // 0x8CC0(0x0128)()
	uint8                                         Pad_8DE8[0x8];                                     // 0x8DE8(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x8DF0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x9650(0x0860)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x9EB0(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x9FC8(0x0030)()
	uint8                                         Pad_9FF8[0x8];                                     // 0x9FF8(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0xA000(0x0860)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone;                          // 0xA860(0x0128)()
	uint8                                         Pad_A988[0x8];                                     // 0xA988(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0xA990(0x0860)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xB1F0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0xB210(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0xBA70(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0xC2D0(0x0860)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xCB30(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0xCB50(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0xD3B0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0xDC10(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0xE470(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0xECD0(0x0860)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0xF530(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0xF648(0x0030)()
	bool                                          IsPhantom;                                         // 0xF678(0x0001)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F679[0x7];                                     // 0xF679(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class UPlayerAnimInstance*                    OwnerInstance;                                     // 0xF680(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CurrentKawaiiState;                                // 0xF688(0x0010)(BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bEnableKawaiiSetting;                              // 0xF698(0x0001)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F699[0x7];                                     // 0xF699(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 __CustomProperty_CurrentKawaiiState_951FB6774772FFBDF1675A9EC6A7A6FF; // 0xF6A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableKawaiiSetting_951FB6774772FFBDF1675A9EC6A7A6FF; // 0xF6B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6B1[0x7];                                     // 0xF6B1(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 __CustomProperty_CurrentKawaiiState_78EAA45B4AF74E2E9AD0F3BAE64FE563; // 0xF6B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableKawaiiSetting_78EAA45B4AF74E2E9AD0F3BAE64FE563; // 0xF6C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6C9[0x7];                                     // 0xF6C9(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	TMap<class FString, struct FKawaiiPhysicsSettings> CloakSettingMap;                              // 0xF6D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, struct FKawaiiPhysicsSettings> SkirtSettingMap;                              // 0xF720(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, struct FKawaiiPhysicsSettings> HairSettingMap;                               // 0xF770(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, struct FKawaiiPhysicsSettings> ChestSettingMap;                              // 0xF7C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Lean;                                              // 0xF810(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LR;                                                // 0xF814(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FB;                                                // 0xF818(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0xF81C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pitch;                                             // 0xF820(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ZY;                                                // 0xF824(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         QH;                                                // 0xF828(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKawaiiPhysicsSettings                 NewVar_0;                                          // 0xF82C(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_F87C[0x4];                                     // 0xF87C(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	TMap<class FString, struct FKawaiiPhysicsSettings> Short_SettingMap;                             // 0xF880(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, float>                    Skirt_drive;                                       // 0xF8D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPlayerAnimInstance*                    RootInstance;                                      // 0xF920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SongluInteractiveKawaiiAlpha;                      // 0xF928(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_Heitao_Kawaii(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_KawaiiPhysics_2AC80A8149F000781CC67BBB8DC6D8C5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_KawaiiPhysics_297CC51E403FC6AD8F92278E08709215();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_KawaiiPhysics_A00BA2B1417CC6E8A01BEDBDE74DD9B5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_KawaiiPhysics_2D1191B14096A62D6150808DA88CCD62();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_KawaiiPhysics_69836ACA461F32E9E94F9F980CEECD3A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_KawaiiPhysics_7FFC8B984759138EC96E409B71310752();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_KawaiiPhysics_FE4C50BF4DA652161AA9F1BFA75152C0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_KawaiiPhysics_161A06E94132F8088DD4E4AB35397EFE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_SwingBone_3579A7A74C051619F8CA8A8072281C7C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_SwingBone_AE64537B48D5E3B2777B978F7B8F8DC8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_SwingBone_D881BC7C4470E619FB6589B084B14AF1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_SwingBone_FAC1F73F43EC1BDE1449AC9B14493387();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_SwingBone_943A43674664C155048091ADBE4FD874();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_SwingBone_042DEB8643C33A69D10FC79EE4ADBA9D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_SwingBone_6379D6C646559C3DDCFCD6ACFB9E7EBE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_SwingBone_B6B7C77A4CF722F6E5933CAD1CEE4677();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_KawaiiPhysics_21D52FB84FCB05D87D9DBF887D8AA102();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_KawaiiPhysics_22DFAFB0443727DE5867308DA9A0B577();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Heitao_Kawaii_AnimGraphNode_KawaiiPhysics_E02A764D46A5A58F01781EA9441C86C9();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void NewKawaiiLayer(const struct FPoseLink& InPose, bool bEnableKawaiiSetting_0, const class FString& CurrentKawaiiState_0, class UPlayerAnimInstance* OwnerInstance_0, bool IsPhantom_0, struct FPoseLink* NewKawaiiLayer_0);
	void ChestLayer(const struct FPoseLink& InPose_0, struct FPoseLink* ChestLayer_0);
	void InteractiveKawaiiLayer(const struct FPoseLink& InPose_2, bool bEnableKawaiiSetting_0, const class FString& CurrentKawaiiState_0, class UPlayerAnimInstance* OwnerInstance1, struct FPoseLink* InteractiveKawaiiLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Heitao_Kawaii_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Heitao_Kawaii_C")
	}
	static class UABP_Heitao_Kawaii_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Heitao_Kawaii_C>();
	}
};
DUMPER7_ASSERTS_UABP_Heitao_Kawaii_C;

}

