#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_YN_Kawaii

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_YN_Kawaii.ABP_YN_Kawaii_C
// 0x28A0 (0x2B60 - 0x02C0)
class UABP_YN_Kawaii_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x02C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x02F8(0x0118)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x0410(0x0860)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0C70(0x0108)()
	uint8                                         Pad_D78[0x8];                                      // 0x0D78(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x0D80(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x15E0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x1E40(0x0860)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x26A0(0x0118)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x27B8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x27D8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x27F8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x2828(0x0030)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x2858(0x00C0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2918(0x00E0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x29F8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2B10(0x0030)()
	class FString                                 __CustomProperty_CurrentKawaiiState_38BD1B084B9AC41FF61FD5A6947F22FA; // 0x2B40(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableKawaiiSetting_38BD1B084B9AC41FF61FD5A6947F22FA; // 0x2B50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_YN_Kawaii(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void NewKawaiiLayer(const struct FPoseLink& InPose, bool bEnableKawaiiSetting, const class FString& CurrentKawaiiState, class UPlayerAnimInstance* OwnerInstance, bool IsPhantom, struct FPoseLink* NewKawaiiLayer_0);
	void ChestLayer(const struct FPoseLink& InPose_0, struct FPoseLink* ChestLayer_0);
	void InteractiveKawaiiLayer(const struct FPoseLink& InPose_2, bool bEnableKawaiiSetting, const class FString& CurrentKawaiiState, class UPlayerAnimInstance* OwnerInstance1, struct FPoseLink* InteractiveKawaiiLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_YN_Kawaii_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_YN_Kawaii_C")
	}
	static class UABP_YN_Kawaii_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_YN_Kawaii_C>();
	}
};
DUMPER7_ASSERTS_UABP_YN_Kawaii_C;

}

