#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: ABP_LipSync

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "EM_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_LipSync.ABP_LipSync_C
// 0x0A00 (0x0CC0 - 0x02C0)
class UABP_LipSync_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_1;                       // 0x02C8(0x0058)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0320(0x0118)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode;                       // 0x0438(0x00A0)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController;                // 0x04D8(0x0118)()
	struct FAnimNode_CopyBoneDelta                AnimGraphNode_CopyBoneDelta_5;                     // 0x05F0(0x00F8)()
	struct FAnimNode_CopyBoneDelta                AnimGraphNode_CopyBoneDelta_4;                     // 0x06E8(0x00F8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x07E0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0800(0x0030)()
	struct FAnimNode_CopyBoneDelta                AnimGraphNode_CopyBoneDelta_3;                     // 0x0830(0x00F8)()
	struct FAnimNode_CopyBoneDelta                AnimGraphNode_CopyBoneDelta_2;                     // 0x0928(0x00F8)()
	struct FAnimNode_CopyBoneDelta                AnimGraphNode_CopyBoneDelta_1;                     // 0x0A20(0x00F8)()
	struct FAnimNode_CopyBoneDelta                AnimGraphNode_CopyBoneDelta;                       // 0x0B18(0x00F8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0C10(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x0C30(0x0058)()
	float                                         LipSyncWeight;                                     // 0x0C88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLipSyncPercents                       LipSyncPercents;                                   // 0x0C8C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UPoseAsset*                             Pose_Asset;                                        // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cloak_Alpha_Right;                                 // 0x0CA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cloak_Alpha_Left;                                  // 0x0CAC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Cloak_Alpha;                                       // 0x0CB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cloak_Alpha_Back;                                  // 0x0CB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cloak_Alpha_Forward;                               // 0x0CBC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_LipSync(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_LipSync_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_LipSync_C")
	}
	static class UABP_LipSync_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_LipSync_C>();
	}
};
DUMPER7_ASSERTS_UABP_LipSync_C;

}

