#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: ABP_Nvzhu_Kawaii

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "KawaiiPartMap_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Nvzhu_Kawaii.ABP_Nvzhu_Kawaii_C
// 0x12020 (0x122E0 - 0x02C0)
class UABP_Nvzhu_Kawaii_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_31;                    // 0x02D0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_30;                    // 0x0B30(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_29;                    // 0x1390(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_28;                    // 0x1BF0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_27;                    // 0x2450(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_26;                    // 0x2CB0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0x3510(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0x3D70(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0x45D0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x4E30(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x5690(0x0860)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x5EF0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x5F10(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x5F30(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x6790(0x0860)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x6FF0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x7020(0x0118)()
	uint8                                         Pad_7138[0x8];                                     // 0x7138(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x7140(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x79A0(0x0860)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_1;                        // 0x8200(0x0128)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone;                          // 0x8328(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x8450(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x8470(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x8490(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x84C0(0x0118)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x85D8(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x8600(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x8620(0x0158)()
	uint8                                         Pad_8778[0x8];                                     // 0x8778(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x8780(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x8FE0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x9840(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0xA0A0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0xA900(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0xB160(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0xB9C0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0xC220(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0xCA80(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0xD2E0(0x0860)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0xDB40(0x0020)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController;                // 0xDB60(0x0118)()
	struct FAnimNode_CopyBoneDelta                AnimGraphNode_CopyBoneDelta_1;                     // 0xDC78(0x00F8)()
	struct FAnimNode_CopyBoneDelta                AnimGraphNode_CopyBoneDelta;                       // 0xDD70(0x00F8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0xDE68(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0xDF08(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0xE060(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0xE088(0x0028)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0xE0B0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0xE910(0x0860)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0xF170(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0xF288(0x0030)()
	uint8                                         Pad_F2B8[0x8];                                     // 0xF2B8(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0xF2C0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0xFB20(0x0860)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x10380(0x00A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x10420(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x10C80(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x114E0(0x0860)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x11D40(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x11D68(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x11D88(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x11DA8(0x0030)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x11DD8(0x00C0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x11E98(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x11F58(0x0118)()
	bool                                          IsPhantom;                                         // 0x12070(0x0001)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12071[0x7];                                    // 0x12071(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 CurrentKawaiiState;                                // 0x12078(0x0010)(BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bEnableKawaiiSetting;                              // 0x12088(0x0001)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12089[0x7];                                    // 0x12089(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 __CustomProperty_CurrentKawaiiState_79CC72774D9FC52234114DA691E72234; // 0x12090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableKawaiiSetting_79CC72774D9FC52234114DA691E72234; // 0x120A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_120A1[0x7];                                    // 0x120A1(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 __CustomProperty_CurrentKawaiiState_440F39514BA2DD9AC2469D9FFE4D4AA7; // 0x120A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableKawaiiSetting_440F39514BA2DD9AC2469D9FFE4D4AA7; // 0x120B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_120B9[0x7];                                    // 0x120B9(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	TMap<class FString, struct FKawaiiPhysicsSettings> CloakSettingMap;                              // 0x120C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, struct FKawaiiPhysicsSettings> SkirtSettingMap;                              // 0x12110(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, struct FKawaiiPhysicsSettings> HairSettingMap;                               // 0x12160(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, struct FKawaiiPhysicsSettings> ChestSettingMap;                              // 0x121B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, struct FKawaiiPhysicsSettings> ArmourSettingMap;                             // 0x12200(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FKawaiiPartMap                         KawaiiPartSettings;                                // 0x12250(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         Cloak_Alpha_Left;                                  // 0x122A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122A4[0x4];                                    // 0x122A4(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class UCurveFloat*                            Cloak_Alpha;                                       // 0x122A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cloak_Alpha_Right;                                 // 0x122B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x122B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Interp_Value;                                      // 0x122C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122C4[0x4];                                    // 0x122C4(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class UPlayerAnimInstance*                    RootInstance;                                      // 0x122C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SongluInteractiveKawaiiAlpha;                      // 0x122D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_Nvzhu_Kawaii(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Nvzhu_Kawaii_AnimGraphNode_KawaiiPhysics_C7C9C1C24BB246F0D6E16CBB45BD31D9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Nvzhu_Kawaii_AnimGraphNode_KawaiiPhysics_029EB7A44F0F3AB7A488D5AE472B3A85();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Nvzhu_Kawaii_AnimGraphNode_KawaiiPhysics_0733679E4428E4D7F75E929AF136B977();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Nvzhu_Kawaii_AnimGraphNode_KawaiiPhysics_F2E2E8974C13EF24C554A3AC8366BD94();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Nvzhu_Kawaii_AnimGraphNode_KawaiiPhysics_CE7760A641945055C48018BA8B11C4BF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Nvzhu_Kawaii_AnimGraphNode_KawaiiPhysics_3D795810479CCD33B631E0BC69ECB163();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Nvzhu_Kawaii_AnimGraphNode_KawaiiPhysics_E93C8D9840F78D00F537E7A9D2408B30();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Nvzhu_Kawaii_AnimGraphNode_KawaiiPhysics_C3534BE74BC9514DCA1B9CA3CC0293EE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Nvzhu_Kawaii_AnimGraphNode_KawaiiPhysics_66E3DEB049F9501DADD13C91FF3F52C7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Nvzhu_Kawaii_AnimGraphNode_KawaiiPhysics_6E3856FC43F5A10533B13C82D2EEA93B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Nvzhu_Kawaii_AnimGraphNode_KawaiiPhysics_E2304E5E4F199CDE15C5B29CA2EED30C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Nvzhu_Kawaii_AnimGraphNode_KawaiiPhysics_6FD44FC94106322C0C3A56B5AA49922E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Nvzhu_Kawaii_AnimGraphNode_KawaiiPhysics_1A3323C2436A3DD46F8944B256575231();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Nvzhu_Kawaii_AnimGraphNode_KawaiiPhysics_43F639D946306A843252E8B145D3C5E4();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void NewKawaiiLayer(const struct FPoseLink& InPose, bool bEnableKawaiiSetting_0, const class FString& CurrentKawaiiState_0, class UPlayerAnimInstance* OwnerInstance, bool IsPhantom_0, struct FPoseLink* NewKawaiiLayer_0);
	void ChestLayer(const struct FPoseLink& InPose_0, struct FPoseLink* ChestLayer_0);
	void InteractiveKawaiiLayer(const struct FPoseLink& InPose_2, bool bEnableKawaiiSetting_0, const class FString& CurrentKawaiiState_0, class UPlayerAnimInstance* OwnerInstance1, struct FPoseLink* InteractiveKawaiiLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Nvzhu_Kawaii_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Nvzhu_Kawaii_C")
	}
	static class UABP_Nvzhu_Kawaii_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Nvzhu_Kawaii_C>();
	}
};
DUMPER7_ASSERTS_UABP_Nvzhu_Kawaii_C;

}

