#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NPC_TalkMon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_NPC_TalkMon.ABP_NPC_TalkMon_C
// 0x24D0 (0x2B80 - 0x06B0)
class UABP_NPC_TalkMon_C : public UNPCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x06B8(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x0758(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x07A0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x08F8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0920(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0A78(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0AA0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0B40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0B68(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x0B90(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0BD8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x0C00(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0C48(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0D60(0x0158)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x0EB8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0EE8(0x0030)()
	uint8                                         Pad_F18[0x8];                                      // 0x0F18(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x0F20(0x01E0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x1100(0x01E0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x12E0(0x0118)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x13F8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x1500(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x1608(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x1710(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1818(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x1920(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x1940(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1960(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1990(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1AA8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1C00(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1C28(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1C48(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1D50(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1E58(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1E78(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1F80(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2088(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x20B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x20E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x2108(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x2130(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2158(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2180(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x21A8(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x2288(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x22B8(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2398(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x23C8(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x24A8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x24D8(0x00C0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x2598(0x00C0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x2658(0x00C0)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x2718(0x0058)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x2770(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x2830(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x2878(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x28C0(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x2988(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x2A50(0x0048)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode;                       // 0x2A98(0x00A0)()
	float                                         Speed;                                             // 0x2B38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableTalkAction;                                 // 0x2B3C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B3D[0x3];                                     // 0x2B3D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Spine_02_Out_Range_Min;                            // 0x2B40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spine_02_Out_Range_Max;                            // 0x2B44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spine_03_Out_Range_Min;                            // 0x2B48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spine_03_Out_Range_Max;                            // 0x2B4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PitchOutRangeMin_N;                                // 0x2B50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PitchOutRangeMax_N;                                // 0x2B54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YawOutRangeMin_N;                                  // 0x2B58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YawOutRangeMax_N;                                  // 0x2B5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PitchAngleFix;                                     // 0x2B60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B64[0x4];                                     // 0x2B64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  PawnOwner;                                         // 0x2B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPoseAsset*                             Pose_Asset;                                        // 0x2B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_NPC_TalkMon(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_TransitionResult_45A230AC41607E8614E617AE5CB9BE17();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_TransitionResult_0782FD284DE70B36FC13E2A94E267670();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_TransitionResult_38C053B142AF654AE364A892A9D075A1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_TransitionResult_B47C7D234628559278C26B8273D0E822();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_TransitionResult_13E275AA42C9B36E4E174AA364B30C6C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_TransitionResult_CD1B0E6043BBF8FA894CAF956CED214D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_BlendListByBool_534CA02943E6DAF478A5ECB9314F03FB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_TwoBoneIK_80F35D874062CEB16A26BD9122EE3A94();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_TwoBoneIK_A04BC854495BCBB67AC639BF304AE95C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_ModifyBone_D44E43BF42BC5EED16BF0885703907D2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_ModifyBone_8140E02047AFC1691080FFBA39647FD2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_ModifyBone_B237309E4B71AB8D9D5AD19BF5DFEBD8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_ModifyBone_B61A9FD34369E2CF79968DBFA2E0E1B5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_ModifyBone_9C67EF6341BA9154E18D4C9DEB507A02();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_ModifyBone_8DD874EE4091955EB9C4998381517028();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_ModifyBone_733A48D14CB9110EB6CB7B96CF123B95();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_ModifyBone_88D58A9E48CC907EF1F2758DB4C041C6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_TalkMon_AnimGraphNode_ApplyAdditive_FD4F8BB149FD60E94DC8B28A73F9970D();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void LookIK(const struct FPoseLink& InPose, struct FPoseLink* LookIK_0);
	void FootIK(const struct FPoseLink& InPose_0, struct FPoseLink* FootIK_0);
	void BodyLayer(const struct FPoseLink& MainPose, struct FPoseLink* BodyLayer_0);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_NPC_TalkMon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_NPC_TalkMon_C")
	}
	static class UABP_NPC_TalkMon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_NPC_TalkMon_C>();
	}
};
DUMPER7_ASSERTS_UABP_NPC_TalkMon_C;

}

