#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: ABP_Mon_Gr_Piaofu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mon_Gr_Piaofu.ABP_Mon_Gr_Piaofu_C
// 0x2960 (0x2DD0 - 0x0470)
class UABP_Mon_Gr_Piaofu_C final : public UMonsterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0478(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x04A8(0x0118)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x05C0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x06C8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x06E8(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0708(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0750(0x00A0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x07F0(0x0028)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot;                        // 0x0818(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x08A8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x08D8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x0900(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x0930(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x09F0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x0A38(0x0158)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0B90(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x0C58(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x0D38(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x0E18(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x0EF8(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x0F20(0x00B0)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x0FD0(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x1070(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x11C8(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x11F0(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x12A0(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x1380(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x1460(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x1540(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1620(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1700(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x1730(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x1758(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x1780(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x17A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x17D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x17F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x1820(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x1848(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x1870(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x1898(0x0028)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_2;                     // 0x18C0(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x1910(0x0030)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_1;                     // 0x1940(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x1990(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x19B8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x19E0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1A10(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1A38(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1A60(0x0028)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend;                       // 0x1A88(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x1AD8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x1B08(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1BC8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1BF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1C20(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x1C48(0x0158)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1DA0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1DD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1DF8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1E20(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1F00(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1F30(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x2010(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x2040(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2100(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x2130(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x21F0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2220(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x22E0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x2438(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x2590(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x26E8(0x0158)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x2840(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x2920(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x2A00(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2AE0(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2BC0(0x0030)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x2BF0(0x00C0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x2CB0(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x2D70(0x0048)()
	class UCurveFloat*                            PelvisShakeCurve;                                  // 0x2DB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PelvisShake;                                       // 0x2DC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PelvisStrength;                                    // 0x2DC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_Mon_Gr_Piaofu(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_Gr_Piaofu_AnimGraphNode_TransitionResult_84C6023742F71B3F9C5A4DB9F3D4696D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_Gr_Piaofu_AnimGraphNode_TransitionResult_801343E24A13CDA89DD0B7A2DE3B81F0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_Gr_Piaofu_AnimGraphNode_TransitionResult_6B9B981B46CE4468CA42F9B8EAB644A9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_Gr_Piaofu_AnimGraphNode_TransitionResult_47B0717241B792F745A66BB74A80641D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_Gr_Piaofu_AnimGraphNode_TransitionResult_96F4C670495EDBB211341FA810D7A94F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_Gr_Piaofu_AnimGraphNode_TransitionResult_4387DFF04E32D1E964B15BB2B3CB2B1E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_Gr_Piaofu_AnimGraphNode_TransitionResult_2B5213674458EDE74E5F12AEB2D2B7DB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_Gr_Piaofu_AnimGraphNode_TransitionResult_A3399DBA45580E3240A5EFACA93CBDD9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_Gr_Piaofu_AnimGraphNode_TransitionResult_BD4321274F24CE537FBFAA8D90465C9B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_Gr_Piaofu_AnimGraphNode_TransitionResult_782AEEBB4F3BDC28114E589C1BA57806();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_Gr_Piaofu_AnimGraphNode_TransitionResult_BEB687804CDE5510F8B5DB8CB277EEA4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_Gr_Piaofu_AnimGraphNode_TransitionResult_7FCB46AF43166D4C8112A2848D472FAC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_Gr_Piaofu_AnimGraphNode_ModifyBone_C2A7B38D4D267646DD57438070EED1DD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Mon_Gr_Piaofu_AnimGraphNode_ApplyAdditive_709F48614279BC0FFFCC87A692A9C215();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BaseLayer(struct FPoseLink* BaseLayer_0);
	void HitAndDeadLayer(const struct FPoseLink& InPose, struct FPoseLink* HitAndDeadLayer_0);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Mon_Gr_Piaofu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Mon_Gr_Piaofu_C")
	}
	static class UABP_Mon_Gr_Piaofu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mon_Gr_Piaofu_C>();
	}
};
DUMPER7_ASSERTS_UABP_Mon_Gr_Piaofu_C;

}

