#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NPC_Cat01

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_NPC_Cat01.ABP_NPC_Cat01_C
// 0x0380 (0x0A30 - 0x06B0)
class UABP_NPC_Cat01_C final : public UNPCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06B8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x06E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0710(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0738(0x0158)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0890(0x0030)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer;                        // 0x08C0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0938(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0968(0x00C0)()
	float                                         Speed;                                             // 0x0A28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_NPC_Cat01(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_Cat01_AnimGraphNode_TransitionResult_9F4EB39B4D837706CFFD09B28F35EC46();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPC_Cat01_AnimGraphNode_TransitionResult_3B26A2D747712714618F7A95BC46971A();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_NPC_Cat01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_NPC_Cat01_C")
	}
	static class UABP_NPC_Cat01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_NPC_Cat01_C>();
	}
};
DUMPER7_ASSERTS_UABP_NPC_Cat01_C;

}

