#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: ABP_NPC_Weita_M_Kawaii

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_NPC_Weita_M_Kawaii.ABP_NPC_Weita_M_Kawaii_C
// 0x12080 (0x12340 - 0x02C0)
class UABP_NPC_Weita_M_Kawaii_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_32;                    // 0x02D0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_31;                    // 0x0B30(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_30;                    // 0x1390(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_29;                    // 0x1BF0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_28;                    // 0x2450(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_27;                    // 0x2CB0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_26;                    // 0x3510(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0x3D70(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0x45D0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0x4E30(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x5690(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x5EF0(0x0860)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x6750(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x6778(0x00A0)()
	uint8                                         Pad_6818[0x8];                                     // 0x6818(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x6820(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x7080(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x78E0(0x0860)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x8140(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x8168(0x0020)()
	uint8                                         Pad_8188[0x8];                                     // 0x8188(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x8190(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x89F0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x9250(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x9AB0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0xA310(0x0860)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0xAB70(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0xAB90(0x0860)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0xB3F0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0xB420(0x0118)()
	uint8                                         Pad_B538[0x8];                                     // 0xB538(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0xB540(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0xBDA0(0x0860)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_1;                        // 0xC600(0x0128)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone;                          // 0xC728(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0xC850(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0xC870(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0xC890(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0xC8C0(0x0118)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xC9D8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xC9F8(0x0020)()
	uint8                                         Pad_CA18[0x8];                                     // 0xCA18(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0xCA20(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0xD280(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0xDAE0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0xE340(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0xEBA0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0xF400(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0xFC60(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x104C0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x10D20(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x11580(0x0860)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x11DE0(0x0030)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x11E10(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x11ED0(0x0158)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x12028(0x00E0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x12108(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x12220(0x0030)()
	class FString                                 __CustomProperty_CurrentKawaiiState_0EA15FD84EE067E79D3CBF86468B6A5F; // 0x12250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableKawaiiSetting_0EA15FD84EE067E79D3CBF86468B6A5F; // 0x12260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12261[0x7];                                    // 0x12261(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 __CustomProperty_CurrentKawaiiState_65AEA94443575AC5F3157AB996667126; // 0x12268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableKawaiiSetting_65AEA94443575AC5F3157AB996667126; // 0x12278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12279[0x7];                                    // 0x12279(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	TMap<class FString, struct FKawaiiPhysicsSettings> CloakSettingMap;                              // 0x12280(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, struct FKawaiiPhysicsSettings> HairSettingMap;                               // 0x122D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Lean;                                              // 0x12320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LR;                                                // 0x12324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FB;                                                // 0x12328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0x1232C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pitch;                                             // 0x12330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ZY;                                                // 0x12334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         QH;                                                // 0x12338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_NPC_Weita_M_Kawaii(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void NewKawaiiLayer(const struct FPoseLink& InPose, bool bEnableKawaiiSetting, const class FString& CurrentKawaiiState, class UPlayerAnimInstance* OwnerInstance, bool IsPhantom, struct FPoseLink* NewKawaiiLayer_0);
	void ChestLayer(const struct FPoseLink& InPose_0, struct FPoseLink* ChestLayer_0);
	void InteractiveKawaiiLayer(const struct FPoseLink& InPose_2, bool bEnableKawaiiSetting, const class FString& CurrentKawaiiState, class UPlayerAnimInstance* OwnerInstance1, struct FPoseLink* InteractiveKawaiiLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_NPC_Weita_M_Kawaii_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_NPC_Weita_M_Kawaii_C")
	}
	static class UABP_NPC_Weita_M_Kawaii_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_NPC_Weita_M_Kawaii_C>();
	}
};
DUMPER7_ASSERTS_UABP_NPC_Weita_M_Kawaii_C;

}

