#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_QNF_Kawaii

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_QNF_Kawaii.ABP_QNF_Kawaii_C
// 0x3850 (0x3B10 - 0x02C0)
class UABP_QNF_Kawaii_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x02C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x02F8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0410(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0440(0x0118)()
	uint8                                         Pad_558[0x8];                                      // 0x0558(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x0560(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x0DC0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x1620(0x0860)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1E80(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x1EA0(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x2700(0x0860)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x2F60(0x0860)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x37C0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x37E0(0x0030)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x3810(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x38D0(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x39E8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x3A18(0x00E0)()
	class FString                                 __CustomProperty_CurrentKawaiiState_37F2FA4046F50514A438C1BCE529D87F; // 0x3AF8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bEnableKawaiiSetting_37F2FA4046F50514A438C1BCE529D87F; // 0x3B08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_QNF_Kawaii(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void NewKawaiiLayer(const struct FPoseLink& InPose, bool bEnableKawaiiSetting, const class FString& CurrentKawaiiState, class UPlayerAnimInstance* OwnerInstance, bool IsPhantom, struct FPoseLink* NewKawaiiLayer_0);
	void ChestLayer(const struct FPoseLink& InPose_0, struct FPoseLink* ChestLayer_0);
	void InteractiveKawaiiLayer(const struct FPoseLink& InPose_2, bool bEnableKawaiiSetting, const class FString& CurrentKawaiiState, class UPlayerAnimInstance* OwnerInstance1, struct FPoseLink* InteractiveKawaiiLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_QNF_Kawaii_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_QNF_Kawaii_C")
	}
	static class UABP_QNF_Kawaii_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_QNF_Kawaii_C>();
	}
};
DUMPER7_ASSERTS_UABP_QNF_Kawaii_C;

}

