#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackgroundBlurWithMask

#include "Basic.hpp"

#include "BackgroundBlurWithMask_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BackgroundBlurWithMask.BackgroundBlurWithMask.SetApplyAlphaToBlur
// 0x0001 (0x0001 - 0x0000)
struct BackgroundBlurWithMask_SetApplyAlphaToBlur final
{
public:
	bool                                          bInApplyAlphaToBlur;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BackgroundBlurWithMask_SetApplyAlphaToBlur;

// Function BackgroundBlurWithMask.BackgroundBlurWithMask.SetBlurRadius
// 0x0004 (0x0004 - 0x0000)
struct BackgroundBlurWithMask_SetBlurRadius final
{
public:
	int32                                         InBlurRadius;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BackgroundBlurWithMask_SetBlurRadius;

// Function BackgroundBlurWithMask.BackgroundBlurWithMask.SetBlurStrength
// 0x0004 (0x0004 - 0x0000)
struct BackgroundBlurWithMask_SetBlurStrength final
{
public:
	float                                         InStrength;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BackgroundBlurWithMask_SetBlurStrength;

// Function BackgroundBlurWithMask.BackgroundBlurWithMask.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct BackgroundBlurWithMask_SetHorizontalAlignment final
{
public:
	EHorizontalAlignment                          InHorizontalAlignment;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BackgroundBlurWithMask_SetHorizontalAlignment;

// Function BackgroundBlurWithMask.BackgroundBlurWithMask.SetLowQualityFallbackBrush
// 0x00D0 (0x00D0 - 0x0000)
struct BackgroundBlurWithMask_SetLowQualityFallbackBrush final
{
public:
	struct FSlateBrush                            InBrush;                                           // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BackgroundBlurWithMask_SetLowQualityFallbackBrush;

// Function BackgroundBlurWithMask.BackgroundBlurWithMask.SetMaskMaterialSetting
// 0x0018 (0x0018 - 0x0000)
struct BackgroundBlurWithMask_SetMaskMaterialSetting final
{
public:
	struct FMaskMaterialSetting                   InMaskMaterialSetting;                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BackgroundBlurWithMask_SetMaskMaterialSetting;

// Function BackgroundBlurWithMask.BackgroundBlurWithMask.SetMaskTexture
// 0x0008 (0x0008 - 0x0000)
struct BackgroundBlurWithMask_SetMaskTexture final
{
public:
	class UTexture2D*                             InMaskTexture;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BackgroundBlurWithMask_SetMaskTexture;

// Function BackgroundBlurWithMask.BackgroundBlurWithMask.SetMaskTextureChannel
// 0x0001 (0x0001 - 0x0000)
struct BackgroundBlurWithMask_SetMaskTextureChannel final
{
public:
	EMaskTextureChannel                           InMaskTextureChannel;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BackgroundBlurWithMask_SetMaskTextureChannel;

// Function BackgroundBlurWithMask.BackgroundBlurWithMask.SetPadding
// 0x0010 (0x0010 - 0x0000)
struct BackgroundBlurWithMask_SetPadding final
{
public:
	struct FMargin                                InPadding;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BackgroundBlurWithMask_SetPadding;

// Function BackgroundBlurWithMask.BackgroundBlurWithMask.SetUseMaskMaterial
// 0x0001 (0x0001 - 0x0000)
struct BackgroundBlurWithMask_SetUseMaskMaterial final
{
public:
	bool                                          bInUseMaskMaterial;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BackgroundBlurWithMask_SetUseMaskMaterial;

// Function BackgroundBlurWithMask.BackgroundBlurWithMask.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct BackgroundBlurWithMask_SetVerticalAlignment final
{
public:
	EVerticalAlignment                            InVerticalAlignment;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BackgroundBlurWithMask_SetVerticalAlignment;

// Function BackgroundBlurWithMask.BackgroundBlurWithMaskSlot.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct BackgroundBlurWithMaskSlot_SetHorizontalAlignment final
{
public:
	EHorizontalAlignment                          InHorizontalAlignment;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BackgroundBlurWithMaskSlot_SetHorizontalAlignment;

// Function BackgroundBlurWithMask.BackgroundBlurWithMaskSlot.SetPadding
// 0x0010 (0x0010 - 0x0000)
struct BackgroundBlurWithMaskSlot_SetPadding final
{
public:
	struct FMargin                                InPadding;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BackgroundBlurWithMaskSlot_SetPadding;

// Function BackgroundBlurWithMask.BackgroundBlurWithMaskSlot.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct BackgroundBlurWithMaskSlot_SetVerticalAlignment final
{
public:
	EVerticalAlignment                            InVerticalAlignment;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BackgroundBlurWithMaskSlot_SetVerticalAlignment;

}

