#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ANS_PostProcess

#include "Basic.hpp"

#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ANS_PostProcess.BP_ANS_PostProcess_C
// 0x0008 (0x0288 - 0x0280)
class UBP_ANS_PostProcess_C final : public UAnimNotifyState_EditorPP
{
public:
	int32                                         ConditionId;                                       // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _联机_所有人可见;                                  // 0x0284(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          影响Sequence;                                      // 0x0285(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          仅对自己生效;                                      // 0x0286(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          循环至通知结束;                                    // 0x0287(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool Received_NotifyBegin(class USkeletalMeshComponent* meshComp, class UAnimSequenceBase* Animation, float TotalDuration) const;
	bool Received_NotifyEnd(class USkeletalMeshComponent* meshComp, class UAnimSequenceBase* Animation) const;
	bool Received_NotifyTick(class USkeletalMeshComponent* meshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime) const;
	void BeginPPMatSet(class USkeletalMeshComponent* meshComp) const;
	void End_PPMat_Set(class USkeletalMeshComponent* Mesh_Comp) const;
	void UpdateCA(class USkeletalMeshComponent* meshComp) const;
	void GetPP(TArray<struct FWeightedBlendable>* PPMArray, struct FPostProcessSettings* PPSettings) const;
	void JudgeMode(class USkeletalMeshComponent* meshComp, bool* Mode) const;
	void Is_Main_Player(class UMeshComponent* Mesh, bool* Return) const;
	bool TickFuction(class USkeletalMeshComponent* meshComp) const;
	void CreateTranslucentMask(class USkeletalMeshComponent* Mesh) const;
	void ResetCamera(class USkeletalMeshComponent* meshComp) const;
	void TransformPosition(class UMeshComponent* Mesh, const struct FVector& PositionInput, struct FLinearColor* Position) const;
	void SetStencil(class USkeletalMeshComponent* Mesh, int32 Value, bool IsEnd) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ANS_PostProcess_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ANS_PostProcess_C")
	}
	static class UBP_ANS_PostProcess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ANS_PostProcess_C>();
	}
};
DUMPER7_ASSERTS_UBP_ANS_PostProcess_C;

}

