#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotifyState_Mon_SkillMove

#include "Basic.hpp"

#include "EM_classes.hpp"
#include "Mon_SkillMoveTo_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotifyState_Mon_SkillMove.BP_AnimNotifyState_Mon_SkillMove_C
// 0x0080 (0x02E0 - 0x0260)
class UBP_AnimNotifyState_Mon_SkillMove_C final : public UAnimNotifyState_Mon_SkillMove
{
public:
	bool                                          功能开关;                                          // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          位移开关;                                          // 0x0261(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          无视Z轴位移;                                       // 0x0262(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EMon_SkillMoveTo                              移动目标;                                          // 0x0263(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          移动至存储点;                                      // 0x0264(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         初速度;                                            // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         加速度;                                            // 0x026C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          转身开关;                                          // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          应用转身速率;                                      // 0x0271(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_272[0x2];                                      // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         转身速率;                                          // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CurrentSpeedKey;                                   // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 NotifyMonMoveSpeedKey;                             // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         转身最小角度;                                      // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MoveTargetLocName;                                 // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 ActorName;                                         // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SaveLocTag;                                        // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NeedCheckMinAngleKey;                              // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void 通知Tick(class ACharacterBase* 角色, class UAnimSequenceBase* 动画, float Frame_Delta_Time) const;
	void 获取速度(class ACharacterBase* 角色, float DeltaTime, struct FVector* 速度矢量, bool* 速度向前) const;
	void 根据加速度计算当前速度(float DeltaTime) const;
	void 通知结束时(class ACharacterBase* 角色, class UAnimSequenceBase* 动画) const;
	void GetTargetLocation(class ACharacterBase* Character) const;
	void JudgeUseSetOrMove(class ACharacterBase* Character, const struct FVector& Speed, float DeltaTime, bool* res) const;
	void GetFinalSpeed(const struct FVector& InSpeed, struct FVector* OutSpeed) const;
	bool Received_NotifyBegin(class USkeletalMeshComponent* meshComp, class UAnimSequenceBase* Animation, float TotalDuration) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimNotifyState_Mon_SkillMove_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimNotifyState_Mon_SkillMove_C")
	}
	static class UBP_AnimNotifyState_Mon_SkillMove_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotifyState_Mon_SkillMove_C>();
	}
};
DUMPER7_ASSERTS_UBP_AnimNotifyState_Mon_SkillMove_C;

}

