#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotifyState_BindMoveToCam

#include "Basic.hpp"

#include "BP_AnimNotifyStateBase_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotifyState_BindMoveToCam.BP_AnimNotifyState_BindMoveToCam_C
// 0x0010 (0x01E8 - 0x01D8)
class UBP_AnimNotifyState_BindMoveToCam_C final : public UBP_AnimNotifyStateBase_C
{
public:
	bool                                          Add_Pitch;                                         // 0x01D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Add_Yaw;                                           // 0x01D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxRotInput_;                                      // 0x01DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnlyGamepad;                                       // 0x01E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void 通知开始时(class ACharacterBase* 角色, class UAnimSequenceBase* 动画, float 总时长) const;
	void 通知结束时(class ACharacterBase* 角色, class UAnimSequenceBase* 动画) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimNotifyState_BindMoveToCam_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimNotifyState_BindMoveToCam_C")
	}
	static class UBP_AnimNotifyState_BindMoveToCam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotifyState_BindMoveToCam_C>();
	}
};
DUMPER7_ASSERTS_UBP_AnimNotifyState_BindMoveToCam_C;

}

