#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_AutoDoorBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ConditionalGate_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AutoDoorBase.BP_AutoDoorBase_C
// 0x0018 (0x0B88 - 0x0B70)
class ABP_AutoDoorBase_C : public ABP_ConditionalGate_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AutoDoorBase_C;                  // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          door_state;                                        // 0x0B78(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          if_door;                                           // 0x0B79(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B7A[0x6];                                      // 0x0B7A(0x0006)(Fixing Size After Last Property [ Dumper-DNA ])
	class ABP_Arrow_C*                            BPArrow;                                           // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AutoDoorBase(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void DoorStateColor_1();
	void BndEvt__BP_ConditionalGate_Base_Box_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_ConditionalGate_Base_Box_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveBeginPlay();
	void OnCharacterChangeLevel(class ACharacterBase* Character);
	void IndicatorColor();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AutoDoorBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AutoDoorBase_C")
	}
	static class ABP_AutoDoorBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AutoDoorBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_AutoDoorBase_C;

}

