#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotifyStateBase_ModifyMoveSpeed

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AnimNotifyStateBase_ModifyMoveSpeed.BP_AnimNotifyStateBase_ModifyMoveSpeed_C.通知开始时
// 0x0060 (0x0060 - 0x0000)
struct BP_AnimNotifyStateBase_ModifyMoveSpeed_C_通知开始时 final
{
public:
	class ACharacterBase*                         角色;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      动画;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         总时长;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillObject*                           CallFunc_GetCurrentSkill_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEffectSourceInterface> CallFunc_AddBuffToTarget_Source_CastInput;        // 0x0020(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TScriptInterface<class IEffectSourceInterface> CallFunc_AddBuffToTarget_Target_CastInput;        // 0x0030(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TScriptInterface<class ISkillLevelInterface>  CallFunc_AddBuffToTarget_SkillLevelSource_CastInput; // 0x0040(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TArray<class UBuff*>                          CallFunc_AddBuffToTarget_ReturnValue;              // 0x0050(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_BP_AnimNotifyStateBase_ModifyMoveSpeed_C_通知开始时;

// Function BP_AnimNotifyStateBase_ModifyMoveSpeed.BP_AnimNotifyStateBase_ModifyMoveSpeed_C.通知结束时
// 0x0038 (0x0038 - 0x0000)
struct BP_AnimNotifyStateBase_ModifyMoveSpeed_C_通知结束时 final
{
public:
	class ACharacterBase*                         角色;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      动画;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEffectSourceInterface> CallFunc_RemoveBuffFromTarget_Source_CastInput;   // 0x0010(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TScriptInterface<class IEffectSourceInterface> CallFunc_RemoveBuffFromTarget_Target_CastInput;   // 0x0020(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CallFunc_RemoveBuffFromTarget_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AnimNotifyStateBase_ModifyMoveSpeed_C_通知结束时;

}

