#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AccessoryItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AccessoryItem.BP_AccessoryItem_C
// 0x0028 (0x0358 - 0x0330)
class ABP_AccessoryItem_C final : public AAccessoryItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ____1________27C3AE7E413B7A5C9FF52FB951CD9363;     // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____1__Direction_27C3AE7E413B7A5C9FF52FB951CD9363; // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_1;                                          // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____0________8DD0A959446D3F8D7F685F95EB2582F7;     // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_8DD0A959446D3F8D7F685F95EB2582F7; // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0;                                          // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AccessoryItem(int32 EntryPoint);
	void SetDisBack();
	void StopDisTimer();
	void OnWeaponMoveToBackTimer();
	void AccessoryMoveToHand();
	void StopDis();
	void Accessory_Move_To_Back();
	void ReceiveBeginPlay();
	void 时间轴_1__UpdateFunc();
	void 时间轴_1__FinishedFunc();
	void 时间轴_0__UpdateFunc();
	void 时间轴_0__FinishedFunc();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AccessoryItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AccessoryItem_C")
	}
	static class ABP_AccessoryItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AccessoryItem_C>();
	}
};
DUMPER7_ASSERTS_ABP_AccessoryItem_C;

}

