#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_AnimNotifyState_CreateGhost

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_AnimNotifyStateBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotifyState_CreateGhost.BP_AnimNotifyState_CreateGhost_C
// 0x0070 (0x0248 - 0x01D8)
class UBP_AnimNotifyState_CreateGhost_C final : public UBP_AnimNotifyStateBase_C
{
public:
	class UMaterialInterface*                     MAT;                                               // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Life_Time;                                         // 0x01E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class UCurveFloat*                            Curve;                                             // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FLinearColor>        Color;                                             // 0x01F0(0x0050)(Edit, BlueprintVisible)
	bool                                          UseCharColor;                                      // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	float                                         Interval;                                          // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class FString GetNotifyName() const;
	void 通知Tick(class ACharacterBase* 角色, class UAnimSequenceBase* 动画, float Frame_Delta_Time) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimNotifyState_CreateGhost_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimNotifyState_CreateGhost_C")
	}
	static class UBP_AnimNotifyState_CreateGhost_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotifyState_CreateGhost_C>();
	}
};
DUMPER7_ASSERTS_UBP_AnimNotifyState_CreateGhost_C;

}

