#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotifyStateBase_EffectCreature

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_AnimNotifyStateBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotifyStateBase_EffectCreature.BP_AnimNotifyStateBase_EffectCreature_C
// 0x00B8 (0x0290 - 0x01D8)
class UBP_AnimNotifyStateBase_EffectCreature_C final : public UBP_AnimNotifyStateBase_C
{
public:
	int32                                         EffectCreatureId;                                  // 0x01D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ConditionId;                                       // 0x01DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Transform;                                         // 0x01E0(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	bool                                          Attach_to_Char;                                    // 0x0210(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Socket_Name;                                       // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          UpdateAnimOnInit;                                  // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, int32>                    EffectCreatureIdByCharTag;                         // 0x0230(0x0050)(Edit, BlueprintVisible)
	bool                                          IsChangeByCharTag;                                 // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void 通知开始时(class ACharacterBase* 角色, class UAnimSequenceBase* 动画, float 总时长) const;
	void 通知结束时(class ACharacterBase* 角色, class UAnimSequenceBase* 动画) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimNotifyStateBase_EffectCreature_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimNotifyStateBase_EffectCreature_C")
	}
	static class UBP_AnimNotifyStateBase_EffectCreature_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotifyStateBase_EffectCreature_C>();
	}
};
DUMPER7_ASSERTS_UBP_AnimNotifyStateBase_EffectCreature_C;

}

