#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArtBreakableItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ArtBreakableItem.BP_ArtBreakableItem_C
// 0x0048 (0x06F8 - 0x06B0)
class ABP_ArtBreakableItem_C : public ANewBreakableItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         BPModelId;                                         // 0x06B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SoundEvent;                                        // 0x06BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C4[0x4];                                      // 0x06C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Radius;                                            // 0x06C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 MaxCullDistance_Mobile_;                           // 0x06D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 MaxCullDistance_PC_;                               // 0x06E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_ArtBreakableItem(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetMaxCullDistance(TArray<float>& Radius_0, TArray<float>& MaxCullDistance, class UStaticMeshComponent* StaticMeshComp);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ArtBreakableItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ArtBreakableItem_C")
	}
	static class ABP_ArtBreakableItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ArtBreakableItem_C>();
	}
};
DUMPER7_ASSERTS_ABP_ArtBreakableItem_C;

}

