#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_AnimNotifyState_HideChar

#include "Basic.hpp"

#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotifyState_HideChar.BP_AnimNotifyState_HideChar_C
// 0x0010 (0x00A0 - 0x0090)
class UBP_AnimNotifyState_HideChar_C final : public UAnimNotifyState_HideChar
{
public:
	bool                                          隐藏角色;                                          // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          隐藏武器;                                          // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          隐藏未持有的近战武器;                              // 0x0092(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          隐藏未持有的远程武器;                              // 0x0093(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          隐藏未持有的显赫武器;                              // 0x0094(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          隐藏未使用的bind状态下武器;                        // 0x0095(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          隐藏配件;                                          // 0x0096(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          隐藏武器配件;                                      // 0x0097(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          显示宠物;                                          // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool Received_NotifyBegin(class USkeletalMeshComponent* meshComp, class UAnimSequenceBase* Animation, float TotalDuration) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimNotifyState_HideChar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimNotifyState_HideChar_C")
	}
	static class UBP_AnimNotifyState_HideChar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotifyState_HideChar_C>();
	}
};
DUMPER7_ASSERTS_UBP_AnimNotifyState_HideChar_C;

}

