#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_AnimNotifyState_ForbidRootMotion

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AnimNotifyState_ForbidRootMotion.BP_AnimNotifyState_ForbidRootMotion_C.通知结束时
// 0x0010 (0x0010 - 0x0000)
struct BP_AnimNotifyState_ForbidRootMotion_C_通知结束时 final
{
public:
	class ACharacterBase*                         角色;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      动画;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AnimNotifyState_ForbidRootMotion_C_通知结束时;

// Function BP_AnimNotifyState_ForbidRootMotion.BP_AnimNotifyState_ForbidRootMotion_C.通知开始时
// 0x0018 (0x0018 - 0x0000)
struct BP_AnimNotifyState_ForbidRootMotion_C_通知开始时 final
{
public:
	class ACharacterBase*                         角色;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      动画;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         总时长;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AnimNotifyState_ForbidRootMotion_C_通知开始时;

}

