#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_AnimNotifyState_SkillCancel

#include "Basic.hpp"

#include "BP_AnimNotifyStateBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotifyState_SkillCancel.BP_AnimNotifyState_SkillCancel_C
// 0x0018 (0x01F0 - 0x01D8)
class UBP_AnimNotifyState_SkillCancel_C final : public UBP_AnimNotifyStateBase_C
{
public:
	bool                                          OtherSkillCancel;                                  // 0x01D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Attack;                                            // 0x01D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HeavyAttack;                                       // 0x01DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          FallAttack;                                        // 0x01DB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SlideAttack;                                       // 0x01DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Block;                                             // 0x01DD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Shooting;                                          // 0x01DE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HeavyShooting;                                     // 0x01DF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Reload;                                            // 0x01E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Skill1;                                            // 0x01E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Skill2;                                            // 0x01E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Skill3;                                            // 0x01E3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Condemn;                                           // 0x01E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	class UAnimSequenceBase*                      动画;                                              // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void 通知开始时(class ACharacterBase* 角色, class UAnimSequenceBase* 动画_0, float 总时长) const;
	void 通知结束时(class ACharacterBase* 角色, class UAnimSequenceBase* 动画_0) const;
	class FString GetNotifyName() const;
	void Make_Skill_Cancel_Bitmask(int32* Result) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimNotifyState_SkillCancel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimNotifyState_SkillCancel_C")
	}
	static class UBP_AnimNotifyState_SkillCancel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotifyState_SkillCancel_C>();
	}
};
DUMPER7_ASSERTS_UBP_AnimNotifyState_SkillCancel_C;

}

