#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArtBreakableItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ArtBreakableItem.BP_ArtBreakableItem_C.ExecuteUbergraph_BP_ArtBreakableItem
// 0x0008 (0x0008 - 0x0000)
struct BP_ArtBreakableItem_C_ExecuteUbergraph_BP_ArtBreakableItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningOnMobile_bIsMobile;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_ArtBreakableItem_C_ExecuteUbergraph_BP_ArtBreakableItem;

// Function BP_ArtBreakableItem.BP_ArtBreakableItem_C.SetMaxCullDistance
// 0x0038 (0x0038 - 0x0000)
struct BP_ArtBreakableItem_C_SetMaxCullDistance final
{
public:
	TArray<float>                                 Radius_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<float>                                 MaxCullDistance;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UStaticMeshComponent*                   StaticMeshComp;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBreakableItemRadius_ReturnValue;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_1;         // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_2;         // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_3;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_ArtBreakableItem_C_SetMaxCullDistance;

// Function BP_ArtBreakableItem.BP_ArtBreakableItem_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_ArtBreakableItem_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ArtBreakableItem_C_GetModuleName;

}

