#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArtBreakableItem_Ref

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_ArtBreakableItem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ArtBreakableItem_Ref.BP_ArtBreakableItem_Ref_C
// 0x00E8 (0x07E0 - 0x06F8)
class ABP_ArtBreakableItem_Ref_C : public ABP_ArtBreakableItem_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ArtBreakableItem_Ref_C;          // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RandomMesh;                                        // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_0_NewTrack_0_8A3F658F4D4593EB833CEFBF3500C4F0; // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0_0__Direction_8A3F658F4D4593EB833CEFBF3500C4F0; // 0x0714(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_715[0x3];                                      // 0x0715(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0_0;                                      // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    RandOfList;                                        // 0x0720(0x0010)(Edit, BlueprintVisible)
	float                                         Width;                                             // 0x0730(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EmissiveColor;                                     // 0x0734(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OpenFoam;                                          // 0x0744(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_745[0x3];                                      // 0x0745(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    Foam;                                              // 0x0748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             FoamTransform;                                     // 0x0750(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	float                                         Duration;                                          // 0x0780(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SecondMesh;                                        // 0x0784(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_785[0x3];                                      // 0x0785(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            InputSecondMesh;                                   // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SecondMeshDuration;                                // 0x0790(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_794[0xC];                                      // 0x0794(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SecondMeshTransform;                               // 0x07A0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMesh*                            MultiSolverMesh;                                   // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MultiSolver;                                       // 0x07D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_ArtBreakableItem_Ref(int32 EntryPoint);
	void ArtShowDeath();
	void ItemMeshChildComponentInit();
	void Timeline_0_0__UpdateFunc();
	void Timeline_0_0__FinishedFunc();
	void UserConstructionScript();
	void BreakableItemFunction(class UStaticMeshComponent* Input, int32 SlotsIndex, class UMaterialInstanceDynamic** DynamicMaterial);
	void FoamInit();
	void RemoveFoam();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ArtBreakableItem_Ref_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ArtBreakableItem_Ref_C")
	}
	static class ABP_ArtBreakableItem_Ref_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ArtBreakableItem_Ref_C>();
	}
};
DUMPER7_ASSERTS_ABP_ArtBreakableItem_Ref_C;

}

