#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotify_SkillRawPlayFX

#include "Basic.hpp"

#include "EM_structs.hpp"


namespace SDK::Params
{

// Function BP_AnimNotify_SkillRawPlayFX.BP_AnimNotify_SkillRawPlayFX_C.通知时
// 0x0050 (0x0050 - 0x0000)
struct BP_AnimNotify_SkillRawPlayFX_C_通知时 final
{
public:
	class ACharacterBase*                         角色;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      动画序列;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	class ABP_Battle_C*                           CallFunc_Battle___;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayFXParams                          K2Node_MakeStruct_PlayFXParams;                    // 0x0028(0x0018)(NoDestructor)
	TScriptInterface<class IEffectSourceInterface> CallFunc_SkillRawPlayFX_Source_CastInput;         // 0x0040(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
DUMPER7_ASSERTS_BP_AnimNotify_SkillRawPlayFX_C_通知时;

}

