#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotify_WeaponAnim

#include "Basic.hpp"

#include "BP_AnimNotifyBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotify_WeaponAnim.BP_AnimNotify_WeaponAnim_C
// 0x0060 (0x00C0 - 0x0060)
class UBP_AnimNotify_WeaponAnim_C final : public UBP_AnimNotifyBase_C
{
public:
	int32                                         WeaponAnims;                                       // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubWeaponAnims;                                    // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WeaponAnimSpeed;                                   // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, int32>                    WeaponAnimsByBody;                                 // 0x0070(0x0050)(Edit, BlueprintVisible)

public:
	void 通知时(class ACharacterBase* 角色, class UAnimSequenceBase* 动画序列) const;
	bool Received_Notify(class USkeletalMeshComponent* meshComp, class UAnimSequenceBase* Animation) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimNotify_WeaponAnim_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimNotify_WeaponAnim_C")
	}
	static class UBP_AnimNotify_WeaponAnim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotify_WeaponAnim_C>();
	}
};
DUMPER7_ASSERTS_UBP_AnimNotify_WeaponAnim_C;

}

