#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotify_WeaponFX

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_AnimNotifyBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotify_WeaponFX.BP_AnimNotify_WeaponFX_C
// 0x0118 (0x0178 - 0x0060)
class UBP_AnimNotify_WeaponFX_C final : public UBP_AnimNotifyBase_C
{
public:
	class FName                                   GroupName;                                         // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SecondSocketName;                                  // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, struct FVector>           LocalOffset;                                       // 0x0078(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, struct FRotator>          LocalRotation;                                     // 0x00C8(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, struct FVector>           LocalScale;                                        // 0x0118(0x0050)(Edit, BlueprintVisible)
	bool                                          AttachNotFollow;                                   // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         特效半透层级;                                      // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCommon;                                          // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void 通知时(class ACharacterBase* 角色, class UAnimSequenceBase* 动画序列) const;
	bool Received_Notify(class USkeletalMeshComponent* meshComp, class UAnimSequenceBase* Animation) const;
	void 通知(class ACharacterBase* 角色, class ABP_WeaponBase_C* 武器) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimNotify_WeaponFX_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimNotify_WeaponFX_C")
	}
	static class UBP_AnimNotify_WeaponFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotify_WeaponFX_C>();
	}
};
DUMPER7_ASSERTS_UBP_AnimNotify_WeaponFX_C;

}

