#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotifyState_CameraYawFollow

#include "Basic.hpp"

#include "BP_AnimNotifyStateBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotifyState_CameraYawFollow.BP_AnimNotifyState_CameraYawFollow_C
// 0x0010 (0x01E8 - 0x01D8)
class UBP_AnimNotifyState_CameraYawFollow_C final : public UBP_AnimNotifyStateBase_C
{
public:
	float                                         开启跟踪角度;                                      // 0x01D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EEasingFunc                                   缓动曲线;                                          // 0x01DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         秒;                                                // 0x01E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         每秒角度;                                          // 0x01E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	bool Received_NotifyBegin(class USkeletalMeshComponent* meshComp, class UAnimSequenceBase* Animation, float TotalDuration) const;
	bool Received_NotifyEnd(class USkeletalMeshComponent* meshComp, class UAnimSequenceBase* Animation) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimNotifyState_CameraYawFollow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimNotifyState_CameraYawFollow_C")
	}
	static class UBP_AnimNotifyState_CameraYawFollow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotifyState_CameraYawFollow_C>();
	}
};
DUMPER7_ASSERTS_UBP_AnimNotifyState_CameraYawFollow_C;

}

