#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ANS_CameraShake

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"
#include "NotifyTargetEnum_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ANS_CameraShake.BP_ANS_CameraShake_C
// 0x0078 (0x00B0 - 0x0038)
class UBP_ANS_CameraShake_C final : public UAnimNotifyState_CameraShake
{
public:
	float                                         OscillationDuration;                               // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OscillationBlendInTime;                            // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OscillationBlendOutTime;                           // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FROscillator                           RotOscillation;                                    // 0x0044(0x0024)(Edit, BlueprintVisible, NoDestructor)
	struct FVOscillator                           LocOscillation;                                    // 0x0068(0x0024)(Edit, BlueprintVisible, NoDestructor)
	struct FFOscillator                           FOVOscillation;                                    // 0x008C(0x000C)(Edit, BlueprintVisible, NoDestructor)
	int32                                         ConditionId;                                       // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENotifyTargetEnum                             NotifyTarget;                                      // 0x009C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Inner_Radius;                                      // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Outer_Radius;                                      // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Falloff;                                           // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_NotifyBegin(class USkeletalMeshComponent* meshComp, class UAnimSequenceBase* Animation, float TotalDuration) const;
	bool Received_NotifyTick(class USkeletalMeshComponent* meshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ANS_CameraShake_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ANS_CameraShake_C")
	}
	static class UBP_ANS_CameraShake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ANS_CameraShake_C>();
	}
};
DUMPER7_ASSERTS_UBP_ANS_CameraShake_C;

}

