#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotify_AUFootstepsChar

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotify_AUFootstepsChar.BP_AnimNotify_AUFootstepsChar_C
// 0x0048 (0x01C0 - 0x0178)
class UBP_AnimNotify_AUFootstepsChar_C final : public UAnimNotify_AUFootStepsChar
{
public:
	bool                                          Preview;                                           // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          IsPlayAU;                                          // 0x0179(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Follow;                                            // 0x017A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17B[0x1];                                      // 0x017B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FootstepAUSocket;                                  // 0x017C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FootStepEventPath;                                 // 0x0188(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsPlayFX;                                          // 0x0198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FX_RoleName;                                       // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   FootstepFXSocket;                                  // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              Material_Type;                                     // 0x01B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bEndStop;                                          // 0x01B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLoopPlay;                                         // 0x01BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	class FString GetNotifyName() const;
	bool Received_Notify(class USkeletalMeshComponent* meshComp, class UAnimSequenceBase* Animation) const;
	void PlayFX(class ACharacterBase* Character, const class FString& Material, const struct FVector& Location) const;
	void PreviewFootstepAU(class USkeletalMeshComponent* Mesh) const;
	void PlaySE(class ACharacterBase* Character, const struct FHitResult& HitResult, EPhysicalSurface PhysMaterial, class UAnimSequenceBase* Anim) const;
	class UPhysicalMaterial* TryGetLandProxyPhysicalSurface(const struct FHitResult& HitResult) const;
	void PlayEventAfterEventLoaded(class UFMODEvent* Event, class ACharacterBase* Character, class UAnimSequenceBase* Anim, const struct FHitResult& HitResult, float Material) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimNotify_AUFootstepsChar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimNotify_AUFootstepsChar_C")
	}
	static class UBP_AnimNotify_AUFootstepsChar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotify_AUFootstepsChar_C>();
	}
};
DUMPER7_ASSERTS_UBP_AnimNotify_AUFootstepsChar_C;

}

