#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotifyState_WeaponFX

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_AnimNotifyStateBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotifyState_WeaponFX.BP_AnimNotifyState_WeaponFX_C
// 0x0118 (0x02F0 - 0x01D8)
class UBP_AnimNotifyState_WeaponFX_C final : public UBP_AnimNotifyStateBase_C
{
public:
	class FName                                   GroupName;                                         // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SecondSocketName;                                  // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, struct FVector>           LocalOffset;                                       // 0x01F0(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, struct FRotator>          LocalRotation;                                     // 0x0240(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, struct FVector>           LocalScale;                                        // 0x0290(0x0050)(Edit, BlueprintVisible)
	bool                                          AttachNotFollow;                                   // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         特效半透层级;                                      // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCommon;                                          // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void 通知开始时(class ACharacterBase* 角色, class UAnimSequenceBase* 动画, float 总时长) const;
	void 通知结束时(class ACharacterBase* 角色, class UAnimSequenceBase* 动画) const;
	bool Received_NotifyBegin(class USkeletalMeshComponent* meshComp, class UAnimSequenceBase* Animation, float TotalDuration) const;
	bool Received_NotifyEnd(class USkeletalMeshComponent* meshComp, class UAnimSequenceBase* Animation) const;
	void 通知开始(class ACharacterBase* 角色, class ABP_WeaponBase_C* 武器) const;
	void 通知结束(class ACharacterBase* 角色, class ABP_WeaponBase_C* 武器) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimNotifyState_WeaponFX_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimNotifyState_WeaponFX_C")
	}
	static class UBP_AnimNotifyState_WeaponFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotifyState_WeaponFX_C>();
	}
};
DUMPER7_ASSERTS_UBP_AnimNotifyState_WeaponFX_C;

}

