#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotify_CameraShake

#include "Basic.hpp"

#include "BP_AnimNotifyBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotify_CameraShake.BP_AnimNotify_CameraShake_C
// 0x0028 (0x0088 - 0x0060)
class UBP_AnimNotify_CameraShake_C final : public UBP_AnimNotifyBase_C
{
public:
	class UClass*                                 ShakeBP;                                           // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShakeScale;                                        // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShakeRandom;                                       // 0x006C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShakeScaleMin;                                     // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShakeScaleMax;                                     // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         ShakeClassGroup;                                   // 0x0078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void 通知时(class ACharacterBase* 角色, class UAnimSequenceBase* 动画序列) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimNotify_CameraShake_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimNotify_CameraShake_C")
	}
	static class UBP_AnimNotify_CameraShake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotify_CameraShake_C>();
	}
};
DUMPER7_ASSERTS_UBP_AnimNotify_CameraShake_C;

}

