#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BuffManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BuffManager.BP_BuffManager_C
// 0x0058 (0x0BB0 - 0x0B58)
class UBP_BuffManager_C final : public UBuffManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<TSoftObjectPtr<class UMaterialInterface>> MonsterBuffMaterial;                            // 0x0B60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          FirstBuff;                                         // 0x0B70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B71[0x3];                                      // 0x0B71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IndexID;                                           // 0x0B74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterFashionComponent*             Character_Fashion;                                 // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInterface>      MonsterMaterialBase;                               // 0x0B80(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               WeaponMatStore;                                    // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BuffManager(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetFXMIDMatrerialsParams(class UMeshComponent* MeshComponent, float ParamValue);
	void ClearFXMIDMatrerialsParams(class UMeshComponent* MeshComponent);
	void SetFrenelParams(class UMeshComponent* MeshComponent, float FresnelColorRange, const struct FLinearColor& FresnelColor, float FresnelColorStrength);
	void CopyMonsterParams(class UMaterialInterface* ParentMat, class UMaterialInstanceDynamic* NewMat);
	void AddBuff(class UMaterialInstanceDynamic* Material, int32 ElementIndex, class UPrimitiveComponent* TargetMesh);
	void ClearBuff(class UMaterialInstanceDynamic* Material, int32 ElementIndex, class UPrimitiveComponent* Target);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BuffManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BuffManager_C")
	}
	static class UBP_BuffManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BuffManager_C>();
	}
};
DUMPER7_ASSERTS_UBP_BuffManager_C;

}

