#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_Boss_Xibi

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_MonsterCharacter_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Boss_Xibi.BP_Boss_Xibi_C
// 0x00A0 (0x29C0 - 0x2920)
class ABP_Boss_Xibi_C : public ABP_MonsterCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Boss_Xibi_C;                     // 0x2918(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class FName>                           HitBoneNames;                                      // 0x2920(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           Lock_Bone_Names;                                   // 0x2930(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   CanUseLastSkill;                                   // 0x2940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, float>                    Key_Value_Groups;                                  // 0x2948(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   TargetPlayerDead;                                  // 0x2998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 KillTalkId;                                        // 0x29A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 SaveLocBorn;                                       // 0x29B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Boss_Xibi(int32 EntryPoint);
	void SetSelfLoc03(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus);
	void SetSelfLoc02(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus);
	void PlayCondemnedTalk();
	void PlayKillTalk();
	void ReceiveTick(float DeltaSeconds);
	void BossBattleStart();
	void PlayBattleStartvo();
	void SetSelfLoc(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus);
	void Skill03EQSEvent();
	void TriggerBeCondemned();
	void GetHitBones(TArray<class FName>* HitBones);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Boss_Xibi_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Boss_Xibi_C")
	}
	static class ABP_Boss_Xibi_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Boss_Xibi_C>();
	}
};
DUMPER7_ASSERTS_ABP_Boss_Xibi_C;

}

