#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_BodyAccessoryItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BodyAccessoryItem.BP_BodyAccessoryItem_C
// 0x0030 (0x0418 - 0x03E8)
class ABP_BodyAccessoryItem_C final : public ABodyAccessoryItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_FXComponent_C*                      FXComponent;                                       // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Dis_9CE816A245DC4F988BB3659FA568781C;   // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_9CE816A245DC4F988BB3659FA568781C; // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FD[0x3];                                      // 0x03FD(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     OriMat;                                            // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dissolving;                                        // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_BodyAccessoryItem(int32 EntryPoint);
	void Event_InitPara();
	void SetDitherAlpha(float Alpha, float OP);
	void EventStopDis();
	void ClearDissolve();
	void BeginDissolve();
	void SetMesh(class UObject* Mesh_0);
	void ReceiveBeginPlay();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void PlayAccessoryAnimByIndex(int32 AnimIndex, bool bLoop);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BodyAccessoryItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BodyAccessoryItem_C")
	}
	static class ABP_BodyAccessoryItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BodyAccessoryItem_C>();
	}
};
DUMPER7_ASSERTS_ABP_BodyAccessoryItem_C;

}

