#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Baonu_HeavyAttack

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Baonu_HeavyAttack.BP_Baonu_HeavyAttack_C.ExecuteUbergraph_BP_Baonu_HeavyAttack
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Baonu_HeavyAttack_C_ExecuteUbergraph_BP_Baonu_HeavyAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_ComponentBoundEvent_Character_3;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkillObject*                           K2Node_ComponentBoundEvent_Skill_1;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_ComponentBoundEvent_Character_2;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsDodgeBack;            // 0x0020(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_ComponentBoundEvent_Character_1;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageStruct*                          K2Node_ComponentBoundEvent_Damage;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEffectSourceInterface> K2Node_ComponentBoundEvent_Source;                // 0x0038(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TScriptInterface<class IEffectSourceInterface> K2Node_ComponentBoundEvent_Target;                // 0x0048(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	float                                         CallFunc_GetAttr_ByEnum_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IEffectSourceInterface> CallFunc_GetAttr_Float_Source_CastInput;          // 0x0060(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	float                                         CallFunc_GetAttr_Float_ReturnValue;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_ComponentBoundEvent_Character;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkillObject*                           K2Node_ComponentBoundEvent_Skill;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Baonu_HeavyAttack_C_ExecuteUbergraph_BP_Baonu_HeavyAttack;

// Function BP_Baonu_HeavyAttack.BP_Baonu_HeavyAttack_C.BndEvt__BP_Baonu_HeavyAttack_BattleEvent_K2Node_ComponentBoundEvent_3_SkillEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Baonu_HeavyAttack_C_BndEvt__BP_Baonu_HeavyAttack_BattleEvent_K2Node_ComponentBoundEvent_3_SkillEvent__DelegateSignature final
{
public:
	class ACharacterBase*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkillObject*                           Skill;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Baonu_HeavyAttack_C_BndEvt__BP_Baonu_HeavyAttack_BattleEvent_K2Node_ComponentBoundEvent_3_SkillEvent__DelegateSignature;

// Function BP_Baonu_HeavyAttack.BP_Baonu_HeavyAttack_C.BndEvt__BP_Baonu_HeavyAttack_BattleEvent_K2Node_ComponentBoundEvent_2_EMDamageEvent__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct BP_Baonu_HeavyAttack_C_BndEvt__BP_Baonu_HeavyAttack_BattleEvent_K2Node_ComponentBoundEvent_2_EMDamageEvent__DelegateSignature final
{
public:
	class ACharacterBase*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageStruct*                          Damage;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEffectSourceInterface> Source;                                           // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper)
	TScriptInterface<class IEffectSourceInterface> Target;                                           // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper)
};
DUMPER7_ASSERTS_BP_Baonu_HeavyAttack_C_BndEvt__BP_Baonu_HeavyAttack_BattleEvent_K2Node_ComponentBoundEvent_2_EMDamageEvent__DelegateSignature;

// Function BP_Baonu_HeavyAttack.BP_Baonu_HeavyAttack_C.BndEvt__BP_Baonu_HeavyAttack_BattleEvent_K2Node_ComponentBoundEvent_1_EnterDodging__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Baonu_HeavyAttack_C_BndEvt__BP_Baonu_HeavyAttack_BattleEvent_K2Node_ComponentBoundEvent_1_EnterDodging__DelegateSignature final
{
public:
	class ACharacterBase*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDodgeBack;                                       // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Baonu_HeavyAttack_C_BndEvt__BP_Baonu_HeavyAttack_BattleEvent_K2Node_ComponentBoundEvent_1_EnterDodging__DelegateSignature;

// Function BP_Baonu_HeavyAttack.BP_Baonu_HeavyAttack_C.BndEvt__BP_Baonu_HeavyAttack_BattleEvent_K2Node_ComponentBoundEvent_0_SkillEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Baonu_HeavyAttack_C_BndEvt__BP_Baonu_HeavyAttack_BattleEvent_K2Node_ComponentBoundEvent_0_SkillEvent__DelegateSignature final
{
public:
	class ACharacterBase*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkillObject*                           Skill;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Baonu_HeavyAttack_C_BndEvt__BP_Baonu_HeavyAttack_BattleEvent_K2Node_ComponentBoundEvent_0_SkillEvent__DelegateSignature;

}

