#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_Common_HeavyAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PassiveEffectBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Common_HeavyAttack.BP_Common_HeavyAttack_C
// 0x0028 (0x0130 - 0x0108)
class UBP_Common_HeavyAttack_C final : public UBP_PassiveEffectBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         LocalComboCost;                                    // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<float>                                 HeavyAttackRate;                                   // 0x0118(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ClearComboFlag;                                    // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Common_HeavyAttack(int32 EntryPoint);
	void BndEvt__BP_Common_HeavyAttack_BattleEvent_K2Node_ComponentBoundEvent_0_InitDamage__DelegateSignature(class ACharacterBase* Character, class UDamageStruct* Damage, const TScriptInterface<class IEffectSourceInterface>& Source, const TScriptInterface<class IEffectSourceInterface>& Target);
	void BndEvt__BP_Common_HeavyAttack_BattleEvent_K2Node_ComponentBoundEvent_2_SkillEvent__DelegateSignature(class ACharacterBase* Character, class USkillObject* Skill);
	void ClearComboCount();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Common_HeavyAttack_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Common_HeavyAttack_C")
	}
	static class UBP_Common_HeavyAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Common_HeavyAttack_C>();
	}
};
DUMPER7_ASSERTS_UBP_Common_HeavyAttack_C;

}

