#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_CameraControlComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CameraControlComponent.BP_CameraControlComponent_C
// 0x00F8 (0x0300 - 0x0208)
class UBP_CameraControlComponent_C : public UCameraControlComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsArmInputControllable;                            // 0x0210(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 IdleTag;                                           // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          RideCamera;                                        // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	class FName                                   BasicCameraState;                                  // 0x022C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	TMap<class FName, struct FCameraControlStruct> CameraDataMap;                                    // 0x0238(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, float>                      TransitionTimeMap;                                 // 0x0288(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   New_Tag;                                           // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Old_Tag;                                           // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSpecialShooting;                                 // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	class FName                                   ShootCameraState;                                  // 0x02EC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CameraPriority;                                    // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       Player;                                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ForceNoCamera(bool Active);
	void SetBossCamera(bool Active);
	void ApplyCameraState(const class FString& CameraName, float TransitionTime, bool* Success);
	void CanBeControlledByTick(bool* Condition);
	void OnCharacterTagChanged_BP(class FName OldTag, class FName NewTag);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_CameraControlComponent(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CameraControlComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CameraControlComponent_C")
	}
	static class UBP_CameraControlComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CameraControlComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_CameraControlComponent_C;

}

