#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_ConditionalGate_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_structs.hpp"
#include "EM_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ConditionalGate_Base.BP_ConditionalGate_Base_C
// 0x00F0 (0x0B70 - 0x0A80)
class ABP_ConditionalGate_Base_C : public AConditionGateBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   GuidePos;                                          // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          NavModifierBox;                                    // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentTriggerPlayerNum;                           // 0x0AA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFX;                                              // 0x0AAC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AAD[0x3];                                      // 0x0AAD(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	class UNiagaraSystem*                         OpenEffect;                                        // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UStaticMeshComponent*, struct FVector> ComponentLoc;                                  // 0x0AB8(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              NiagaraArray;                                      // 0x0B08(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<int32, EDoorType>                        DoorTypeStateId;                                   // 0x0B18(0x0050)(Edit, BlueprintVisible)
	bool                                          bIsUnidirectional;                                 // 0x0B68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_ConditionalGate_Base(int32 EntryPoint);
	void BndEvt__BP_ConditionalGate_Base_Box_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_ConditionalGate_Base_Box_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void StartWait(class AActor* NewParam);
	void EndWait(class AActor* NewParam);
	void RegisterComponent(TArray<class UStaticMeshComponent*>& CompArray);
	void GetCurrentDoorType(EDoorType* CurrentDoorType);
	void RemoveAllBullets();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ConditionalGate_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ConditionalGate_Base_C")
	}
	static class ABP_ConditionalGate_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ConditionalGate_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_ConditionalGate_Base_C;

}

