#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Common_BulletJump

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Common_BulletJump.BP_Common_BulletJump_C.ExecuteUbergraph_BP_Common_BulletJump
// 0x0068 (0x0068 - 0x0000)
struct BP_Common_BulletJump_C_ExecuteUbergraph_BP_Common_BulletJump final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_ComponentBoundEvent_Character_2;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveBuffFromTarget_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_ComponentBoundEvent_Character_1;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISkillLevelInterface>  CallFunc_AddBuffToTarget_SkillLevelSource_CastInput; // 0x0020(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TArray<class UBuff*>                          CallFunc_AddBuffToTarget_ReturnValue;              // 0x0030(0x0010)(ReferenceParm)
	class ACharacterBase*                         K2Node_ComponentBoundEvent_Character;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         CallFunc_CastToCharacterBase_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveBuffFromTarget_ReturnValue_1;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         CallFunc_CastToCharacterBase_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveBuffFromTarget_ReturnValue_2;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Common_BulletJump_C_ExecuteUbergraph_BP_Common_BulletJump;

// Function BP_Common_BulletJump.BP_Common_BulletJump_C.BndEvt__BP_Common_BulletJump_BattleEvent_K2Node_ComponentBoundEvent_2_DefaultEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Common_BulletJump_C_BndEvt__BP_Common_BulletJump_BattleEvent_K2Node_ComponentBoundEvent_2_DefaultEvent__DelegateSignature final
{
public:
	class ACharacterBase*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Common_BulletJump_C_BndEvt__BP_Common_BulletJump_BattleEvent_K2Node_ComponentBoundEvent_2_DefaultEvent__DelegateSignature;

// Function BP_Common_BulletJump.BP_Common_BulletJump_C.BndEvt__BP_Common_BulletJump_BattleEvent_K2Node_ComponentBoundEvent_0_DefaultEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Common_BulletJump_C_BndEvt__BP_Common_BulletJump_BattleEvent_K2Node_ComponentBoundEvent_0_DefaultEvent__DelegateSignature final
{
public:
	class ACharacterBase*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Common_BulletJump_C_BndEvt__BP_Common_BulletJump_BattleEvent_K2Node_ComponentBoundEvent_0_DefaultEvent__DelegateSignature;

// Function BP_Common_BulletJump.BP_Common_BulletJump_C.BndEvt__BP_Common_BulletJump_BattleEvent_K2Node_ComponentBoundEvent_1_DefaultEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Common_BulletJump_C_BndEvt__BP_Common_BulletJump_BattleEvent_K2Node_ComponentBoundEvent_1_DefaultEvent__DelegateSignature final
{
public:
	class ACharacterBase*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Common_BulletJump_C_BndEvt__BP_Common_BulletJump_BattleEvent_K2Node_ComponentBoundEvent_1_DefaultEvent__DelegateSignature;

}

