#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Claymore_10302

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Claymore_10302.BP_Claymore_10302_C.ExecuteUbergraph_BP_Claymore_10302
// 0x0070 (0x0070 - 0x0000)
struct BP_Claymore_10302_C_ExecuteUbergraph_BP_Claymore_10302 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         K2Node_ComponentBoundEvent_Character;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageStruct*                          K2Node_ComponentBoundEvent_Damage;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEffectSourceInterface> K2Node_ComponentBoundEvent_Source;                // 0x0018(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TScriptInterface<class IEffectSourceInterface> K2Node_ComponentBoundEvent_Target;                // 0x0028(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TArray<class FName>                           CallFunc_GetExtraEffectDamageTypes_ReturnValue;    // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DamageFromPassiveOwnerWeapon_Result;      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc______IsSuccess;                           // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ConstParm, ReferenceParm)
	TScriptInterface<class ISkillLevelInterface>  CallFunc_ExecuteSkillEffects_SkillLevelSource_CastInput; // 0x0060(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
DUMPER7_ASSERTS_BP_Claymore_10302_C_ExecuteUbergraph_BP_Claymore_10302;

// Function BP_Claymore_10302.BP_Claymore_10302_C.BndEvt__BP_Polearm_10203_BattleEvent_K2Node_ComponentBoundEvent_2_EMDamageEvent__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct BP_Claymore_10302_C_BndEvt__BP_Polearm_10203_BattleEvent_K2Node_ComponentBoundEvent_2_EMDamageEvent__DelegateSignature final
{
public:
	class ACharacterBase*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageStruct*                          Damage;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEffectSourceInterface> Source;                                           // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper)
	TScriptInterface<class IEffectSourceInterface> Target;                                           // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper)
};
DUMPER7_ASSERTS_BP_Claymore_10302_C_BndEvt__BP_Polearm_10203_BattleEvent_K2Node_ComponentBoundEvent_2_EMDamageEvent__DelegateSignature;

}

