#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_ConditionalGate_Prologue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ConditionalGate_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ConditionalGate_Prologue.BP_ConditionalGate_Prologue_C
// 0x00A0 (0x0C10 - 0x0B70)
class ABP_ConditionalGate_Prologue_C final : public ABP_ConditionalGate_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ConditionalGate_Prologue_C;      // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   FX02;                                              // 0x0B78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FX01;                                              // 0x0B80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh_Door_Top;                                     // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh_Door_Left;                                    // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh_Door_Right;                                   // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Frame;                                             // 0x0BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____1_FX_15895AFD4B309E560D0F33BFA653D268;         // 0x0BA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____1_alpha_15895AFD4B309E560D0F33BFA653D268;      // 0x0BAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____1__Direction_15895AFD4B309E560D0F33BFA653D268; // 0x0BB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB1[0x7];                                      // 0x0BB1(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class UTimelineComponent*                     时间轴_1;                                          // 0x0BB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____0_FX_DEF62F5F41A687FC7BED36AFD05D89B7;         // 0x0BC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_DEF62F5F41A687FC7BED36AFD05D89B7; // 0x0BC4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC5[0x3];                                      // 0x0BC5(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	class UTimelineComponent*                     时间轴_0;                                          // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLock;                                            // 0x0BD0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD1[0x3];                                      // 0x0BD1(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	int32                                         CurrentTriggerPlayerNum_0;                         // 0x0BD4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayerRetentionTime;                               // 0x0BD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStartTime;                                       // 0x0BDC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BDD[0x3];                                      // 0x0BDD(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	int32                                         DoorId;                                            // 0x0BE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GameId;                                            // 0x0BE4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 DisplayName;                                       // 0x0BE8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CreateGame;                                        // 0x0BF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BF9[0x7];                                      // 0x0BF9(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class UMaterialInstanceDynamic*               DMMI_Plane;                                        // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMMI_Door;                                         // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ConditionalGate_Prologue(int32 EntryPoint);
	void CloseDoor();
	void OpenDoor();
	void ReceiveBeginPlay();
	void OnDoorCloseFX();
	void OnDoorOpenFX();
	void 时间轴_1__UpdateFunc();
	void 时间轴_1__FinishedFunc();
	void 时间轴_0__UpdateFunc();
	void 时间轴_0__FinishedFunc();
	void OnRep_IsLock();
	void OnRep_CurrentDoorType();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ConditionalGate_Prologue_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ConditionalGate_Prologue_C")
	}
	static class ABP_ConditionalGate_Prologue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ConditionalGate_Prologue_C>();
	}
};
DUMPER7_ASSERTS_ABP_ConditionalGate_Prologue_C;

}

