#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_CombatClientEffectComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CombatEffectType_structs.hpp"
#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CombatClientEffectComponent.BP_CombatClientEffectComponent_C
// 0x0090 (0x0140 - 0x00B0)
class UBP_CombatClientEffectComponent_C final : public UCombatClientEffectComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         ColorType;                                         // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECombatEffectType                             EffectType;                                        // 0x00BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFX;                                              // 0x00BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FLinearColor                           MechanismColor;                                    // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           StaticMeshArray;                                   // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsChangeColor;                                     // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<class UMaterialInstanceDynamic*>       StaticMeshDMIArray;                                // 0x00E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         FXState;                                           // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<class UMaterialInstanceDynamic*>       FXDMIArray;                                        // 0x0100(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMeshComponent*>           FXMeshArray;                                       // 0x0110(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class USkeletalMeshComponent*>         SKMeshArray;                                       // 0x0120(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UMaterialInstanceDynamic*>       SKMeshDMIArray;                                    // 0x0130(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_CombatClientEffectComponent(int32 EntryPoint);
	void SweepLight(float IsOpen);
	void OnInteractiveEffect();
	void AfterInteractiveEffect();
	void ChangeColor(int32 ColorType_0);
	void ChangeState();
	void OnDeactiveEffect();
	void OnActiveEffect();
	void OnDeadEffect();
	void OnHitedEffect();
	void ReceiveBeginPlay();
	void CDMI();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CombatClientEffectComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CombatClientEffectComponent_C")
	}
	static class UBP_CombatClientEffectComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CombatClientEffectComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_CombatClientEffectComponent_C;

}

