#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeliveryAnchorMechanism

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DeliveryAnchorMechanism.BP_DeliveryAnchorMechanism_C.ExecuteUbergraph_BP_DeliveryAnchorMechanism
// 0x0028 (0x0028 - 0x0000)
struct BP_DeliveryAnchorMechanism_C_ExecuteUbergraph_BP_DeliveryAnchorMechanism final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AudioManager_C*                     CallFunc_GetClientAudioManager_AudioManager;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AudioManager_C*                     CallFunc_GetClientAudioManager_AudioManager_1;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_DeliveryAnchorMechanism_C_ExecuteUbergraph_BP_DeliveryAnchorMechanism;

// Function BP_DeliveryAnchorMechanism.BP_DeliveryAnchorMechanism_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_DeliveryAnchorMechanism_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_DeliveryAnchorMechanism_C_GetModuleName;

}

