#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DecalActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DecalActor.BP_DecalActor_C
// 0x0028 (0x0330 - 0x0308)
class ABP_DecalActor_C final : public AEMDecalActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         DissolveTime_Dis_57CD45154B0EDEE012B28987C25B246F; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DissolveTime__Direction_57CD45154B0EDEE012B28987C25B246F; // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DissolveTime;                                      // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Destroy;                                           // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MatParam;                                          // 0x0324(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DecalActor(int32 EntryPoint);
	void Appear(class FName Param, float DisTime);
	void Dissolve(class FName Param, float DisTime);
	void DelayDestroySelf(float DelayTime);
	void ReceiveBeginPlay();
	void DissolveTime__UpdateFunc();
	void DissolveTime__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DecalActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DecalActor_C")
	}
	static class ABP_DecalActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DecalActor_C>();
	}
};
DUMPER7_ASSERTS_ABP_DecalActor_C;

}

