#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EMGameMode_Tavern

#include "Basic.hpp"

#include "EM_structs.hpp"


namespace SDK::Params
{

// Function BP_EMGameMode_Tavern.BP_EMGameMode_Tavern_C.ExecuteUbergraph_BP_EMGameMode_Tavern
// 0x0040 (0x0040 - 0x0000)
struct BP_EMGameMode_Tavern_C_ExecuteUbergraph_BP_EMGameMode_Tavern final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_EventName;                            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EGameModeEventChannel                         K2Node_Event_Channel;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_EMGameMode_Tavern_C_ExecuteUbergraph_BP_EMGameMode_Tavern;

// Function BP_EMGameMode_Tavern.BP_EMGameMode_Tavern_C.OnCustomEvent
// 0x0018 (0x0018 - 0x0000)
struct BP_EMGameMode_Tavern_C_OnCustomEvent final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	EGameModeEventChannel                         Channel;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EMGameMode_Tavern_C_OnCustomEvent;

}

