#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EffectCreature

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EffectCreature.BP_EffectCreature_C
// 0x0088 (0x0348 - 0x02C0)
class ABP_EffectCreature_C : public AEffectCreature
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         __________B812D1EA4933FEC965B66B812D059D20;        // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ______Direction_B812D1EA4933FEC965B66B812D059D20;  // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     溶解出现;                                          // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UAnimMontage*, class FString>      EffectCreatureAnims;                               // 0x02E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>       EffectDMMI;                                        // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_EffectCreature(int32 EntryPoint);
	void SetAttachFx(class UNiagaraSystem* Niagara, float LifeSpan);
	void RemoveSelf();
	void WPCreatureAppear();
	void 溶解出现__UpdateFunc();
	void 溶解出现__FinishedFunc();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_EffectCreature_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_EffectCreature_C")
	}
	static class ABP_EffectCreature_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EffectCreature_C>();
	}
};
DUMPER7_ASSERTS_ABP_EffectCreature_C;

}

