#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_EMGameMode_Balcony_01

#include "Basic.hpp"

#include "EM_structs.hpp"


namespace SDK::Params
{

// Function BP_EMGameMode_Balcony_01.BP_EMGameMode_Balcony_01_C.ExecuteUbergraph_BP_EMGameMode_Balcony_01
// 0x00C8 (0x00C8 - 0x0000)
struct BP_EMGameMode_Balcony_01_C_ExecuteUbergraph_BP_EMGameMode_Balcony_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 K2Node_Event_TimerHandleName;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_1;                          // 0x0030(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_2;                          // 0x0040(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_3;                          // 0x0050(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_4;                          // 0x0060(0x0010)(ConstParm, ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_5;                          // 0x0070(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_Event_EventName;                            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EGameModeEventChannel                         K2Node_Event_Channel;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess_1;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<int32>                                 K2Node_MakeArray_Array_6;                          // 0x0098(0x0010)(ConstParm, ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_7;                          // 0x00A8(0x0010)(ConstParm, ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_8;                          // 0x00B8(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_BP_EMGameMode_Balcony_01_C_ExecuteUbergraph_BP_EMGameMode_Balcony_01;

// Function BP_EMGameMode_Balcony_01.BP_EMGameMode_Balcony_01_C.OnCustomEvent
// 0x0018 (0x0018 - 0x0000)
struct BP_EMGameMode_Balcony_01_C_OnCustomEvent final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	EGameModeEventChannel                         Channel;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EMGameMode_Balcony_01_C_OnCustomEvent;

// Function BP_EMGameMode_Balcony_01.BP_EMGameMode_Balcony_01_C.BpOnTimerEnd
// 0x0010 (0x0010 - 0x0000)
struct BP_EMGameMode_Balcony_01_C_BpOnTimerEnd final
{
public:
	class FString                                 TimerHandleName;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EMGameMode_Balcony_01_C_BpOnTimerEnd;

}

