#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_EMWidgetComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EMWidgetComponent.BP_EMWidgetComponent_C.ExecuteUbergraph_BP_EMWidgetComponent
// 0x000C (0x000C - 0x0000)
struct BP_EMWidgetComponent_C_ExecuteUbergraph_BP_EMWidgetComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EMWidgetComponent_C_ExecuteUbergraph_BP_EMWidgetComponent;

// Function BP_EMWidgetComponent.BP_EMWidgetComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_EMWidgetComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EMWidgetComponent_C_ReceiveEndPlay;

// Function BP_EMWidgetComponent.BP_EMWidgetComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EMWidgetComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EMWidgetComponent_C_ReceiveTick;

// Function BP_EMWidgetComponent.BP_EMWidgetComponent_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_EMWidgetComponent_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_EMWidgetComponent_C_GetModuleName;

}

