#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EMGameMode_Chapter01_Icelake

#include "Basic.hpp"

#include "BP_EMGameMode_Region_classes.hpp"
#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"
#include "EM_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EMGameMode_Chapter01_Icelake.BP_EMGameMode_Chapter01_Icelake_C
// 0x01C0 (0x1040 - 0x0E80)
class ABP_EMGameMode_Chapter01_Icelake_C final : public ABP_EMGameMode_Region_C
{
public:
	uint8                                         Pad_E74[0x4];                                      // 0x0E74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHookGameModeComponent*                 HookGameMode;                                      // 0x0E80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAfterQuestFinishEventComponent*        After10020804QuestFinish;                          // 0x0E88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAfterQuestFinishEventComponent*        After10020103QuestFinish;                          // 0x0E90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAfterQuestFinishEventComponent*        After10020106QuestFinish;                          // 0x0E98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAfterQuestFinishEventComponent*        After20010305QuestFinish;                          // 0x0EA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_RegionDefenceProComponent_C*        BP_RegionDefenceProComponent;                      // 0x0EA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_RegionDefenceComponent_C*           BP_RegionDefenceComponent;                         // 0x0EB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Test;                                              // 0x0EB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnSearchSaiqiWind;                                 // 0x0EBC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EBD[0x3];                                      // 0x0EBD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MonsterCount_SaiqiDig;                             // 0x0EC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SaiqiDigStartCount_;                               // 0x0EC4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EC5[0x3];                                      // 0x0EC5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 SaiqiDigMonsterspawn;                              // 0x0EC8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 SaiqiDigAirDoor;                                   // 0x0ED8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 Saiqi_Boss_Storms;                                 // 0x0EE8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          OnChuiZhujueWind;                                  // 0x0EF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EF9[0x3];                                      // 0x0EF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IcelakeElevator;                                   // 0x0EFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerCharacter*>               NewVar_0;                                          // 0x0F00(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class APlayerCharacter*                       NewVar_1;                                          // 0x0F10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LS_Trafficway_Wind;                                // 0x0F18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneSequencePlaybackParams      Playback_Params_10S;                               // 0x0F20(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FMovieSceneSequencePlaybackParams      Playback_Params_15S;                               // 0x0F48(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FMovieSceneSequencePlaybackParams      Playback_Params;                                   // 0x0F70(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ACombatItemBase*                        DefencePet;                                        // 0x0F98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Hunt1TrapArray;                                    // 0x0FA0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 Hunt3TrapArray;                                    // 0x0FB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IfHuntStart;                                       // 0x0FC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FC1[0x7];                                      // 0x0FC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Hunt3MonsterSpawnId;                               // 0x0FC8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Hunt3SpecialQuest;                                 // 0x0FD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TuosikaSpecial_Quest_Id;                           // 0x0FDC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IfHuntContinue;                                    // 0x0FE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FE1[0x7];                                      // 0x0FE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 TuoSiKa_AirWall;                                   // 0x0FE8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FMovieSceneSequencePlaybackParams      StandParam;                                        // 0x0FF8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          TruckOnCourt;                                      // 0x1020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1021[0x7];                                     // 0x1021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ESkillName>                            Interactive;                                       // 0x1028(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PetQuest_Stage_Show;                               // 0x1038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPetCatched_;                                     // 0x103C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsPetQuestFinished_;                               // 0x103D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_EMGameMode_Chapter01_Icelake(int32 EntryPoint);
	void Timer_End_FeinaFightBaodi_Timer();
	void OnRestRuleSpawnMonstersDead(const class FString& RuleId);
	void FeinaFightFail();
	void FeinaFightEnd();
	void FeinaFightStart();
	void BndEvt__BP_EMGameMode_Chapter01_Icelake_After10020106QuestFinish_K2Node_ComponentBoundEvent_3_AfterQuestFinishEvent__DelegateSignature();
	void BndEvt__BP_EMGameMode_Chapter01_Icelake_After10020804QuestFinish_K2Node_ComponentBoundEvent_1_AfterQuestFinishEvent__DelegateSignature();
	void BndEvt__BP_EMGameMode_Chapter01_Icelake_After20010305QuestFinish_K2Node_ComponentBoundEvent_0_AfterQuestFinishEvent__DelegateSignature();
	void TimerEndChapter01_Trafficway_Hunt3_Fail();
	void DestroyLS_Icelake_Storm3();
	void PlayLS_Icelake_Storm3();
	void SaiqiWalkCleanUp();
	void SaiqiWalk();
	void OnCustomEvent(const class FString& EventName, EGameModeEventChannel Channel);
	void BossBattle();
	void TrafficWay_TuoSiKaBattle();
	void TruckAccident3();
	void TruckAccident2();
	void TruckAccident1();
	void TimerEndChapter01_Trafficway_Hunt3();
	void TimerEndChapter01_Trafficway_Hunt3_02();
	void TimerEndChapter01_Trafficway_Hunt3_01();
	void OnDeadStaticUnit(class AMonsterCharacter* MonsterC);
	void OnDefenceCoreDead(class ACombatPropBase* DefenceCore);
	void OnStaticCreatorEvent(const class FString& EventName, int32 Eid, int32 UnitId, const class FString& UnitType);
	void StopHunt3();
	void DelAllTimer_Hunt3();
	void OnDefenceCoreActive(class ACombatPropBase* DefenceCore);
	void Chapter01_Trafficway_Hunting_Init();
	void DestroyHunt3Monster();
	void OutHunt2();
	void OutHunt1();
	void OutHunt4();
	void OutHunt3();
	void OnMechanismStateChange(class ACombatItemBase* Mechanism, int32 StateId, int32 LeaveStateId);
	void BpOnTimerEnd(const class FString& TimerHandleName);
	void Hunt1Finish();
	void StartSearchSaiqi();
	void Hunt1ActiveTrap();
	void FinishSearchSaiqi();
	void CreateAirwall_Normal();
	void UnlockPet2();
	void LockPet2();
	void DestroyAirwall_Normal();
	void UnlockPet();
	void BossBattleFail();
	void LockPet();
	void OnDynQuestFail(const int32 DynQuestId);
	void FinishSearchSaiqi0();
	void StartSearchSaiqi0();
	void ActiveStorm();
	void LeaveStormCam();
	void EnterStormCam();
	void InactiveStorm();
	void SetElevatorMoveDown();
	void SetElevatorMoveUp();
	void ElevatorStopUp(class AElevatorMechanism* ElevatorMechanism);
	void ElevatorStopDown(class AElevatorMechanism* ElevatorMechanism);
	void ElevatorStartUp(class AElevatorMechanism* ElevatorMechanism);
	void ElevatorStartDown(class AElevatorMechanism* ElevatorMechanism);
	void OnInit();
	void OnBigWorldActive();
	void FinishNvzhuWind();
	void StartNvzhuWind();
	void OnGuideEnd_58302AAF4F7533E8D3164397AEB5C8EE();
	void OnGuideEnd_B310E018423DF589493D548D4BAACFA7();
	void NewFunction_0();
	void NewFunction_1();
	void HideGuideAndButton();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_EMGameMode_Chapter01_Icelake_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_EMGameMode_Chapter01_Icelake_C")
	}
	static class ABP_EMGameMode_Chapter01_Icelake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EMGameMode_Chapter01_Icelake_C>();
	}
};
DUMPER7_ASSERTS_ABP_EMGameMode_Chapter01_Icelake_C;

}

