#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_EMGameMode

#include "Basic.hpp"

#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EMGameMode.BP_EMGameMode_C
// 0x0030 (0x0E80 - 0x0E50)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_EMGameMode_C : public AEMGameMode
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0E50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Rate;                                              // 0x0E58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5C[0x4];                                      // 0x0E5C(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<int32>                                 ID;                                                // 0x0E60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         DeadStaticUnitNum;                                 // 0x0E70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void On_Dead_Static_Unit_Count(bool IsCountOn, int32 TargetNum, bool DebugPrint, bool* IsNumEnough, int32* DeadNum);
	void ForId(int32 Start, int32 End, TArray<int32>* Return);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_EMGameMode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_EMGameMode_C")
	}
	static class ABP_EMGameMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EMGameMode_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_EMGameMode_C;

}

