#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EMGameMode_IcelakeCity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_structs.hpp"
#include "BP_EMGameMode_Region_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EMGameMode_IcelakeCity.BP_EMGameMode_IcelakeCity_C
// 0x00D0 (0x0F50 - 0x0E80)
class ABP_EMGameMode_IcelakeCity_C final : public ABP_EMGameMode_Region_C
{
public:
	uint8                                         Pad_E74[0x4];                                      // 0x0E74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAfterQuestFinishEventComponent*        After10030101QuestFinish;                          // 0x0E80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHookGameModeComponent*                 HookGameMode;                                      // 0x0E88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAfterQuestFinishEventComponent*        After20010305QuestFinish;                          // 0x0E90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____1_FX_AA69FC3B4E3CEE6E86389B87849FE2A1;         // 0x0E98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____1__Direction_AA69FC3B4E3CEE6E86389B87849FE2A1; // 0x0E9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9D[0x3];                                      // 0x0E9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_1;                                          // 0x0EA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DungeonSQ;                                         // 0x0EA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TalkEnd;                                           // 0x0EAC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Test;                                              // 0x0EAD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EAE[0x2];                                      // 0x0EAE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ESkillName>                            In_Active_Skill_Names;                             // 0x0EB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<ESkillName>                            Active_Skill_Names;                                // 0x0EC0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Quest100202;                                       // 0x0ED0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED1[0x7];                                      // 0x0ED1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 IceLakeCItyAirWalls;                               // 0x0ED8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CP2Start_SPid;                                     // 0x0EE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         XiaoJinSQID;                                       // 0x0EEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 XiaoJin;                                           // 0x0EF0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 East00St;                                          // 0x0F00(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 AirWall;                                           // 0x0F10(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ALevelSequenceActor*                    Feina01ByteDance;                                  // 0x0F20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 EnlikeDroneId1;                                    // 0x0F28(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 EnlikeDroneId2;                                    // 0x0F38(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_EMGameMode_IcelakeCity(int32 EntryPoint);
	void BndEvt__BP_EMGameMode_Chapter01_Sew01_After10030101QuestFinish_K2Node_ComponentBoundEvent_4_AfterQuestFinishEvent__DelegateSignature();
	void OnCustomEvent(const class FString& EventName, EGameModeEventChannel Channel);
	void TraceEnliEnd();
	void TraceEnliStart();
	void EnlikeDroneReset2();
	void EnlikeDroneReset1();
	void San_DoorOpen();
	void BndEvt__BP_EMGameMode_IcelakeCity_After20010305QuestFinish_K2Node_ComponentBoundEvent_0_AfterQuestFinishEvent__DelegateSignature();
	void OnCombatPropDead(class ACombatPropBase* CombatProp);
	void Feina01Catch03End();
	void Feina01Catch03Start();
	void Feina01Catch02End();
	void Feina01Catch02Start();
	void Feina01Catch01End();
	void Feina01Catch01Start();
	void Feina01ByteDance01End();
	void Feina01ByteDance01Start();
	void OnMechanismStateChange(class ACombatItemBase* Mechanism, int32 StateId, int32 LeaveStateId);
	void Two0022008ShootStart();
	void Two0022006ParkourStart();
	void LikeAFish1();
	void LikeAFish();
	void CP2Start_AirWall();
	void FeitingLightOff();
	void FeitingLightOn();
	void OnBigWorldActive();
	void OnPlayTalkEnd_C619FC884F140C1A823F7E924535E645();
	void OnPlayTalkInterrupted_C619FC884F140C1A823F7E924535E645();
	void 时间轴_1__UpdateFunc();
	void 时间轴_1__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_EMGameMode_IcelakeCity_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_EMGameMode_IcelakeCity_C")
	}
	static class ABP_EMGameMode_IcelakeCity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EMGameMode_IcelakeCity_C>();
	}
};
DUMPER7_ASSERTS_ABP_EMGameMode_IcelakeCity_C;

}

