#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_ElevatorMechanismBody_In

#include "Basic.hpp"

#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ElevatorMechanismBody_In.BP_ElevatorMechanismBody_In_C
// 0x0038 (0x02F0 - 0x02B8)
class ABP_ElevatorMechanismBody_In_C final : public AElevatorMechanismBody
{
public:
	class UNiagaraComponent*                      FXStartInteractive;                                // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Common_Dianti04;                                // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FXError;                                           // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FXLock;                                            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FXRunning;                                         // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ElevatorMechanismBody_In_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ElevatorMechanismBody_In_C")
	}
	static class ABP_ElevatorMechanismBody_In_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ElevatorMechanismBody_In_C>();
	}
};
DUMPER7_ASSERTS_ABP_ElevatorMechanismBody_In_C;

}

