#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EffectCreature_BattlePet_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_EffectCreature_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EffectCreature_BattlePet_New.BP_EffectCreature_BattlePet_New_C
// 0x00D8 (0x0420 - 0x0348)
class ABP_EffectCreature_BattlePet_New_C final : public ABP_EffectCreature_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_EffectCreature_BattlePet_New_C;  // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                RelativeLocation;                                  // 0x0350(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BaseLocation;                                      // 0x035C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationDelta;                                     // 0x0368(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewLocation;                                       // 0x0374(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxXDelay;                                         // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxYDelay;                                         // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxYVelocity;                                      // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxZDelay;                                         // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             LastCharacterTransform;                            // 0x0390(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             CharacterTransform;                                // 0x03C0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          TickFlag;                                          // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerCharacter_C*                  OwnerPlayer;                                       // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ArmoryPetOffset;                                   // 0x0400(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MixPetOffset;                                      // 0x040C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_EffectCreature_BattlePet_New(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnBattlePetUseSupportSkill();
	void ReceiveBeginPlay();
	void OnResourceReady();
	void OnBattlePetHideInGame(bool IsHide);
	void ModifyXDelay();
	void ModifyYDelay();
	void ModifyZDelay();
	void AvoidScene();
	void AvoidCamera();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_EffectCreature_BattlePet_New_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_EffectCreature_BattlePet_New_C")
	}
	static class ABP_EffectCreature_BattlePet_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EffectCreature_BattlePet_New_C>();
	}
};
DUMPER7_ASSERTS_ABP_EffectCreature_BattlePet_New_C;

}

