#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_EMGameMode_Village_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_structs.hpp"
#include "BP_EMGameMode_Region_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EMGameMode_Village_01.BP_EMGameMode_Village_01_C
// 0x0050 (0x0ED0 - 0x0E80)
class ABP_EMGameMode_Village_01_C final : public ABP_EMGameMode_Region_C
{
public:
	uint8                                         Pad_E74[0x4];                                      // 0x0E74(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAfterQuestFinishEventComponent*        After20010305QuestFinish;                          // 0x0E80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAfterQuestFinishEventComponent*        After10010306QuestFinish;                          // 0x0E88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHookGameModeComponent*                 HookGameMode;                                      // 0x0E90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         DungeonSQ;                                         // 0x0E98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TalkEnd;                                           // 0x0E9C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Test;                                              // 0x0E9D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9E[0x2];                                      // 0x0E9E(0x0002)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<ESkillName>                            In_Active_Skill_Names;                             // 0x0EA0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<ESkillName>                            Active_Skill_Names;                                // 0x0EB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Quest100201;                                       // 0x0EC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BulletJumpSucc;                                    // 0x0EC1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_EMGameMode_Village_01(int32 EntryPoint);
	void BndEvt__BP_EMGameMode_Village_01_After20010305QuestFinish_K2Node_ComponentBoundEvent_1_AfterQuestFinishEvent__DelegateSignature();
	void BndEvt__BP_EMGameMode_Village_01_After10010306QuestFinish_K2Node_ComponentBoundEvent_0_AfterQuestFinishEvent__DelegateSignature();
	void OnInit();
	void OnCustomEvent(const class FString& EventName, EGameModeEventChannel Channel);
	void OnCombatPropDead(class ACombatPropBase* CombatProp);
	void OnMechanismStateChange(class ACombatItemBase* Mechanism, int32 StateId, int32 LeaveStateId);
	void OnBigWorldActive();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_EMGameMode_Village_01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_EMGameMode_Village_01_C")
	}
	static class ABP_EMGameMode_Village_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EMGameMode_Village_01_C>();
	}
};
DUMPER7_ASSERTS_ABP_EMGameMode_Village_01_C;

}

