#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EMGameMode_Sanatorium

#include "Basic.hpp"

#include "BP_EMGameMode_Region_classes.hpp"
#include "Engine_structs.hpp"
#include "EM_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EMGameMode_Sanatorium.BP_EMGameMode_Sanatorium_C
// 0x0030 (0x0EB0 - 0x0E80)
class ABP_EMGameMode_Sanatorium_C final : public ABP_EMGameMode_Region_C
{
public:
	uint8                                         Pad_E74[0x4];                                      // 0x0E74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         DungeonSQ;                                         // 0x0E80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TalkEnd;                                           // 0x0E84(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Test;                                              // 0x0E85(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E86[0x2];                                      // 0x0E86(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ESkillName>                            In_Active_Skill_Names;                             // 0x0E88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<ESkillName>                            Active_Skill_Names;                                // 0x0E98(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Quest100202;                                       // 0x0EA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEnlikeDead;                                      // 0x0EA9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEnlikeReallyDead;                                // 0x0EAA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EAB[0x1];                                      // 0x0EAB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IsDoorOpen;                                        // 0x0EAC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_EMGameMode_Sanatorium(int32 EntryPoint);
	void DoorOpen();
	void DeadEnlike();
	void EnlikeDeathReady();
	void EnlikeDeath();
	void BookDrop();
	void OnBigWorldActive();
	void OnCustomEvent(const class FString& EventName, EGameModeEventChannel Channel);
	void OnDead(class AMonsterCharacter* MonsterC);
	void OnQuestStart(const int32 QuestChainId, const int32 QuestId);
	void OnQuestComplete(const int32 QuestChainId, const int32 QuestId);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_EMGameMode_Sanatorium_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_EMGameMode_Sanatorium_C")
	}
	static class ABP_EMGameMode_Sanatorium_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EMGameMode_Sanatorium_C>();
	}
};
DUMPER7_ASSERTS_ABP_EMGameMode_Sanatorium_C;

}

