#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_EMGameMode_Clouds_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_structs.hpp"
#include "BP_EMGameMode_Region_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EMGameMode_Clouds_01.BP_EMGameMode_Clouds_01_C
// 0x00F0 (0x0F70 - 0x0E80)
class ABP_EMGameMode_Clouds_01_C final : public ABP_EMGameMode_Region_C
{
public:
	uint8                                         Pad_E74[0x4];                                      // 0x0E74(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAfterQuestFinishEventComponent*        After20010305QuestFinish;                          // 0x0E80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAfterQuestFinishEventComponent*        After10010306QuestFinish;                          // 0x0E88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         WaveSQ;                                            // 0x0E90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BOSS_Battle;                                       // 0x0E94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FgChase;                                           // 0x0E98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Boss_1_Finish;                                     // 0x0E9C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9D[0x3];                                      // 0x0E9D(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<ESkillName>                            In_Active_Skill_Names;                             // 0x0EA0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          LoadEnd;                                           // 0x0EB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB1[0x7];                                      // 0x0EB1(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	TMap<class FString, float>                    Key_Value;                                         // 0x0EB8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, float>                    Key_Value_0;                                       // 0x0F08(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ChangeAirWallCollision;                            // 0x0F58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F59[0x7];                                      // 0x0F59(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<ESkillName>                            Interactive;                                       // 0x0F60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_EMGameMode_Clouds_01(int32 EntryPoint);
	void BndEvt__BP_EMGameMode_Clouds_01_After10010306QuestFinish_K2Node_ComponentBoundEvent_1_AfterQuestFinishEvent__DelegateSignature();
	void BndEvt__BP_EMGameMode_Clouds_01_After20010305QuestFinish_K2Node_ComponentBoundEvent_0_AfterQuestFinishEvent__DelegateSignature();
	void CreatePet();
	void OnDeadStaticUnit(class AMonsterCharacter* MonsterC);
	void UnlockPet();
	void LockPet();
	void OnDynQuestFail(const int32 DynQuestId);
	void OnBigWorldActive();
	void YunhaiRunCreateMonsterSpawn();
	void CloudsBattle2End();
	void YunhaiRunDestroyMonsterSpawn();
	void OnCustomEvent(const class FString& EventName, EGameModeEventChannel Channel);
	void Skill02On();
	void PaojiEnd();
	void PaojiStart();
	void Win();
	void BossBattleP2();
	void BossBattleP1();
	void BossXibiP1toP2();
	void OnStaticCreatorEvent(const class FString& EventName, int32 Eid, int32 UnitId, const class FString& UnitType);
	void OnTriggerPlayerHpChanged(class ACharacterBase* Char, float HpPercent);
	void OnBossBattle();
	void OnTriggerFirstCondemn();
	void OnPauseBattleEntities(const class FString& Reason);
	void CloudsBattle2Start();
	void OnGuideEnd_8FA9043344E8863A9ED047A8D1B298E7();
	void OnGuideEnd_41469823451D83BEDA28D5BF973515FB();
	void OnUnDefeated_2C778A5D4316C233279D77AA2F413C6F();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_EMGameMode_Clouds_01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_EMGameMode_Clouds_01_C")
	}
	static class ABP_EMGameMode_Clouds_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EMGameMode_Clouds_01_C>();
	}
};
DUMPER7_ASSERTS_ABP_EMGameMode_Clouds_01_C;

}

