#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_FishingSpot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_MechanismBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FishingSpot.BP_FishingSpot_C
// 0x0050 (0x0A60 - 0x0A10)
class ABP_FishingSpot_C final : public ABP_MechanismBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   EffectPoint;                                       // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera_Fishing;                                    // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CameraPosition;                                    // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FishPoint;                                         // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PlayerPoint;                                       // 0x0A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int64                                         FishingSpotId;                                     // 0x0A58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnFishHook(int32 FishId, bool CanSpecial);
	void OnFishing();
	void OnFishFail();
	void OnFishSuccess();
	void OnInteracted(int32 MechanismCreatorId, int32 MechanismEid);
	void ReceiveBeginPlay();
	void OnGetFishEnd();
	void OnLeaveState(int32 NowStateId, int32 NextStateId);
	void ExecuteUbergraph_BP_FishingSpot(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FishingSpot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FishingSpot_C")
	}
	static class ABP_FishingSpot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FishingSpot_C>();
	}
};
DUMPER7_ASSERTS_ABP_FishingSpot_C;

}

