#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GridFrame

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GridFrame.BP_GridFrame_C.ExecuteUbergraph_BP_GridFrame
// 0x0018 (0x0018 - 0x0000)
struct BP_GridFrame_C_ExecuteUbergraph_BP_GridFrame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEMLevelLoader*                         CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_GridFrame_C_ExecuteUbergraph_BP_GridFrame;

// Function BP_GridFrame.BP_GridFrame_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_GridFrame_C_UserConstructionScript final
{
public:
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_BP_GridFrame_C_UserConstructionScript;

}

