#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HarvestBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_HarvestBase.BP_HarvestBase_C.ExecuteUbergraph_BP_HarvestBase
// 0x0040 (0x0040 - 0x0000)
struct BP_HarvestBase_C_ExecuteUbergraph_BP_HarvestBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_SetSceneComponentHiddenInGame_HiddenComponents; // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FString                                 CallFunc_SpawnFXAttached_Level_ReturnValue;        // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SetFXFloatParam_Level_ReturnValue;        // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NowStateId;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_HarvestBase_C_ExecuteUbergraph_BP_HarvestBase;

// Function BP_HarvestBase.BP_HarvestBase_C.OnEnterState
// 0x0004 (0x0004 - 0x0000)
struct BP_HarvestBase_C_OnEnterState final
{
public:
	int32                                         NowStateId;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_HarvestBase_C_OnEnterState;

// Function BP_HarvestBase.BP_HarvestBase_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_HarvestBase_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_HarvestBase_C_GetModuleName;

}

