#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_Heitao

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PassiveEffectBase_classes.hpp"
#include "EM_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Heitao.BP_Heitao_C
// 0x0040 (0x0148 - 0x0108)
class UBP_Heitao_C final : public UBP_PassiveEffectBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SpIncrease;                                        // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpIncreaseProb;                                    // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Skill01NodeList;                                   // 0x0118(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 Skill02NodesList;                                  // 0x0128(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Grade1LastTime;                                    // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Grade2BuffRate;                                    // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Grade6Rate;                                        // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Heitao(int32 EntryPoint);
	void BndEvt__BP_Zhiliu_ExtraFriend_BattleEvent_K2Node_ComponentBoundEvent_1_EMDamageEvent__DelegateSignature(class ACharacterBase* Character, class UDamageStruct* Damage, const TScriptInterface<class IEffectSourceInterface>& Source, const TScriptInterface<class IEffectSourceInterface>& Target);
	void ReceiveBeginPlay();
	void BndEvt__BP_Heitao_BattleEvent_K2Node_ComponentBoundEvent_6_SpChanged__DelegateSignature(class ACharacterBase* Character, const int32& Before, const int32& After, EChangedSpReason Reason);
	void BndEvt__BP_Heitao_BattleEvent_K2Node_ComponentBoundEvent_0_DefaultEvent__DelegateSignature(class ACharacterBase* Character);
	void BndEvt__BP_Heitao_BattleEvent_K2Node_ComponentBoundEvent_5_InitDamage__DelegateSignature(class ACharacterBase* Character, class UDamageStruct* Damage, const TScriptInterface<class IEffectSourceInterface>& Source, const TScriptInterface<class IEffectSourceInterface>& Target);
	void BndEvt__BP_Melee_2009_BattleEvent_K2Node_ComponentBoundEvent_1_ComboCountChanged__DelegateSignature(class ACharacterBase* Character, class AWeaponBase* Weapon, const int32& BeforeComboCount, const int32& BeforeComboLevel, const int32& CurrentComboCount, const int32& CurrentComboLevel, EClearComboReason ClearComboReason);
	void BndEvt__BP_Heitao_BattleEvent_K2Node_ComponentBoundEvent_3_EnterNode__DelegateSignature(class ACharacterBase* Character, const int32& NodeId, class USkillNode* SkillNode);
	void BndEvt__BP_Heitao_Skill01_BattleEvent_K2Node_ComponentBoundEvent_1_LeaveNode__DelegateSignature(class ACharacterBase* Character, const int32& NodeId, class USkillNode* SkillNode);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Heitao_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Heitao_C")
	}
	static class UBP_Heitao_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Heitao_C>();
	}
};
DUMPER7_ASSERTS_UBP_Heitao_C;

}

