#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractiveElevator_Quarry

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_InteractiveElevator_Quarry.BP_InteractiveElevator_Quarry_C.ExecuteUbergraph_BP_InteractiveElevator_Quarry
// 0x0028 (0x0028 - 0x0000)
struct BP_InteractiveElevator_Quarry_C_ExecuteUbergraph_BP_InteractiveElevator_Quarry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_TargetActor_3;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_TargetActor_2;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_TargetActor_1;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_TargetActor;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractiveElevator_Quarry_C_ExecuteUbergraph_BP_InteractiveElevator_Quarry;

// Function BP_InteractiveElevator_Quarry.BP_InteractiveElevator_Quarry_C.OpenBottomDoor
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractiveElevator_Quarry_C_OpenBottomDoor final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractiveElevator_Quarry_C_OpenBottomDoor;

// Function BP_InteractiveElevator_Quarry.BP_InteractiveElevator_Quarry_C.CloseTopDoor
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractiveElevator_Quarry_C_CloseTopDoor final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractiveElevator_Quarry_C_CloseTopDoor;

// Function BP_InteractiveElevator_Quarry.BP_InteractiveElevator_Quarry_C.OpenTopDoor
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractiveElevator_Quarry_C_OpenTopDoor final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractiveElevator_Quarry_C_OpenTopDoor;

// Function BP_InteractiveElevator_Quarry.BP_InteractiveElevator_Quarry_C.CloseBottomDoor
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractiveElevator_Quarry_C_CloseBottomDoor final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractiveElevator_Quarry_C_CloseBottomDoor;

// Function BP_InteractiveElevator_Quarry.BP_InteractiveElevator_Quarry_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_InteractiveElevator_Quarry_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractiveElevator_Quarry_C_GetModuleName;

}

