#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_JumpPad

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CombatItemBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_JumpPad.BP_JumpPad_C
// 0x00E8 (0x0AC0 - 0x09D8)
class ABP_JumpPad_C final : public ABP_CombatItemBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x09E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x09E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh_JumpPad;                                      // 0x09F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x09F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialVector*                          RadialVector;                                      // 0x0A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         LaunchVelocity;                                    // 0x0A08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LaunchAngle;                                       // 0x0A0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayerInside;                                    // 0x0A10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A11[0x3];                                      // 0x0A11(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LaunchCD;                                          // 0x0A14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCdOver;                                          // 0x0A18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A19[0x7];                                      // 0x0A19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class APlayerCharacter*>                 StayPlayers;                                       // 0x0A20(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class FString>                         CorrectTag;                                        // 0x0A70(0x0010)(Edit, BlueprintVisible)
	bool                                          HiddenOnDeActive;                                  // 0x0A80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A81[0x7];                                      // 0x0A81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          VFX_Burst;                                         // 0x0A88(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UNiagaraSystem*                         VFX_Loop;                                          // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsJumppadLaunch;                                   // 0x0AB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_JumpPad(int32 EntryPoint);
	void BndEvt__BP_Launch_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnDeactiveEffect();
	void OnActiveEffect();
	void OnCdRecover();
	void OnLaunchCharacter(class ACharacter* 目标);
	void BndEvt__BP_JumpPad_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void UserConstructionScript();
	void OnPlayerEnter(class APlayerCharacter* NewParam);
	void OnPlayerLeave(class APlayerCharacter* NewParam);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_JumpPad_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_JumpPad_C")
	}
	static class ABP_JumpPad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_JumpPad_C>();
	}
};
DUMPER7_ASSERTS_ABP_JumpPad_C;

}

