#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_Jt_Tuji_Passive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PassiveEffectBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Jt_Tuji_Passive.BP_Jt_Tuji_Passive_C
// 0x0020 (0x0128 - 0x0108)
class UBP_Jt_Tuji_Passive_C final : public UBP_PassiveEffectBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         DamageRate;                                        // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DecreaseRotate;                                    // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AttackSkillId;                                     // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillEffectId;                                     // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMonsterCharacter*                      Monster_Character;                                 // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Jt_Tuji_Passive(int32 EntryPoint);
	void ReceiveBeginPlay();
	void BndEvt__BP_Jt_Tuji_Passive_BattleEvent_K2Node_ComponentBoundEvent_1_InitDamaged__DelegateSignature(class ACharacterBase* Character, class UDamageStruct* Damage, const TScriptInterface<class IEffectSourceInterface>& Source, const TScriptInterface<class IEffectSourceInterface>& Target);
	void AngleWithPassiveOwner(class AActor* DamageSource, float* AngleWithPassiveOwner_0);
	void RemoveBuff();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Jt_Tuji_Passive_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Jt_Tuji_Passive_C")
	}
	static class UBP_Jt_Tuji_Passive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Jt_Tuji_Passive_C>();
	}
};
DUMPER7_ASSERTS_UBP_Jt_Tuji_Passive_C;

}

