#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelLoader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LevelLoader.BP_LevelLoader_C
// 0x0060 (0x06F8 - 0x0698)
class ABP_LevelLoader_C : public ALevelLoader
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULevelPathfindingComponent*             LevelPathfinding;                                  // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         homeLoadedProgress;                                // 0x06B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         designLoadedProgress;                              // 0x06B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         artLoadedProgress;                                 // 0x06B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoaded;                                          // 0x06BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6BD[0x3];                                      // 0x06BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         loadProgress;                                      // 0x06C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C4[0x4];                                      // 0x06C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIManagerComponent*                    GameUIManager;                                     // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          delayLoading;                                      // 0x06D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          enableStartPoint;                                  // 0x06D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D2[0x2];                                      // 0x06D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ProgressLoc;                                       // 0x06D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ProgressRot;                                       // 0x06E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EC[0x4];                                      // 0x06EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 DoorClass;                                         // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LevelLoader(int32 EntryPoint);
	void LoadStreamLevelWithID(class FName LevelName, int32 ID, bool bMakeVisibleAfterLoad, bool bShouldBlockOnLoad);
	void UnloadStreamLevel(class FName LevelName, int32 ID);
	void LoadStreamLevel(class FName LevelName, int32 ID);
	void OnLevelLoadComplete();
	void ReceiveBeginPlay();
	void OnStreamingLevelLoaded();
	void OnHomeLevelLoadedCallback(class FName LevelName);
	void MultiLevelTrans(class AEnvirSystemActor_C* InActor, const struct FTransform& InTransform, struct FTransform* OutTransform);
	class ULevelPathfindingComponent* GetLevelPathfindingComponent();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_LevelLoader_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_LevelLoader_C")
	}
	static class ABP_LevelLoader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LevelLoader_C>();
	}
};
DUMPER7_ASSERTS_ABP_LevelLoader_C;

}

