#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_LandProxyMesh

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LandProxyMesh.BP_LandProxyMesh_C
// 0x0030 (0x0300 - 0x02D0)
class ABP_LandProxyMesh_C final : public AStaticMeshActorForLayerMask
{
public:
	TArray<class UPhysicalMaterial*>              PhysMats;                                          // 0x02D0(0x0010)(Edit, BlueprintVisible)
	bool                                          UseWorldPosition;                                  // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FVector                                MPosition;                                         // 0x02E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LayerSize;                                         // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LayerScale;                                        // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rotation;                                          // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GenerateLayerMask();
	void Get_Physcal_Material_from_UV(const struct FVector2D& UV, const struct FVector& Position, class UPhysicalMaterial** PhysicalMaterial);
	void GenerateRT();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_LandProxyMesh_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_LandProxyMesh_C")
	}
	static class ABP_LandProxyMesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LandProxyMesh_C>();
	}
};
DUMPER7_ASSERTS_ABP_LandProxyMesh_C;

}

