#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MonsterCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimSelector_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EM_structs.hpp"
#include "EM_classes.hpp"
#include "CollapsedGraph_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MonsterCharacter.BP_MonsterCharacter_C
// 0x0140 (0x2920 - 0x27E0)
class ABP_MonsterCharacter_C final : public AMonsterCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x27E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          FirstSeenBox;                                      // 0x27E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UObject*                                BP_ScreenDebugComponent;                           // 0x27F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMonsterLookAtComponent*                MonsterLookAt;                                     // 0x27F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ExpressionPlane;                                   // 0x2800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      MonsterHitedCapsule;                               // 0x2808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_MonsterFade_Track_Fade_58E03BFB4F652FBC8604898096E4A150; // 0x2810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_MonsterFade__Direction_58E03BFB4F652FBC8604898096E4A150; // 0x2814(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2815[0x3];                                     // 0x2815(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_MonsterFade;                              // 0x2818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmisiveIntensity_EmisiveIntensityParam_7A9E69324D3CBA445713CE8337F85A41; // 0x2820(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EmisiveIntensity__Direction_7A9E69324D3CBA445713CE8337F85A41; // 0x2824(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2825[0x3];                                     // 0x2825(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EmisiveIntensity;                                  // 0x2828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dis_Dis_30766AD9436EE921D7302F8D90F3C368;          // 0x2830(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Dis__Direction_30766AD9436EE921D7302F8D90F3C368;   // 0x2834(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2835[0x3];                                     // 0x2835(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Dis;                                               // 0x2838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BeAttack_Attacked_278FF7BE47A07AD5593467811AF4285F; // 0x2840(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BeAttack__Direction_278FF7BE47A07AD5593467811AF4285F; // 0x2844(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2845[0x3];                                     // 0x2845(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     BeAttack;                                          // 0x2848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MonsterAppear________36FCC31145B2CF449EBA34B8A698358D; // 0x2850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MonsterAppear__Direction_36FCC31145B2CF449EBA34B8A698358D; // 0x2854(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2855[0x3];                                     // 0x2855(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MonsterAppear;                                     // 0x2858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HitBoneName;                                       // 0x2860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitBoneWeight;                                     // 0x2868(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHitBone;                                         // 0x286C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_286D[0x3];                                     // 0x286D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DefaultLocation;                                   // 0x2870(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_287C[0x4];                                     // 0x287C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           LockBoneNames;                                     // 0x2880(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         hitforce;                                          // 0x2890(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FireTimes;                                         // 0x2894(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HitFlyFx;                                          // 0x2898(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2899[0x7];                                     // 0x2899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      击飞特效;                                          // 0x28A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      落地特效;                                          // 0x28A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSelector                                 动画测试行为选择;                                  // 0x28B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28B1[0x7];                                     // 0x28B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 Meshes;                                            // 0x28B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class ABP_Capture_C*                          InteractiveCapture;                                // 0x28C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      EliteNiagara;                                      // 0x28D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<bool>                                  PartIsBroken;                                      // 0x28D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         BrokenPartId;                                      // 0x28E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BeAttackFlickerCD;                                 // 0x28EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28ED[0x3];                                     // 0x28ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      MonsterSoulMaterial;                               // 0x28F0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void GetDefaultDMMIParam(struct FLinearColor* DefaultDMMIColor, float* DefaultLineWidth);
	void GetDefaultMaterialParam(struct FLinearColor* DefaultEmisiveColor, float* DefaultEmisiveIntensity);
	void ChangeMonsterColor();
	void ClassifyColorState(ECollapsedGraph* ColorState);
	void GetAllAccessoryMeshes(TArray<class UMeshComponent*>* Meshes_0);
	void PlaySkillPreFXRectangle(bool 播放导表特效, float X_Right, float Y_Forward, int32 RectangleType, float Time, const struct FVector& Location, float Rotation, int32 ColorIndex, int32 EffectId, bool IsAttach, bool AttachRotation, bool AttachedNotFollow, float GroundHeight, class ADecalActor** DecalActor);
	void PlaySkillPreFXCircle(bool 播放导表特效, float OutsideRadius, float InnerRadius, float Angle, float Time, const struct FVector& Location, float Rotation, int32 ColorIndex, int32 EffectId, bool IsAttach, bool AttachRotation, bool AttachedNotFollow, float GroundHeight, class ADecalActor** DecalActor);
	void GetLockBones(TArray<class FName>* LockBones);
	void GetHitBones(TArray<class FName>* HitBones);
	void UpdateHitReaction();
	void MonsterAppear__FinishedFunc();
	void MonsterAppear__UpdateFunc();
	void BeAttack__FinishedFunc();
	void BeAttack__UpdateFunc();
	void Dis__FinishedFunc();
	void Dis__UpdateFunc();
	void EmisiveIntensity__FinishedFunc();
	void EmisiveIntensity__UpdateFunc();
	void Timeline_MonsterFade__FinishedFunc();
	void Timeline_MonsterFade__UpdateFunc();
	void ReceiveBeginPlay();
	void OnHitFlyBegan();
	void OnHitFlyLanded();
	void MonsterAppearMaterialSet();
	void MonsterDead(float DissolveDuration);
	void SetEmisiveColor(const struct FLinearColor& EmisiveColor);
	void SetRimLightColor(const struct FLinearColor& ColorParam);
	void SetEmisiveIntensity(const float EmisiveIntensity_0, float Duration);
	void ClearMaterialEffect();
	void ClearEmisiveIntensityTL();
	void ClearDisTL();
	void ClearAppearTL();
	void ReceiveOnCharacterReady();
	void Event_ClearFadeTimeline();
	void MonsterOutBattleFade(bool IsFade, float Time);
	void SetLineWidth(float LineWidth);
	void MonsterCaptureStart(int32 PlayerEid);
	void MonsterCaptureFailed(int32 PlayerEid);
	void ResetMonsterFadeOut();
	void SetMonsterSoul();
	void ExecuteUbergraph_BP_MonsterCharacter(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MonsterCharacter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MonsterCharacter_C")
	}
	static class ABP_MonsterCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MonsterCharacter_C>();
	}
};
DUMPER7_ASSERTS_ABP_MonsterCharacter_C;

}

