#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_Mon_Jt_Ranger

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Mon_Jt_Ranger.BP_Mon_Jt_Ranger_C.ExecuteUbergraph_BP_Mon_Jt_Ranger
// 0x0088 (0x0088 - 0x0000)
struct BP_Mon_Jt_Ranger_C_ExecuteUbergraph_BP_Mon_Jt_Ranger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandAlone_ReturnValue;                 // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	class ACharacterBase*                         K2Node_ComponentBoundEvent_Character;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageStruct*                          K2Node_ComponentBoundEvent_Damage;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEffectSourceInterface> K2Node_ComponentBoundEvent_Source;                // 0x0018(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TScriptInterface<class IEffectSourceInterface> K2Node_ComponentBoundEvent_Target;                // 0x0028(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class ABP_PlayerCharacter_C*                  K2Node_DynamicCast_AsBP_Player_Character;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEffectSourceInterface> CallFunc_IsDead_Source_CastInput;                 // 0x0048(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-DNA ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HaveDamageTag_ReturnValue;                // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-DNA ])
	int32                                         K2Node_Event_PlayerEid;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEffectSourceInterface> CallFunc_CastToEffectSource_ReturnValue;          // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
DUMPER7_ASSERTS_BP_Mon_Jt_Ranger_C_ExecuteUbergraph_BP_Mon_Jt_Ranger;

// Function BP_Mon_Jt_Ranger.BP_Mon_Jt_Ranger_C.MonsterCaptureEnd
// 0x0004 (0x0004 - 0x0000)
struct BP_Mon_Jt_Ranger_C_MonsterCaptureEnd final
{
public:
	int32                                         PlayerEid;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Mon_Jt_Ranger_C_MonsterCaptureEnd;

// Function BP_Mon_Jt_Ranger.BP_Mon_Jt_Ranger_C.BndEvt__BP_Mon_Jt_Ranger_BattleEvent_K2Node_ComponentBoundEvent_2_EMDamageEvent__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct BP_Mon_Jt_Ranger_C_BndEvt__BP_Mon_Jt_Ranger_BattleEvent_K2Node_ComponentBoundEvent_2_EMDamageEvent__DelegateSignature final
{
public:
	class ACharacterBase*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDamageStruct*                          Damage;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEffectSourceInterface> Source;                                           // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper)
	TScriptInterface<class IEffectSourceInterface> Target;                                           // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper)
};
DUMPER7_ASSERTS_BP_Mon_Jt_Ranger_C_BndEvt__BP_Mon_Jt_Ranger_BattleEvent_K2Node_ComponentBoundEvent_2_EMDamageEvent__DelegateSignature;

// Function BP_Mon_Jt_Ranger.BP_Mon_Jt_Ranger_C.GetHitBones
// 0x0010 (0x0010 - 0x0000)
struct BP_Mon_Jt_Ranger_C_GetHitBones final
{
public:
	TArray<class FName>                           HitBones;                                          // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_Mon_Jt_Ranger_C_GetHitBones;

// Function BP_Mon_Jt_Ranger.BP_Mon_Jt_Ranger_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_Mon_Jt_Ranger_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Mon_Jt_Ranger_C_GetModuleName;

}

