#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_Nvzhu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_structs.hpp"


namespace SDK::Params
{

// Function BP_Nvzhu.BP_Nvzhu_C.ExecuteUbergraph_BP_Nvzhu
// 0x0160 (0x0160 - 0x0000)
struct BP_Nvzhu_C_ExecuteUbergraph_BP_Nvzhu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class UBP_AudioManager_C*                     CallFunc_GetClientAudioManager_AudioManager;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayFXParams                          K2Node_MakeStruct_PlayFXParams;                    // 0x0010(0x0018)(NoDestructor)
	struct FPlayFXParams                          K2Node_MakeStruct_PlayFXParams_1;                  // 0x0028(0x0018)(NoDestructor)
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	TScriptInterface<class IEffectSourceInterface> CallFunc_IsMainPlayer_Target_CastInput;           // 0x0050(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CallFunc_IsMainPlayer_ReturnValue;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ConstParm, ReferenceParm)
	TScriptInterface<class ISkillLevelInterface>  CallFunc_ExecuteSkillEffects_SkillLevelSource_CastInput; // 0x0078(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TScriptInterface<class ISkillLevelInterface>  CallFunc_AddBuffToTarget_SkillLevelSource_CastInput; // 0x0088(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TArray<class UBuff*>                          CallFunc_AddBuffToTarget_ReturnValue;              // 0x0098(0x0010)(ReferenceParm)
	bool                                          CallFunc_RemoveBuffFromTarget_ReturnValue;         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStandAlone_ReturnValue;                 // 0x00A9(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-DNA ])
	int32                                         CallFunc_GetEid_ReturnValue;                       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Battle_C*                           CallFunc_Battle___;                                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array_1;                          // 0x00B8(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_GetEid_ReturnValue_1;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<int32>                                 K2Node_MakeArray_Array_2;                          // 0x00D0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_GetEid_ReturnValue_2;                     // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<int32>                                 K2Node_MakeArray_Array_3;                          // 0x00E8(0x0010)(ConstParm, ReferenceParm)
	class ABP_Battle_C*                           CallFunc_Battle____1;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEid_ReturnValue_3;                     // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<int32>                                 K2Node_MakeArray_Array_4;                          // 0x0108(0x0010)(ConstParm, ReferenceParm)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         K2Node_ComponentBoundEvent_Character;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsDodgeBack;            // 0x0128(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class UAudioManagerBase*                      CallFunc_AudioManager_AudioManager;                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AudioManager_C*                     CallFunc_GetClientAudioManager_AudioManager_1;     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AudioManager_C*                     CallFunc_GetClientAudioManager_AudioManager_2;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class UBP_AudioManager_C*                     CallFunc_GetClientAudioManager_AudioManager_3;     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Nvzhu_C_ExecuteUbergraph_BP_Nvzhu;

// Function BP_Nvzhu.BP_Nvzhu_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Nvzhu_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Nvzhu_C_ReceiveEndPlay;

// Function BP_Nvzhu.BP_Nvzhu_C.BndEvt__BP_Nvzhu_BattleEvent_K2Node_ComponentBoundEvent_0_EnterDodging__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Nvzhu_C_BndEvt__BP_Nvzhu_BattleEvent_K2Node_ComponentBoundEvent_0_EnterDodging__DelegateSignature final
{
public:
	class ACharacterBase*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDodgeBack_0;                                     // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Nvzhu_C_BndEvt__BP_Nvzhu_BattleEvent_K2Node_ComponentBoundEvent_0_EnterDodging__DelegateSignature;

}

