#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NewLevelLoader

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_NewLevelLoader.BP_NewLevelLoader_C.ExecuteUbergraph_BP_NewLevelLoader
// 0x0004 (0x0004 - 0x0000)
struct BP_NewLevelLoader_C_ExecuteUbergraph_BP_NewLevelLoader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NewLevelLoader_C_ExecuteUbergraph_BP_NewLevelLoader;

// Function BP_NewLevelLoader.BP_NewLevelLoader_C.LoadLevelByBPArrow
// 0x0010 (0x0010 - 0x0000)
struct BP_NewLevelLoader_C_LoadLevelByBPArrow final
{
public:
	class ABP_PlayerCharacter_C*                  PlayerCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Arrow_C*                            BPArrow;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NewLevelLoader_C_LoadLevelByBPArrow;

// Function BP_NewLevelLoader.BP_NewLevelLoader_C.UnloadLevelByBPArrow
// 0x0010 (0x0010 - 0x0000)
struct BP_NewLevelLoader_C_UnloadLevelByBPArrow final
{
public:
	class ABP_PlayerCharacter_C*                  PlayerCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Arrow_C*                            BPArrow;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NewLevelLoader_C_UnloadLevelByBPArrow;

// Function BP_NewLevelLoader.BP_NewLevelLoader_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_NewLevelLoader_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_NewLevelLoader_C_GetModuleName;

}

