#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_CM_Talk

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NPC_Enum_structs.hpp"
#include "Enum_NPC_Exp_Mouth_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Body_Enum_structs.hpp"
#include "BP_NPC_classes.hpp"
#include "Enum_NPC_Exp_Eyes_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_CM_Talk.BP_NPC_CM_Talk_C
// 0x0160 (0x23C0 - 0x2260)
class ABP_NPC_CM_Talk_C : public ABP_NPC_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_NPC_CM_Talk_C;                   // 0x2260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   FaceAccessory;                                     // 0x2268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HeadAccessory;                                     // 0x2270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Horn_L;                                            // 0x2278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Hair_SM;                                           // 0x2280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Horn_R;                                            // 0x2288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MouthTimeline_0_Mouth_CFEABB3D4672FCD9680542850BB9F137; // 0x2290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MouthTimeline_0__Direction_CFEABB3D4672FCD9680542850BB9F137; // 0x2294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2295[0x3];                                     // 0x2295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MouthTimeline_0;                                   // 0x2298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EyeTimeline_0_Eyes_EB62D32848617E76EFF90B964ECA610F; // 0x22A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EyeTimeline_0__Direction_EB62D32848617E76EFF90B964ECA610F; // 0x22A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A5[0x3];                                     // 0x22A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EyeTimeline_0;                                     // 0x22A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENPC_Enum                                     Selection;                                         // 0x22B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBody_Enum                                    BodySelection;                                     // 0x22B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22B2[0x2];                                     // 0x22B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BodyID;                                            // 0x22B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HairID;                                            // 0x22B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EyesID;                                            // 0x22BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MouthID;                                           // 0x22C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         角色高度;                                          // 0x22C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 NpcName;                                           // 0x22C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	EAnimationMode                                AniMode;                                           // 0x22D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoHornSymmetry;                                    // 0x22D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22DA[0x2];                                     // 0x22DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HornLeftID;                                        // 0x22DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HornRightID;                                       // 0x22E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HornPrefabID;                                      // 0x22E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangeColor;                                       // 0x22E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22E9[0x3];                                     // 0x22E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ClothColorA;                                       // 0x22EC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ClothColorB;                                       // 0x22FC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ClothColorC;                                       // 0x230C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231C[0x4];                                     // 0x231C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Gender;                                            // 0x2320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 FaceMIIndStr;                                      // 0x2330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 IndStr;                                            // 0x2340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Prefix;                                            // 0x2350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FLinearColor                           HairColor;                                         // 0x2360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_Custom_NPC_C*                      As_ABP_Custom_NPC;                                 // 0x2370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanSetMouth;                                       // 0x2378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2379[0x3];                                     // 0x2379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         口型阈值;                                          // 0x237C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         口型频率;                                          // 0x2380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2384[0x4];                                     // 0x2384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 NPCLipArray;                                       // 0x2388(0x0010)(Edit, BlueprintVisible)
	class FName                                   RowName;                                           // 0x2398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValue;                                          // 0x23A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HeadAccessoryId;                                   // 0x23A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FaceAccessoryId;                                   // 0x23A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HeadPrefabId;                                      // 0x23AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FacePrefabId;                                      // 0x23B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NPC_CM_Talk(int32 EntryPoint);
	void AllAssetLoadingFinish();
	void Evene_NPC_MouthSound();
	void Event_NPC_Mouth(Enum_NPC_Exp_Mouth MouthEnum, float Rate);
	void Event_NPC_Blink(Enum_NPC_Exp_Eyes EyeEnum, float Rate);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void MouthTimeline_0__UpdateFunc();
	void MouthTimeline_0__FinishedFunc();
	void EyeTimeline_0__UpdateFunc();
	void EyeTimeline_0__FinishedFunc();
	void FaceMIPick(const class FString& NpcName_0, int32 Index_0, const class FString& Part);
	void CharPosSet(float 角色高度_0);
	void HornsMeshPick(class UStaticMeshComponent* HornMesh, int32 Index_0, const class FString& Direct);
	void ModuleMeshPick(class USkinnedMeshComponent* SKMesh, const class FString& NpcName_0, int32 Index_0, const class FString& Part);
	void SetHornsLocationPrefab();
	void HornSymmetry();
	void SetHeadAccessoryPrefab();
	void SetFaceAccessoryPrefab();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NPC_CM_Talk_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NPC_CM_Talk_C")
	}
	static class ABP_NPC_CM_Talk_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_CM_Talk_C>();
	}
};
DUMPER7_ASSERTS_ABP_NPC_CM_Talk_C;

}

