#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_Nvzhu_EX01

#include "Basic.hpp"

#include "EM_structs.hpp"


namespace SDK::Params
{

// Function BP_Nvzhu_EX01.BP_Nvzhu_EX01_C.ExecuteUbergraph_BP_Nvzhu_EX01
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Nvzhu_EX01_C_ExecuteUbergraph_BP_Nvzhu_EX01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class ACharacterBase*                         CallFunc_CastToCharacterBase_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TScriptInterface<class ITimerManagerInterface> CallFunc_K2_SetTimerDelegate_Combat_OwnerActor_CastInput; // 0x0020(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	struct FCombatTimerHandle                     CallFunc_K2_SetTimerDelegate_Combat_ReturnValue;   // 0x0030(0x0018)(NoDestructor)
	class ACharacterBase*                         CallFunc_CastToCharacterBase_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         CallFunc_CastToCharacterBase_ReturnValue_2;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EMGameInstance_C*                   K2Node_DynamicCast_AsBP_EMGame_Instance;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class UUIManagerComponent*                    CallFunc_GetGameUIManager_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIState*                               CallFunc_LoadUINew_ReturnValue;                    // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         CallFunc_CastToCharacterBase_ReturnValue_3;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	TScriptInterface<class ISkillLevelInterface>  CallFunc_ExecuteSkillEffects_SkillLevelSource_CastInput; // 0x00B0(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
DUMPER7_ASSERTS_BP_Nvzhu_EX01_C_ExecuteUbergraph_BP_Nvzhu_EX01;

}

