#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_Nvzhu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PassiveEffectBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Nvzhu.BP_Nvzhu_C
// 0x0020 (0x0128 - 0x0108)
class UBP_Nvzhu_C final : public UBP_PassiveEffectBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         LastTime;                                          // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeDilation;                                      // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Nvzhu_Summon_C*                     Shadow;                                            // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MajoTime;                                          // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDodgeBack;                                       // 0x0124(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Nvzhu(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void BndEvt__BP_Nvzhu_BattleEvent_K2Node_ComponentBoundEvent_0_EnterDodging__DelegateSignature(class ACharacterBase* Character, const bool IsDodgeBack_0);
	void ReceiveBeginPlay();
	void OnShadowDamaged();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Nvzhu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Nvzhu_C")
	}
	static class UBP_Nvzhu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Nvzhu_C>();
	}
};
DUMPER7_ASSERTS_UBP_Nvzhu_C;

}

