#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_Nvzhu_Summon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Nvzhu_Summon.BP_Nvzhu_Summon_C.ExecuteUbergraph_BP_Nvzhu_Summon
// 0x0070 (0x0070 - 0x0000)
struct BP_Nvzhu_Summon_C_ExecuteUbergraph_BP_Nvzhu_Summon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ___name_Variable;                                  // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	TScriptInterface<class IEffectSourceInterface> CallFunc_GetCreator_Target_CastInput;             // 0x0010(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TScriptInterface<class IEffectSourceInterface> CallFunc_GetCreator_ReturnValue;                  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class UDamageStruct*                          K2Node_Event_DamageEvent;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacterBase*                         CallFunc_CastToCharacterBase_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDamageTags_ReturnValue;                // 0x0040(0x0010)(ReferenceParm)
	class UPassiveEffectObject*                   CallFunc_GetPassiveEffectById_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class UBP_Nvzhu_C*                            K2Node_DynamicCast_AsBP_Nvzhu;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Nvzhu_Summon_C_ExecuteUbergraph_BP_Nvzhu_Summon;

// Function BP_Nvzhu_Summon.BP_Nvzhu_Summon_C.OnDamaged
// 0x0008 (0x0008 - 0x0000)
struct BP_Nvzhu_Summon_C_OnDamaged final
{
public:
	class UDamageStruct*                          DamageEvent;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Nvzhu_Summon_C_OnDamaged;

// Function BP_Nvzhu_Summon.BP_Nvzhu_Summon_C.CanBeDestroy
// 0x0048 (0x0048 - 0x0000)
struct BP_Nvzhu_Summon_C_CanBeDestroy final
{
public:
	const class ASkillCreature*                   SkillCreature;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Destroy;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 ___string_Variable;                                // 0x0010(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetTags_ReturnValue;                      // 0x0020(0x0010)(ReferenceParm)
	class FString                                 ___string_Variable_1;                              // 0x0030(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Nvzhu_Summon_C_CanBeDestroy;

// Function BP_Nvzhu_Summon.BP_Nvzhu_Summon_C.IsForward
// 0x0050 (0x0050 - 0x0000)
struct BP_Nvzhu_Summon_C_IsForward final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsForward_0;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	TScriptInterface<class IEffectSourceInterface> CallFunc_GetCreator_Target_CastInput;             // 0x0010(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TScriptInterface<class IEffectSourceInterface> CallFunc_GetCreator_ReturnValue;                  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class ACharacterBase*                         CallFunc_CastToCharacterBase_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc________;                                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Nvzhu_Summon_C_IsForward;

}

