#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_NPC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"
#include "Enum_NPC_Exp_Eyes_structs.hpp"
#include "Enum_NPC_Exp_Mouth_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC.BP_NPC_C
// 0x0040 (0x2260 - 0x2220)
class ABP_NPC_C : public ANpcCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEMLipSyncComponent*                    EMLipSync;                                         // 0x2228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMonsterLookAtComponent*                MonsterLookAt;                                     // 0x2230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MouthTimeline_Mouth_3FEA0CFC4971B618EDBBBFB655CC70AA; // 0x2238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MouthTimeline__Direction_3FEA0CFC4971B618EDBBBFB655CC70AA; // 0x223C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_223D[0x3];                                     // 0x223D(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	class UTimelineComponent*                     MouthTimeline;                                     // 0x2240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EyeTimeline_Eyes_75B84520470B47CD64FC9EA3D25A131F; // 0x2248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EyeTimeline__Direction_75B84520470B47CD64FC9EA3D25A131F; // 0x224C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224D[0x3];                                     // 0x224D(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	class UTimelineComponent*                     EyeTimeline;                                       // 0x2250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        HeadWidgetComponent;                               // 0x2258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NPC(int32 EntryPoint);
	void Event_NPC_Mouth(Enum_NPC_Exp_Mouth MouthEnum, float Rate);
	void Event_NPC_Blink(Enum_NPC_Exp_Eyes EyeEnum, float Rate);
	void ReceiveBeginPlay();
	void MouthTimeline__UpdateFunc();
	void MouthTimeline__FinishedFunc();
	void EyeTimeline__UpdateFunc();
	void EyeTimeline__FinishedFunc();
	void UserConstructionScript();
	void PlayDefaultFacialInEditor();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NPC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NPC_C")
	}
	static class ABP_NPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_C>();
	}
};
DUMPER7_ASSERTS_ABP_NPC_C;

}

