#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Custom

#include "Basic.hpp"

#include "Body_Enum_structs.hpp"
#include "Engine_structs.hpp"
#include "NPC_Enum_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_NPC_Exp_Mouth_structs.hpp"
#include "EM_classes.hpp"
#include "Enum_NPC_Exp_Eyes_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_Custom.BP_NPC_Custom_C
// 0x0140 (0x0A50 - 0x0910)
class ABP_NPC_Custom_C final : public ACustomNPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0910(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   HeadAccessory;                                     // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FaceAccessory;                                     // 0x0920(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Horn_R;                                            // 0x0928(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Horn_L;                                            // 0x0930(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Hair_SM;                                           // 0x0938(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____0____55AE23A6445C81243E70D2AC530065AC;         // 0x0940(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_55AE23A6445C81243E70D2AC530065AC; // 0x0944(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_945[0x3];                                      // 0x0945(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0;                                          // 0x0948(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MouthTimeline_Mouth_704F56144670FB12C006D0973733A62F; // 0x0950(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MouthTimeline__Direction_704F56144670FB12C006D0973733A62F; // 0x0954(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_955[0x3];                                      // 0x0955(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MouthTimeline;                                     // 0x0958(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EyeTimeline_Eyes_9D2477CF4BC6ED824D3299BEB1A3F7FF; // 0x0960(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EyeTimeline__Direction_9D2477CF4BC6ED824D3299BEB1A3F7FF; // 0x0964(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_965[0x3];                                      // 0x0965(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EyeTimeline;                                       // 0x0968(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENPC_Enum                                     Selection;                                         // 0x0970(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBody_Enum                                    BodySelection;                                     // 0x0971(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_972[0x2];                                      // 0x0972(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BodyID;                                            // 0x0974(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HairID;                                            // 0x0978(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EyesID;                                            // 0x097C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MouthID;                                           // 0x0980(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ClothID;                                           // 0x0984(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         角色高度;                                          // 0x0988(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98C[0x4];                                      // 0x098C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NpcName;                                           // 0x0990(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	EAnimationMode                                AniMode;                                           // 0x09A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A1[0x3];                                      // 0x09A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HornRightID;                                       // 0x09A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HornLeftID;                                        // 0x09A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoHornSymmetry;                                    // 0x09AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9AD[0x3];                                      // 0x09AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HornPrefabID;                                      // 0x09B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangeColor;                                       // 0x09B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B5[0x3];                                      // 0x09B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ClothColorA;                                       // 0x09B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ClothColorB;                                       // 0x09C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ClothColorC;                                       // 0x09D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Gender;                                            // 0x09E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 FaceMIIndStr;                                      // 0x09F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 IndStr;                                            // 0x0A08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Prefix;                                            // 0x0A18(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FLinearColor                           HairColor;                                         // 0x0A28(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HeadAccessoryId;                                   // 0x0A38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FaceAccessoryId;                                   // 0x0A3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HeadPrefabId;                                      // 0x0A40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FacePrefabId;                                      // 0x0A44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NPC_Custom(int32 EntryPoint);
	void ShowCustomNPC();
	void HideCustomNPC();
	void HornSymmetryUpdate();
	void AllAssetLoadingFinish();
	void ResetNpcAfterParamChanged();
	void Event_NPC_Mouth(Enum_NPC_Exp_Mouth MouthEnum, float Rate);
	void Event_NPC_Blink(Enum_NPC_Exp_Eyes EyeEnum, float Rate);
	void CBT1HornHamorny();
	void 时间轴_0__UpdateFunc();
	void 时间轴_0__FinishedFunc();
	void MouthTimeline__UpdateFunc();
	void MouthTimeline__FinishedFunc();
	void EyeTimeline__UpdateFunc();
	void EyeTimeline__FinishedFunc();
	void UserConstructionScript();
	void FaceMIPick(const class FString& NpcName_0, int32 Index_0, const class FString& Part);
	void HornsMeshPick(class UStaticMeshComponent* HornMesh, int32 Index_0, const class FString& Direct);
	void ModuleMeshPick(class USkinnedMeshComponent* SKMesh, const class FString& NpcName_0, int32 Index_0, const class FString& Part);
	void CharPosSet(float 角色高度_0);
	void SetHornsLocationPrefab();
	void HornSymmetry();
	void CBT1HornHam();
	void Construct_Func();
	void Construct_Coloring();
	void Construct_SetVars();
	void Construct_SetMesh();
	void Construct_AttachComponent();
	void Construct_Horn();
	void Construct_AnimDataSync();
	void SetCustomNpcFlexibShowOrHide();
	void SetHeadAccessoryPrefab();
	void SetFaceAccessoryPrefab();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NPC_Custom_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NPC_Custom_C")
	}
	static class ABP_NPC_Custom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_Custom_C>();
	}
};
DUMPER7_ASSERTS_ABP_NPC_Custom_C;

}

