#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Simple

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_Simple.BP_NPC_Simple_C
// 0x0020 (0x0930 - 0x0910)
class ABP_NPC_Simple_C final : public ACustomNPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0910(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0____D4DCC3EF42AFE2903B2546BA68D94BBB;    // 0x0918(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_D4DCC3EF42AFE2903B2546BA68D94BBB; // 0x091C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91D[0x3];                                      // 0x091D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0920(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NPC_Simple(int32 EntryPoint);
	void ShowCustomNPC();
	void HideCustomNPC();
	void ResetNpcAfterParamChanged();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void SetCustomNpcFlexibShowOrHide();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NPC_Simple_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NPC_Simple_C")
	}
	static class ABP_NPC_Simple_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_Simple_C>();
	}
};
DUMPER7_ASSERTS_ABP_NPC_Simple_C;

}

