#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pan_DecalSwitch

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Pan_DecalSwitch.BP_Pan_DecalSwitch_C.ExecuteUbergraph_BP_Pan_DecalSwitch
// 0x0060 (0x0060 - 0x0000)
struct BP_Pan_DecalSwitch_C_ExecuteUbergraph_BP_Pan_DecalSwitch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NowStateId;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess_1;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess_2;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess_3;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess_4;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_SetSceneComponentHiddenInGame_HiddenComponents; // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USceneComponent*>                CallFunc_SetSceneComponentHiddenInGame_HiddenComponents_1; // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_AudioManager_C*                     CallFunc_GetClientAudioManager_AudioManager;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AudioManager_C*                     CallFunc_GetClientAudioManager_AudioManager_1;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AudioManager_C*                     CallFunc_GetClientAudioManager_AudioManager_2;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pan_DecalSwitch_C_ExecuteUbergraph_BP_Pan_DecalSwitch;

// Function BP_Pan_DecalSwitch.BP_Pan_DecalSwitch_C.OnEnterState
// 0x0004 (0x0004 - 0x0000)
struct BP_Pan_DecalSwitch_C_OnEnterState final
{
public:
	int32                                         NowStateId;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Pan_DecalSwitch_C_OnEnterState;

}

