#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PickupBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PickupBase.BP_PickupBase_C
// 0x0048 (0x0BC0 - 0x0B78)
class ABP_PickupBase_C : public APickupProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           NS_Item_Base_Chara_Pro;                            // 0x0B80(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NS_Item_Base_Fly_Ultra;                            // 0x0B90(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NS_Item_Base_Chara_Blue;                           // 0x0BA0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NS_Item_Base_Chara_Green;                          // 0x0BB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PickupBase(int32 EntryPoint);
	void CloseMesh();
	void ShowMesh();
	void SetMeshEffectColor(const struct FLinearColor& NewColor);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PickupBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PickupBase_C")
	}
	static class ABP_PickupBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PickupBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_PickupBase_C;

}

