#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PickupStatic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PickupStatic.BP_PickupStatic_C
// 0x0048 (0x0B40 - 0x0AF8)
class ABP_PickupStatic_C : public APickupStatic
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AF8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           NS_Item_Base_Chara_Pro;                            // 0x0B00(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NS_Item_Base_Fly_Ultra;                            // 0x0B10(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NS_Item_Base_Chara_Blue;                           // 0x0B20(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NS_Item_Base_Chara_Green;                          // 0x0B30(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PickupStatic(int32 EntryPoint);
	void SetMeshEffectColor(const struct FLinearColor& NewColor);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PickupStatic_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PickupStatic_C")
	}
	static class ABP_PickupStatic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PickupStatic_C>();
	}
};
DUMPER7_ASSERTS_ABP_PickupStatic_C;

}

