#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PetNPC_Common

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_PetNPC_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PetNPC_Common.BP_PetNPC_Common_C
// 0x00C0 (0x2340 - 0x2280)
class ABP_PetNPC_Common_C final : public ABP_PetNPC_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PetNPC_Common_C;                 // 0x2280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere_0;                                          // 0x2288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          InRange;                                           // 0x2290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2291[0x7];                                     // 0x2291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerCharacter_C*                  BP_Player_Character;                               // 0x2298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dis_Max;                                           // 0x22A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dis_Min;                                           // 0x22A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A8[0x8];                                     // 0x22A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Loc_Spawn;                                         // 0x22B0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             Loc_B4Minigame;                                    // 0x22E0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CollisionFail;                                     // 0x2310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2311[0x3];                                     // 0x2311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HaloScale;                                         // 0x2314(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 HaloColor_Select;                                  // 0x2320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 HaloColor_LV2;                                     // 0x2324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 HaloColor_LV3;                                     // 0x2328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 HaloColor_LV4;                                     // 0x232C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 HaloColor_LV5;                                     // 0x2330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PetNPC_Common(int32 EntryPoint);
	void BndEvt__BP_PetNPC_Common_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_PetNPC_Common_PetNpcCollisionCheck_K2Node_ComponentBoundEvent_2_OnCollisionCheck__DelegateSignature(bool res);
	void BndEvt__BP_PetNPC_Common_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveBeginPlay();
	void OnPetMiniGameSwitch(int32 MiniGameState);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PetNPC_Common_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PetNPC_Common_C")
	}
	static class ABP_PetNPC_Common_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PetNPC_Common_C>();
	}
};
DUMPER7_ASSERTS_ABP_PetNPC_Common_C;

}

