#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_PhantomCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Phantom_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PhantomCharacter.BP_PhantomCharacter_C
// 0x0020 (0x2C80 - 0x2C60)
class ABP_PhantomCharacter_C final : public ABP_Phantom_C
{
public:
	uint8                                         Pad_2C51[0x7];                                     // 0x2C51(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PhantomCharacter_C;              // 0x2C58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMonsterLookAtComponent*                MonsterLookAt;                                     // 0x2C60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____0______0_84BB506F4B7B5C6BCBEB0C9C9C312AB5;     // 0x2C68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_84BB506F4B7B5C6BCBEB0C9C9C312AB5; // 0x2C6C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C6D[0x3];                                     // 0x2C6D(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	class UTimelineComponent*                     时间轴_0;                                          // 0x2C70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PhantomCharacter(int32 EntryPoint);
	void CharAppear();
	void CharDis();
	void SetEmissiveIntensity_Material(class UMaterialInstanceDynamic* MaterialDynamic, float EmisiveIntensity);
	void ReceiveBeginPlay();
	void 时间轴_0__UpdateFunc();
	void 时间轴_0__FinishedFunc();
	void GetDefaultEmissiveIntensityEx(class UMaterialInstanceDynamic* MaterialDynamic, float* EmissiveIntensity);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PhantomCharacter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PhantomCharacter_C")
	}
	static class ABP_PhantomCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PhantomCharacter_C>();
	}
};
DUMPER7_ASSERTS_ABP_PhantomCharacter_C;

}

