#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_PetNPC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PetNPC.BP_PetNPC_C
// 0x0050 (0x2280 - 0x2230)
class ABP_PetNPC_C final : public APetNpcCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPetNpcCollisionCheckComponent*         PetNpcCollisionCheck;                              // 0x2238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_EMWidgetComponent_C*                PetHeadWidgetComponent;                            // 0x2240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x2248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0________DE84AAAE43C0CAC728A0E6968C1356D4; // 0x2250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_DE84AAAE43C0CAC728A0E6968C1356D4; // 0x2254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2255[0x3];                                     // 0x2255(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x2258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProgressTimeline_NewTrack_0_46E82DCA4DE339F9E1584F84CD592735; // 0x2260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ProgressTimeline__Direction_46E82DCA4DE339F9E1584F84CD592735; // 0x2264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2265[0x3];                                     // 0x2265(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	class UTimelineComponent*                     ProgressTimeline;                                  // 0x2268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraLocation;                                    // 0x2270(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PetNPC(int32 EntryPoint);
	void UpdateModelSkin(int32 PetModelId);
	void OnResourceReady();
	void OnPetStatesSwitch(int32 PetState);
	void ClearAppearTL();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void ProgressTimeline__UpdateFunc();
	void ProgressTimeline__FinishedFunc();
	void ProgressUpdate(float TickDelta);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PetNPC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PetNPC_C")
	}
	static class ABP_PetNPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PetNPC_C>();
	}
};
DUMPER7_ASSERTS_ABP_PetNPC_C;

}

