#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_StoryVarsObject

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_StoryVarsObject.BP_StoryVarsObject_C.Equal
// 0x0002 (0x0002 - 0x0000)
struct BP_StoryVarsObject_C_Equal final
{
public:
	bool                                          是否等于传入的值;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_StoryVarsObject_C_Equal;

// Function BP_StoryVarsObject.BP_StoryVarsObject_C.OnChanged_TeammateEffects
// 0x0018 (0x0018 - 0x0000)
struct BP_StoryVarsObject_C_OnChanged_TeammateEffects final
{
public:
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_StoryVarsObject_C_OnChanged_TeammateEffects;

// Function BP_StoryVarsObject.BP_StoryVarsObject_C.Plus
// 0x0008 (0x0008 - 0x0000)
struct BP_StoryVarsObject_C_Plus final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StoryVarsObject_C_Plus;

// Function BP_StoryVarsObject.BP_StoryVarsObject_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_StoryVarsObject_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StoryVarsObject_C_GetModuleName;

}

