#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillFeatureLevelSequenceActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SkillFeatureLevelSequenceActor.BP_SkillFeatureLevelSequenceActor_C
// 0x0020 (0x0498 - 0x0478)
class ABP_SkillFeatureLevelSequenceActor_C final : public ASkillFeatureSequenceActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TraceRadius;                                       // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   TraceProfileName;                                  // 0x0484(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         CapsuleTraceDis;                                   // 0x048C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   AttachBoneName;                                    // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SkillFeatureLevelSequenceActor(int32 EntryPoint);
	void ReceiveBeginPlay();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SkillFeatureLevelSequenceActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SkillFeatureLevelSequenceActor_C")
	}
	static class ABP_SkillFeatureLevelSequenceActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SkillFeatureLevelSequenceActor_C>();
	}
};
DUMPER7_ASSERTS_ABP_SkillFeatureLevelSequenceActor_C;

}

