#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: BP_SeatBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SeatBase.BP_SeatBase_C
// 0x0028 (0x0A28 - 0x0A00)
class ABP_SeatBase_C : public ASeatBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box1;                                              // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ChestInteractiveComponent_C*        DefaultInteractiveComponent;                       // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SeatEnterComponent_C*               BP_SeatEnterComponent;                             // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SeatPointComponent_C*               BP_SeatPointComponent;                             // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SeatBase(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SeatBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SeatBase_C")
	}
	static class ABP_SeatBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SeatBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_SeatBase_C;

}

