#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Sound_Volume

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Sound_Volume_Event_Info_structs.hpp"
#include "BP_Sound_Volume_Type_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EM_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Sound_Volume.BP_Sound_Volume_C
// 0x0190 (0x05C8 - 0x0438)
class ABP_Sound_Volume_C final : public ASoundVolume
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cylinder;                                          // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CapsuleCollision;                                  // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       SphereCollision;                                   // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoxCollision;                                      // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FBP_Sound_Volume_Event_Info            BgmInfo;                                           // 0x0478(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	EBP_Sound_Volume_Type                         Shape;                                             // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x3];                                      // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Size;                                              // 0x04DC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Half_Height;                                       // 0x04E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radios;                                            // 0x04EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Priority;                                          // 0x04F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBP_Sound_Volume_Event_Info            NoiseInfo;                                         // 0x04F8(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                         NoiseLoudRatio;                                    // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBP_Sound_Volume_Event_Info            SnapShotInfo;                                      // 0x0560(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bAutoStopCommonReverb;                             // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Sound_Volume(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void Set_Shape_Active(EBP_Sound_Volume_Type SelectShape);
	bool GetAutoStopCommonReverb();
	float GetNoiseLoudRatio();
	ESoundVolumeType GetSoundVolumeType();
	void SetCPPEventInfo();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Sound_Volume_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Sound_Volume_C")
	}
	static class ABP_Sound_Volume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Sound_Volume_C>();
	}
};
DUMPER7_ASSERTS_ABP_Sound_Volume_C;

}

