#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Sound_Volume

#include "Basic.hpp"

#include "EM_structs.hpp"
#include "BP_Sound_Volume_Type_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Sound_Volume.BP_Sound_Volume_C.ExecuteUbergraph_BP_Sound_Volume
// 0x0004 (0x0004 - 0x0000)
struct BP_Sound_Volume_C_ExecuteUbergraph_BP_Sound_Volume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Sound_Volume_C_ExecuteUbergraph_BP_Sound_Volume;

// Function BP_Sound_Volume.BP_Sound_Volume_C.UserConstructionScript
// 0x002C (0x002C - 0x0000)
struct BP_Sound_Volume_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorInt_ReturnValue;             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Sound_Volume_C_UserConstructionScript;

// Function BP_Sound_Volume.BP_Sound_Volume_C.Set Shape Active
// 0x0002 (0x0002 - 0x0000)
struct BP_Sound_Volume_C_Set_Shape_Active final
{
public:
	EBP_Sound_Volume_Type                         SelectShape;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Sound_Volume_C_Set_Shape_Active;

// Function BP_Sound_Volume.BP_Sound_Volume_C.GetAutoStopCommonReverb
// 0x0001 (0x0001 - 0x0000)
struct BP_Sound_Volume_C_GetAutoStopCommonReverb final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Sound_Volume_C_GetAutoStopCommonReverb;

// Function BP_Sound_Volume.BP_Sound_Volume_C.GetNoiseLoudRatio
// 0x0004 (0x0004 - 0x0000)
struct BP_Sound_Volume_C_GetNoiseLoudRatio final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Sound_Volume_C_GetNoiseLoudRatio;

// Function BP_Sound_Volume.BP_Sound_Volume_C.GetSoundVolumeType
// 0x0002 (0x0002 - 0x0000)
struct BP_Sound_Volume_C_GetSoundVolumeType final
{
public:
	ESoundVolumeType                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Sound_Volume_C_GetSoundVolumeType;

// Function BP_Sound_Volume.BP_Sound_Volume_C.SetCPPEventInfo
// 0x0120 (0x0120 - 0x0000)
struct BP_Sound_Volume_C_SetCPPEventInfo final
{
public:
	struct FSoundVolumeEventInfo                  K2Node_MakeStruct_SoundVolumeEventInfo;            // 0x0000(0x0060)()
	struct FSoundVolumeEventInfo                  K2Node_MakeStruct_SoundVolumeEventInfo_1;          // 0x0060(0x0060)()
	struct FSoundVolumeEventInfo                  K2Node_MakeStruct_SoundVolumeEventInfo_2;          // 0x00C0(0x0060)()
};
DUMPER7_ASSERTS_BP_Sound_Volume_C_SetCPPEventInfo;

}

