#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TalkTriggerConditionObject

#include "Basic.hpp"

#include "EM_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C
// 0x0028 (0x0090 - 0x0068)
class UBP_TalkTriggerConditionObject_C final : public UTalkTriggerConditionObject
{
public:
	int32                                         QuestId;                                           // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         QuestChainId;                                      // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TalkTriggerId;                                     // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name_0;                                            // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ExploreGroupId;                                    // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void QuestStart(bool* 任务是否开始);
	void QuestFinish(bool* 任务是否完成);
	void QuestUnstart(bool* 任务是否没开始);
	void QuestChainLock(bool* 任务链是否解锁);
	void QuestChainUnlock(bool* 任务链是否没解锁);
	void QuestChainUnstart(bool* 任务链是否没开始);
	void QuestChainStart(bool* 任务链是否开始);
	void QuestChainFinish(bool* 任务链是否结束);
	void ImprComp(bool* 印象系统是否是否完成);
	void ImprUncomp(bool* 印象系统是否是否完成);
	void VarEqual(bool* 变量是否相等);
	void ExploreGroupComp(bool* 探索组是否完成);
	void QuestChainUnFinish(bool* 任务链是否未完成);
	void ExploreGroupActive(bool* 探索组是否完成);
	void ExploreGroupInActive(bool* 探索组是否完成);
	void IsBoy(bool* 是否为指定性别);
	void IsGirl(bool* 是否为指定性别);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_TalkTriggerConditionObject_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_TalkTriggerConditionObject_C")
	}
	static class UBP_TalkTriggerConditionObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TalkTriggerConditionObject_C>();
	}
};
DUMPER7_ASSERTS_UBP_TalkTriggerConditionObject_C;

}

