#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TalkTriggerConditionObject

#include "Basic.hpp"

#include "EM_structs.hpp"


namespace SDK::Params
{

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.QuestStart
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_QuestStart final
{
public:
	bool                                          任务是否开始;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvatarFunctionLibrary*                 CallFunc_GetInstance_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestDoing_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_QuestStart;

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.QuestFinish
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_QuestFinish final
{
public:
	bool                                          任务是否完成;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvatarFunctionLibrary*                 CallFunc_GetInstance_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestFinished_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_QuestFinish;

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.QuestUnstart
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_QuestUnstart final
{
public:
	bool                                          任务是否没开始;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvatarFunctionLibrary*                 CallFunc_GetInstance_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestFinished_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQuestDoing_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_QuestUnstart;

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.QuestChainLock
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_QuestChainLock final
{
public:
	bool                                          任务链是否解锁;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvatarFunctionLibrary*                 CallFunc_GetInstance_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestChainLock_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_QuestChainLock;

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.QuestChainUnlock
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_QuestChainUnlock final
{
public:
	bool                                          任务链是否没解锁;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvatarFunctionLibrary*                 CallFunc_GetInstance_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestChainUnlock_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_QuestChainUnlock;

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.QuestChainUnstart
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_QuestChainUnstart final
{
public:
	bool                                          任务链是否没开始;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvatarFunctionLibrary*                 CallFunc_GetInstance_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestChainDoing_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQuestFinished_ReturnValue;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_QuestChainUnstart;

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.QuestChainStart
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_QuestChainStart final
{
public:
	bool                                          任务链是否开始;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvatarFunctionLibrary*                 CallFunc_GetInstance_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestChainDoing_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_QuestChainStart;

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.QuestChainFinish
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_QuestChainFinish final
{
public:
	bool                                          任务链是否结束;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvatarFunctionLibrary*                 CallFunc_GetInstance_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestChainFinished_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_QuestChainFinish;

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.ImprComp
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_ImprComp final
{
public:
	bool                                          印象系统是否是否完成;                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvatarFunctionLibrary*                 CallFunc_GetInstance_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStorylineComplete_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_ImprComp;

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.ImprUncomp
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_ImprUncomp final
{
public:
	bool                                          印象系统是否是否完成;                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvatarFunctionLibrary*                 CallFunc_GetInstance_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStorylineUnComplete_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_ImprUncomp;

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.VarEqual
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_VarEqual final
{
public:
	bool                                          变量是否相等;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStorySubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetInt_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_VarEqual;

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.ExploreGroupComp
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_ExploreGroupComp final
{
public:
	bool                                          探索组是否完成;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvatarFunctionLibrary*                 CallFunc_GetInstance_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExploreGroupStatus                           CallFunc_GetExploreGroupStatus_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_ExploreGroupComp;

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.QuestChainUnFinish
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_QuestChainUnFinish final
{
public:
	bool                                          任务链是否未完成;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvatarFunctionLibrary*                 CallFunc_GetInstance_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestChainFinished_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_QuestChainUnFinish;

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.ExploreGroupActive
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_ExploreGroupActive final
{
public:
	bool                                          探索组是否完成;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvatarFunctionLibrary*                 CallFunc_GetInstance_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExploreGroupStatus                           CallFunc_GetExploreGroupStatus_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_ExploreGroupActive;

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.ExploreGroupInActive
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_ExploreGroupInActive final
{
public:
	bool                                          探索组是否完成;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAvatarFunctionLibrary*                 CallFunc_GetInstance_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExploreGroupStatus                           CallFunc_GetExploreGroupStatus_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_ExploreGroupInActive;

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.IsBoy
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_IsBoy final
{
public:
	bool                                          是否为指定性别;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerGender_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_IsBoy;

// Function BP_TalkTriggerConditionObject.BP_TalkTriggerConditionObject_C.IsGirl
// 0x0018 (0x0018 - 0x0000)
struct BP_TalkTriggerConditionObject_C_IsGirl final
{
public:
	bool                                          是否为指定性别;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerGender_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_TalkTriggerConditionObject_C_IsGirl;

}

