#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WorldLoader

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_WorldLoader.BP_WorldLoader_C.GetLevelPathfindingComponent
// 0x0010 (0x0010 - 0x0000)
struct BP_WorldLoader_C_GetLevelPathfindingComponent final
{
public:
	class ULevelPathfindingComponent*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWorldCompositionEnabled_ReturnValue;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_WorldLoader_C_GetLevelPathfindingComponent;

// Function BP_WorldLoader.BP_WorldLoader_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_WorldLoader_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_WorldLoader_C_ReceiveTick;

// Function BP_WorldLoader.BP_WorldLoader_C.ExecuteUbergraph_BP_WorldLoader
// 0x0008 (0x0008 - 0x0000)
struct BP_WorldLoader_C_ExecuteUbergraph_BP_WorldLoader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_WorldLoader_C_ExecuteUbergraph_BP_WorldLoader;

// Function BP_WorldLoader.BP_WorldLoader_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct BP_WorldLoader_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_WorldLoader_C_GetModuleName;

}

