#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WindCreateNew

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CombatItemBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WindCreateNew.BP_WindCreateNew_C
// 0x0080 (0x0A58 - 0x09D8)
class ABP_WindCreateNew_C : public ABP_CombatItemBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x09E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TrapArea;                                          // 0x09E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         WindSpeed;                                         // 0x09F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WindRate;                                          // 0x09F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACharacterBase*>                 InWindCharacters;                                  // 0x09F8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TMap<int32, int32>                            StateSpeedMap;                                     // 0x0A08(0x0050)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BP_WindCreateNew(int32 EntryPoint);
	void SwitchBefore();
	void BndEvt__BP_Wind_TrapArea_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_Wind_TrapArea_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnCharacterEnter(class ACharacterBase* Character);
	void OnCharacterLeave(class ACharacterBase* Character);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WindCreateNew_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WindCreateNew_C")
	}
	static class ABP_WindCreateNew_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WindCreateNew_C>();
	}
};
DUMPER7_ASSERTS_ABP_WindCreateNew_C;

}

