#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: Common_KeyChest

#include "Basic.hpp"


namespace SDK::Params
{

// Function Common_KeyChest.Common_KeyChest_C.ExecuteUbergraph_Common_KeyChest
// 0x0048 (0x0048 - 0x0000)
struct Common_KeyChest_C_ExecuteUbergraph_Common_KeyChest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class ACharacterBase*                         K2Node_ComponentBoundEvent_Character;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ResourceId;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ResourceNum;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<class UStaticCreatorComponent*>        K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class ACombatItemBase*                        K2Node_ComponentBoundEvent_Mechanism;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_StateId;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_LeaveStateId;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Common_KeyChest_C_ExecuteUbergraph_Common_KeyChest;

// Function Common_KeyChest.Common_KeyChest_C.BndEvt__Common_Chest_Chest_K2Node_ComponentBoundEvent_0_OnMechanismStateChangeDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Common_KeyChest_C_BndEvt__Common_Chest_Chest_K2Node_ComponentBoundEvent_0_OnMechanismStateChangeDelegate__DelegateSignature final
{
public:
	class ACombatItemBase*                        Mechanism;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StateId;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LeaveStateId;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Common_KeyChest_C_BndEvt__Common_Chest_Chest_K2Node_ComponentBoundEvent_0_OnMechanismStateChangeDelegate__DelegateSignature;

// Function Common_KeyChest.Common_KeyChest_C.BndEvt__Common_KeyChest_Drop_K2Node_ComponentBoundEvent_1_OnPlayerGetResourceDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Common_KeyChest_C_BndEvt__Common_KeyChest_Drop_K2Node_ComponentBoundEvent_1_OnPlayerGetResourceDelegate__DelegateSignature final
{
public:
	class ACharacterBase*                         Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResourceID_0;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResourceNum_0;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Common_KeyChest_C_BndEvt__Common_KeyChest_Drop_K2Node_ComponentBoundEvent_1_OnPlayerGetResourceDelegate__DelegateSignature;

}

