#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConditionComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ConditionComponent.ConditionComponent_C
// 0x00C8 (0x0180 - 0x00B8)
class UConditionComponent_C final : public UConditionLogicComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         条件编号;                                          // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterBase*                         角色;                                              // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 目标eid列表;                                       // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         技能效果;                                          // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PhantomCharId;                                     // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BuffId;                                            // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SummonId;                                          // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CompareBaseInt;                                    // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CompareBase;                                       // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CompareLogic;                                      // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   TargetFilter;                                      // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TNValue;                                           // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EffectId;                                          // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PartID;                                            // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HpPercent;                                         // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RelativeDis;                                       // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RelativeAngle;                                     // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillGrade;                                        // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillObject*                           Skill;                                             // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HalfHeight;                                        // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UnitId;                                            // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Key;                                               // 0x0148(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Int;                                               // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   KeyName;                                           // 0x015C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MonsterId;                                         // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Height;                                            // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BattlePropId;                                      // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CorpType;                                          // 0x0170(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Check_Creater_Key_Int(bool* Return);
	void CheckCreaterBuff(bool* Return);
	void IsRealSummon(bool* Return);
	void Check_SkillCreature(bool* Return);
	void BossAida_InP3orP4orP5(bool* Return);
	void BossAida_InP1orP2(bool* Return);
	void Check_Char_AO(bool* Return);
	void Can_BattleProp(bool* 是否成功);
	void IsQuestRole(bool* Return);
	void Is_Shooting(bool* Return);
	void CheckInSquadDungeon(bool* Result);
	void BossTuosi_CanUseSkill04(bool* Return);
	void Check_Mon_EX02_EscapingFromBattle(bool* Return);
	void Is_Phantom_Dispatching(bool* Return);
	void Is_OnGround(bool* Return);
	void Can_Interactive_Paotai(bool* Return);
	void Check_ComboLevel(bool* Return);
	void Not_PerfectHeavyShooting(bool* Return);
	void CustomizedTargets_IsValid(bool* Return);
	void Is_HighEnough(bool* Return);
	void Check_Mon_UnitId(bool* Return);
	void Magazine_Zero(bool* Return);
	void Check_HeavyCharge_Grade(bool* Return);
	void Check_Buff_Type(bool* Return);
	void SummonNumMore_Arbitray(bool* Return);
	void Check_Heitao_SkillGrade6(bool* Return);
	bool Is_In_Rouge();
	bool CheckNotifyCondition(int32 EffectId_0, int32 CombatConditionId, class ACharacterBase* Source);
	void Check_BTTarget_Buff(bool* Return);
	void Check_Mon_IsInBattle(bool* Return);
	void Check_Mon_IsActive(bool* Return);
	void Check_Mon_CorpType(bool* Return);
	void Check_Mon_BBValue_ObjectIsNull(bool* Return);
	void Check_Mon_BBValue_Int(bool* Return);
	void Check_Mon_BBValue(bool* Return);
	bool Is_In_Stun();
	void Check_Maer_PassiveBuff(bool* Return);
	void Check_Mon_HpPercentUnder(bool* Return);
	void Check_Mon_Dungeon_EscapingFromBattle(bool* Return);
	void Check_Yeer_Skill01B(bool* Return);
	void Check_Yeer_Skill01A(bool* Return);
	void Check_Songlu_CanDash(bool* Return);
	void Check_Xier_InSkill2(bool* Return);
	void Check_Key_Int(bool* Return);
	void Check_Key_Float(bool* Return);
	void Check_Key_Bool(bool* Return);
	EHitFlyState Is_In_LieDown(bool* Return);
	void Is_Seating(bool* Return);
	bool CheckCondition(int32 CombatConditionId, class ACharacterBase* Character, const TArray<int32>& TargetEids);
	void Check_Mon_Region_EscapingFromBattle(bool* Return);
	void Is_Idle(bool* Return);
	void IsStoryBoss(bool* 是否成功);
	void Is_UnitId_Match(bool* Return);
	void Is_MonsterCharacter(bool* Return);
	void Is_PlayerCharacter(bool* Return);
	void IsAnySceneAroundBTTarget(bool* Return);
	void Not_SpMax(bool* Return);
	void Sp_Zero(bool* Return);
	void Not_HpMax(bool* Return);
	void Not_BulletMax(bool* Return);
	void Bullet_Zero(bool* Return);
	void BrokenPart(bool* 是否成功);
	void IsRecovering(bool* Return);
	void Summoner_Skill_1_Hold(bool* Return);
	void PartIsBroken(bool* 是否成功);
	void Is_FallAttack_Landed(bool* Return);
	void Skill2_Hold(bool* Return);
	void Skill1_Hold(bool* Return);
	void Press_AnyAttack(bool* Return);
	void Check_TriggerProb(bool* Return);
	void Magazine_Is_Full(bool* Return);
	void Press_Attack(bool* Return);
	void IsInteractive(bool* Return);
	void SummonInRange(bool* Return);
	void SummonNumMore(bool* Return);
	void Check_Skill_Grade(bool* Return);
	void Check_CurrentTN(bool* Return);
	void Can_Gesture(bool* Return);
	void Is_TeamHp_Below(bool* Return);
	void Is_Hp_Above(bool* Return);
	void Check_SecondSpRate(bool* Return);
	bool Check_Maer_Skill01_Grade2();
	void Check_Maer_Skill01_Target(bool* Return);
	void Check_SecondSP(bool* Return);
	void Summoner_Check_Buff(bool* Return);
	void Check_No_Bullet(bool* Return);
	void Check_Ranged_Mon_Num(bool* Return);
	void Check_BTTargetAngle(bool* Return);
	void Check_BTTargetLoc(bool* Return);
	void Check_Attr_Self(bool* Return);
	void Check_Excel_Weapon(bool* Return);
	void Check_Team_Same_Element(bool* Return);
	void Check_Attr_Element(bool* Return);
	void Check_EffectTargetValid(bool* Return);
	void Check_Buff_Layer(bool* Return);
	void Check_Buff_LastTime(bool* Return);
	void Check_Buff(bool* Return);
	void Not_Shoot_Hold(bool* Return);
	void Not_Attack_Hold(bool* Return);
	void Is_In_BulletJump(bool* Return);
	void Is_Flying(bool* Return);
	void Is_In_Air(bool* Return);
	void effect_hit_target(bool* Return);
	void hit_target(bool* 是否成功);
	void Has_Movement_Input(bool* Return);
	void Phantom_BulletJump(bool* Return);
	void Phantom_OwnerDis(bool* Return);
	void Is_Phantom(bool* Return);
	void Can_Phantom_Summon_Num(bool* Return);
	void Can_Phantom_Summon_Id(bool* Return);
	void Not_In_Battle(bool* Return);
	void Is_In_SkillFeature(bool* Return);
	void ConditionResult(int32 CombatConditionId, bool bResult);
	void ExecuteUbergraph_ConditionComponent(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ConditionComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConditionComponent_C")
	}
	static class UConditionComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConditionComponent_C>();
	}
};
DUMPER7_ASSERTS_UConditionComponent_C;

}

