#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: DBTween

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "DBTween_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class DBTween.DBTweenBase
// 0x0040 (0x0070 - 0x0030)
class UDBTweenBase : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x40];                                      // 0x0030(0x0040)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static bool DBTweenPause(const class FString& TweenName);
	static bool DBTweenPlay(const class FString& TweenName);
	static bool DBTweenReset(const class FString& TweenName);
	static bool DBTweenStop(const class FString& TweenName);
	static bool ExistDBTween(const class FString& DBTweenKey);
	static TArray<class FString> GetAllDBTween();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DBTweenBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DBTweenBase")
	}
	static class UDBTweenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBTweenBase>();
	}
};
DUMPER7_ASSERTS_UDBTweenBase;

// Class DBTween.DBTweenActor
// 0x00A0 (0x0110 - 0x0070)
class alignas(0x10) UDBTweenActor final : public UDBTweenBase
{
public:
	TMulticastInlineDelegate<void()>              OnFirst;                                           // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnUpdate;                                          // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnComplete;                                        // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x70];                                      // 0x00A0(0x0070)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UDBTweenActor* DOLocalMove(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FVector& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenActor* DOLocalMoveByCurve(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FVector& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenActor* DOLocalRotation(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FRotator& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenActor* DOLocalRotationByCurve(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FRotator& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenActor* DOLocalScale(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FVector& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenActor* DOLocalScaleByCurve(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FVector& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenActor* DOMove(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FVector& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenActor* DOMoveByCurve(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FVector& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenActor* DORotation(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FRotator& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenActor* DORotationByCurve(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FRotator& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenActor* DOScale(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FVector& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenActor* DOScaleByCurve(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FVector& End, class UCurveFloat* Curve, bool IsLoop);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DBTweenActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DBTweenActor")
	}
	static class UDBTweenActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBTweenActor>();
	}
};
DUMPER7_ASSERTS_UDBTweenActor;

// Class DBTween.DBTweenCanvasPanelSlot
// 0x0050 (0x00C0 - 0x0070)
class UDBTweenCanvasPanelSlot final : public UDBTweenBase
{
public:
	TMulticastInlineDelegate<void()>              OnFirst;                                           // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnUpdate;                                          // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnComplete;                                        // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x20];                                      // 0x00A0(0x0020)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UDBTweenCanvasPanelSlot* DOMove(const class FString& TweenName, float DurTime, class UCanvasPanelSlot* CanvasPanelSlot, const struct FVector2D& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenCanvasPanelSlot* DOMoveByCurve(const class FString& TweenName, float DurTime, class UCanvasPanelSlot* CanvasPanelSlot, const struct FVector2D& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenCanvasPanelSlot* DOSize(const class FString& TweenName, float DurTime, class UCanvasPanelSlot* CanvasPanelSlot, const struct FVector2D& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenCanvasPanelSlot* DOSizeByCurve(const class FString& TweenName, float DurTime, class UCanvasPanelSlot* CanvasPanelSlot, const struct FVector2D& End, class UCurveFloat* Curve, bool IsLoop);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DBTweenCanvasPanelSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DBTweenCanvasPanelSlot")
	}
	static class UDBTweenCanvasPanelSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBTweenCanvasPanelSlot>();
	}
};
DUMPER7_ASSERTS_UDBTweenCanvasPanelSlot;

// Class DBTween.DBTweenColor
// 0x0050 (0x00C0 - 0x0070)
class UDBTweenColor final : public UDBTweenBase
{
public:
	TMulticastInlineDelegate<void(const struct FLinearColor& curValue)> OnFirst;                     // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FLinearColor& curValue)> OnUpdate;                    // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FLinearColor& curValue)> OnComplete;                  // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x20];                                      // 0x00A0(0x0020)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UDBTweenColor* DOColor(const class FString& TweenName, float DurTime, const struct FLinearColor& Start, const struct FLinearColor& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenColor* DOColorByCurve(const class FString& TweenName, float DurTime, const struct FLinearColor& Start, const struct FLinearColor& End, class UCurveFloat* Curve, bool IsLoop);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DBTweenColor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DBTweenColor")
	}
	static class UDBTweenColor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBTweenColor>();
	}
};
DUMPER7_ASSERTS_UDBTweenColor;

// Class DBTween.DBTweenFloat
// 0x0038 (0x00A8 - 0x0070)
class UDBTweenFloat final : public UDBTweenBase
{
public:
	TMulticastInlineDelegate<void(float curValue)> OnFirst;                                          // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float curValue)> OnUpdate;                                         // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float curValue)> OnComplete;                                       // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UDBTweenFloat* DOFloat(const class FString& TweenName, float DurTime, float Start, float End, EaseType EaseType, bool IsLoop);
	static class UDBTweenFloat* DOFloatByCurve(const class FString& TweenName, float DurTime, float Start, float End, class UCurveFloat* Curve, bool IsLoop);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DBTweenFloat")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DBTweenFloat")
	}
	static class UDBTweenFloat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBTweenFloat>();
	}
};
DUMPER7_ASSERTS_UDBTweenFloat;

// Class DBTween.DBTweenPath
// 0x0088 (0x00F8 - 0x0070)
class UDBTweenPath final : public UDBTweenBase
{
public:
	TMulticastInlineDelegate<void(const struct FVector& curPos, const struct FRotator& curRotator)> OnFirst; // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FVector& curPos, const struct FRotator& curRotator)> OnUpdate; // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FVector& curPos, const struct FRotator& curRotator)> OnComplete; // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x58];                                      // 0x00A0(0x0058)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UDBTweenPath* DOPath(const class FString& TweenName, const TArray<struct FVector>& Path, float DurTime, EaseType EaseType, bool IsLoop);
	static class UDBTweenPath* DOPathByCurve(const class FString& TweenName, const TArray<struct FVector>& Path, float DurTime, class UCurveFloat* Curve, bool IsLoop);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DBTweenPath")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DBTweenPath")
	}
	static class UDBTweenPath* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBTweenPath>();
	}
};
DUMPER7_ASSERTS_UDBTweenPath;

// Class DBTween.DBTweenFRotator
// 0x0048 (0x00B8 - 0x0070)
class UDBTweenFRotator final : public UDBTweenBase
{
public:
	TMulticastInlineDelegate<void(const struct FRotator& curValue)> OnFirst;                         // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FRotator& curValue)> OnUpdate;                        // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FRotator& curValue)> OnComplete;                      // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UDBTweenFRotator* DORotator(const class FString& TweenName, const struct FRotator& Start, const struct FRotator& End, float DurTime, EaseType EaseType, bool IsLoop);
	static class UDBTweenFRotator* DORotatorByCurve(const class FString& TweenName, const struct FRotator& Start, const struct FRotator& End, float DurTime, class UCurveFloat* Curve, bool IsLoop);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DBTweenFRotator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DBTweenFRotator")
	}
	static class UDBTweenFRotator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBTweenFRotator>();
	}
};
DUMPER7_ASSERTS_UDBTweenFRotator;

// Class DBTween.DBTweenUpdateManager
// 0x0050 (0x02F0 - 0x02A0)
class ADBTweenUpdateManager final : public AActor
{
public:
	TMap<class FString, class UDBTweenBase*>      DBTweenDic;                                        // 0x02A0(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DBTweenUpdateManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DBTweenUpdateManager")
	}
	static class ADBTweenUpdateManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADBTweenUpdateManager>();
	}
};
DUMPER7_ASSERTS_ADBTweenUpdateManager;

// Class DBTween.DBTweenUtil
// 0x0000 (0x0028 - 0x0028)
class UDBTweenUtil final : public UBlueprintFunctionLibrary
{
public:
	static class UDBTweenColor* DOColorByCurveSync(const class FString& TweenName, float DurTime, const struct FLinearColor& Start, const struct FLinearColor& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenColor* DOColorSync(const class FString& TweenName, float DurTime, const struct FLinearColor& Start, const struct FLinearColor& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenFloat* DOFloatByCurveSync(const class FString& TweenName, float DurTime, float Start, float End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenFloat* DOFloatSync(const class FString& TweenName, float DurTime, float Start, float End, EaseType EaseType, bool IsLoop);
	static class UDBTweenActor* DOLocalMoveByCurveSync(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FVector& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenActor* DOLocalMoveSync(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FVector& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenActor* DOLocalRotationByCurveSync(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FRotator& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenActor* DOLocalRotationSync(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FRotator& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenActor* DOLocalScaleByCurveSync(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FVector& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenActor* DOLocalScaleSync(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FVector& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenActor* DOMoveByCurveSync(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FVector& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenActor* DOMoveSync(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FVector& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenPath* DOPathByCurveSync(const class FString& TweenName, const TArray<struct FVector>& Path, float DurTime, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenPath* DOPathSync(const class FString& TweenName, const TArray<struct FVector>& Path, float DurTime, EaseType EaseType, bool IsLoop);
	static class UDBTweenActor* DORotationByCurveSync(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FRotator& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenActor* DORotationSync(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FRotator& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenActor* DOScaleByCurveSync(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FVector& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenActor* DOScaleSync(const class FString& TweenName, float DurTime, class AActor* Actor, const struct FVector& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenVector2D* DOVector2DByCurveSync(const class FString& TweenName, float DurTime, const struct FVector2D& Start, const struct FVector2D& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenVector2D* DOVector2DSync(const class FString& TweenName, float DurTime, const struct FVector2D& Start, const struct FVector2D& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenVector3D* DOVector3DByCurveSync(const class FString& TweenName, float DurTime, const struct FVector& Start, const struct FVector& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenVector3D* DOVector3DSync(const class FString& TweenName, float DurTime, const struct FVector& Start, const struct FVector& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenVector4D* DOVector4DByCurveSync(const class FString& TweenName, const struct FVector4& Start, const struct FVector4& End, float DurTime, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenVector4D* DOVector4DSync(const class FString& TweenName, const struct FVector4& Start, const struct FVector4& End, float DurTime, EaseType EaseType, bool IsLoop);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DBTweenUtil")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DBTweenUtil")
	}
	static class UDBTweenUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBTweenUtil>();
	}
};
DUMPER7_ASSERTS_UDBTweenUtil;

// Class DBTween.DBTweenUtil2
// 0x0000 (0x0028 - 0x0028)
class UDBTweenUtil2 final : public UBlueprintFunctionLibrary
{
public:
	static class UDBTweenWidget* DOFadeByCurveSync(const class FString& TweenName, float DurTime, class UWidget* UI, float End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenWidget* DOFadeSync(const class FString& TweenName, float DurTime, class UWidget* UI, float End, EaseType EaseType, bool IsLoop);
	static class UDBTweenWidget* DOLocalAngleByCurveSync(const class FString& TweenName, float DurTime, class UWidget* UI, float End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenWidget* DOLocalAngleSync(const class FString& TweenName, float DurTime, class UWidget* UI, float End, EaseType EaseType, bool IsLoop);
	static class UDBTweenWidget* DOLocalMoveByCurveSync(const class FString& TweenName, float DurTime, class UWidget* UI, const struct FVector2D& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenWidget* DOLocalMoveSync(const class FString& TweenName, float DurTime, class UWidget* UI, const struct FVector2D& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenWidget* DOLocalScaleByCurveSync(const class FString& TweenName, float DurTime, class UWidget* UI, const struct FVector2D& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenWidget* DOLocalScaleSync(const class FString& TweenName, float DurTime, class UWidget* UI, const struct FVector2D& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenCanvasPanelSlot* DOMoveByCurveSync(const class FString& TweenName, float DurTime, class UCanvasPanelSlot* CanvasPanelSlot, const struct FVector2D& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenCanvasPanelSlot* DOMoveSync(const class FString& TweenName, float DurTime, class UCanvasPanelSlot* CanvasPanelSlot, const struct FVector2D& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenCanvasPanelSlot* DOSizeByCurveSync(const class FString& TweenName, float DurTime, class UCanvasPanelSlot* CanvasPanelSlot, const struct FVector2D& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenCanvasPanelSlot* DOSizeSync(const class FString& TweenName, float DurTime, class UCanvasPanelSlot* CanvasPanelSlot, const struct FVector2D& End, EaseType EaseType, bool IsLoop);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DBTweenUtil2")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DBTweenUtil2")
	}
	static class UDBTweenUtil2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBTweenUtil2>();
	}
};
DUMPER7_ASSERTS_UDBTweenUtil2;

// Class DBTween.DBTweenVector2D
// 0x0040 (0x00B0 - 0x0070)
class UDBTweenVector2D final : public UDBTweenBase
{
public:
	TMulticastInlineDelegate<void(const struct FVector2D& curValue)> OnFirst;                        // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FVector2D& curValue)> OnUpdate;                       // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FVector2D& curValue)> OnComplete;                     // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UDBTweenVector2D* DOVector2D(const class FString& TweenName, float DurTime, const struct FVector2D& Start, const struct FVector2D& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenVector2D* DOVector2DByCurve(const class FString& TweenName, float DurTime, const struct FVector2D& Start, const struct FVector2D& End, class UCurveFloat* Curve, bool IsLoop);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DBTweenVector2D")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DBTweenVector2D")
	}
	static class UDBTweenVector2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBTweenVector2D>();
	}
};
DUMPER7_ASSERTS_UDBTweenVector2D;

// Class DBTween.DBTweenVector3D
// 0x0048 (0x00B8 - 0x0070)
class UDBTweenVector3D final : public UDBTweenBase
{
public:
	TMulticastInlineDelegate<void(const struct FVector& curValue)> OnFirst;                          // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FVector& curValue)> OnUpdate;                         // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FVector& curValue)> OnComplete;                       // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UDBTweenVector3D* DOVector3D(const class FString& TweenName, float DurTime, const struct FVector& Start, const struct FVector& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenVector3D* DOVector3DByCurve(const class FString& TweenName, float DurTime, const struct FVector& Start, const struct FVector& End, class UCurveFloat* Curve, bool IsLoop);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DBTweenVector3D")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DBTweenVector3D")
	}
	static class UDBTweenVector3D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBTweenVector3D>();
	}
};
DUMPER7_ASSERTS_UDBTweenVector3D;

// Class DBTween.DBTweenVector4D
// 0x0050 (0x00C0 - 0x0070)
class alignas(0x10) UDBTweenVector4D final : public UDBTweenBase
{
public:
	TMulticastInlineDelegate<void(const struct FVector4& curValue)> OnFirst;                         // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FVector4& curValue)> OnUpdate;                        // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FVector4& curValue)> OnComplete;                      // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x20];                                      // 0x00A0(0x0020)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UDBTweenVector4D* DOVector4D(const class FString& TweenName, const struct FVector4& Start, const struct FVector4& End, float DurTime, EaseType EaseType, bool IsLoop);
	static class UDBTweenVector4D* DOVector4DByCurve(const class FString& TweenName, const struct FVector4& Start, const struct FVector4& End, float DurTime, class UCurveFloat* Curve, bool IsLoop);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DBTweenVector4D")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DBTweenVector4D")
	}
	static class UDBTweenVector4D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBTweenVector4D>();
	}
};
DUMPER7_ASSERTS_UDBTweenVector4D;

// Class DBTween.DBTweenWidget
// 0x0070 (0x00E0 - 0x0070)
class UDBTweenWidget final : public UDBTweenBase
{
public:
	TMulticastInlineDelegate<void()>              OnFirst;                                           // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnUpdate;                                          // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnComplete;                                        // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x40];                                      // 0x00A0(0x0040)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UDBTweenWidget* DOFade(const class FString& TweenName, float DurTime, class UWidget* UI, float End, EaseType EaseType, bool IsLoop);
	static class UDBTweenWidget* DOFadeByCurve(const class FString& TweenName, float DurTime, class UWidget* UI, float End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenWidget* DOLocalAngle(const class FString& TweenName, float DurTime, class UWidget* UI, float End, EaseType EaseType, bool IsLoop);
	static class UDBTweenWidget* DOLocalAngleByCurve(const class FString& TweenName, float DurTime, class UWidget* UI, float End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenWidget* DOLocalMove(const class FString& TweenName, float DurTime, class UWidget* UI, const struct FVector2D& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenWidget* DOLocalMoveByCurve(const class FString& TweenName, float DurTime, class UWidget* UI, const struct FVector2D& End, class UCurveFloat* Curve, bool IsLoop);
	static class UDBTweenWidget* DOLocalScale(const class FString& TweenName, float DurTime, class UWidget* UI, const struct FVector2D& End, EaseType EaseType, bool IsLoop);
	static class UDBTweenWidget* DOLocalScaleByCurve(const class FString& TweenName, float DurTime, class UWidget* UI, const struct FVector2D& End, class UCurveFloat* Curve, bool IsLoop);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DBTweenWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DBTweenWidget")
	}
	static class UDBTweenWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDBTweenWidget>();
	}
};
DUMPER7_ASSERTS_UDBTweenWidget;

}

