#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DungeonExitInfo

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct DungeonExitInfo.DungeonExitInfo
// 0x0010 (0x0010 - 0x0000)
struct FDungeonExitInfo final
{
public:
	bool                                          bShowExitCountdownToast_1_2BF728D04EAEA51A93E2BAB641432964; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartExitCountdownTime_11_E81133014C025E54E62C16A63F3B316C; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WaitingPlayerNum_9_259F8691453D3C01AEA9B198758C9298; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalPlayerNum_10_09F17C464859EA1C53D5DA8AB15EA586; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FDungeonExitInfo;

}

