#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicAtlas

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DynamicAtlas_structs.hpp"


namespace SDK
{

// Class DynamicAtlas.AsyncLoadSimpleTextureTask
// 0x0058 (0x0080 - 0x0028)
class UAsyncLoadSimpleTextureTask final : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             SimpleTexture;                                     // 0x0078(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncLoadSimpleTextureTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncLoadSimpleTextureTask")
	}
	static class UAsyncLoadSimpleTextureTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncLoadSimpleTextureTask>();
	}
};
DUMPER7_ASSERTS_UAsyncLoadSimpleTextureTask;

// Class DynamicAtlas.DynamicAtlas
// 0x0108 (0x0130 - 0x0028)
class UDynamicAtlas final : public UObject
{
public:
	class UTexture2D*                             DynamicAtlasTexture;                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_30[0x100];                                     // 0x0030(0x0100)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetAtlasFillRate();

	class UTexture2D* GetDynamicAtlasTexture() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicAtlas")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicAtlas")
	}
	static class UDynamicAtlas* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicAtlas>();
	}
};
DUMPER7_ASSERTS_UDynamicAtlas;

// Class DynamicAtlas.DynamicAtlasFactory
// 0x01C8 (0x01F0 - 0x0028)
class UDynamicAtlasFactory final : public UObject
{
public:
	uint8                                         Pad_28[0x68];                                      // 0x0028(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class UDynamicAtlasSprite*> KeySpriteMap;                                    // 0x0090(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class UDynamicAtlasSprite*, uint32>      SpriteRef;                                         // 0x00E0(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FString, class UAsyncLoadSimpleTextureTask*> KeyAsyncLoadTaskMap;                     // 0x0130(0x0050)(NativeAccessSpecifierPrivate)
	TArray<class UDynamicAtlas*>                  AllAtlas;                                          // 0x0180(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_190[0x60];                                     // 0x0190(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDynamicAtlasFactory* GetInstance();

	class UDynamicAtlasSpriteRef* AsyncCreateDynamicAtlasSprite(const struct FSoftObjectPath& SourcePath, const class FString& SpriteKey, const struct FCopyMergeTextureNeedInfo& TextureInfo, const class FString& AtlasGroupKey);
	bool CanCreateSpriteByTexture(class UTexture2D* Texture);
	class UDynamicAtlasSpriteRef* CreateDynamicAtlasSprite(class UTexture2D* SpriteTexture, const class FString& SpriteKey, const class FString& AtlasGroupKey);
	class UDynamicAtlasSpriteRef* FindDynamicAtlasSprite(const class FString& SpriteKey);
	float GetAllAtlasFillRate();
	bool GetAsyncLoadSprite();
	void SetAsyncLoadSprite(bool bAsyncLoad);

	TArray<class UDynamicAtlas*> GetAllAtlas() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicAtlasFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicAtlasFactory")
	}
	static class UDynamicAtlasFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicAtlasFactory>();
	}
};
DUMPER7_ASSERTS_UDynamicAtlasFactory;

// Class DynamicAtlas.DynamicAtlasSprite
// 0x0048 (0x0070 - 0x0028)
class UDynamicAtlasSprite final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             SourceTexture;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x38];                                      // 0x0038(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicAtlasSprite")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicAtlasSprite")
	}
	static class UDynamicAtlasSprite* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicAtlasSprite>();
	}
};
DUMPER7_ASSERTS_UDynamicAtlasSprite;

// Class DynamicAtlas.DynamicAtlasSpriteRef
// 0x0018 (0x0040 - 0x0028)
class UDynamicAtlasSpriteRef final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicAtlasSpriteRef")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicAtlasSpriteRef")
	}
	static class UDynamicAtlasSpriteRef* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicAtlasSpriteRef>();
	}
};
DUMPER7_ASSERTS_UDynamicAtlasSpriteRef;

// Class DynamicAtlas.DynamicAtlasSpriteWrapper
// 0x00F0 (0x0118 - 0x0028)
class UDynamicAtlasSpriteWrapper final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        SourceTexturePath;                                 // 0x0030(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCopyMergeTextureNeedInfo>      CachedSourceTextureCookedInfo;                     // 0x0050(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_60[0xB8];                                      // 0x0060(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicAtlasSpriteWrapper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicAtlasSpriteWrapper")
	}
	static class UDynamicAtlasSpriteWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicAtlasSpriteWrapper>();
	}
};
DUMPER7_ASSERTS_UDynamicAtlasSpriteWrapper;

}

