#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicAtlas

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DynamicAtlas_structs.hpp"


namespace SDK::Params
{

// Function DynamicAtlas.DynamicAtlas.GetAtlasFillRate
// 0x0004 (0x0004 - 0x0000)
struct DynamicAtlas_GetAtlasFillRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DynamicAtlas_GetAtlasFillRate;

// Function DynamicAtlas.DynamicAtlas.GetDynamicAtlasTexture
// 0x0008 (0x0008 - 0x0000)
struct DynamicAtlas_GetDynamicAtlasTexture final
{
public:
	class UTexture2D*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DynamicAtlas_GetDynamicAtlasTexture;

// Function DynamicAtlas.DynamicAtlasFactory.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct DynamicAtlasFactory_GetInstance final
{
public:
	class UDynamicAtlasFactory*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DynamicAtlasFactory_GetInstance;

// Function DynamicAtlas.DynamicAtlasFactory.AsyncCreateDynamicAtlasSprite
// 0x0050 (0x0050 - 0x0000)
struct DynamicAtlasFactory_AsyncCreateDynamicAtlasSprite final
{
public:
	struct FSoftObjectPath                        SourcePath;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SpriteKey;                                         // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCopyMergeTextureNeedInfo              TextureInfo;                                       // 0x0028(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AtlasGroupKey;                                     // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicAtlasSpriteRef*                 ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DynamicAtlasFactory_AsyncCreateDynamicAtlasSprite;

// Function DynamicAtlas.DynamicAtlasFactory.CanCreateSpriteByTexture
// 0x0010 (0x0010 - 0x0000)
struct DynamicAtlasFactory_CanCreateSpriteByTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DynamicAtlasFactory_CanCreateSpriteByTexture;

// Function DynamicAtlas.DynamicAtlasFactory.CreateDynamicAtlasSprite
// 0x0030 (0x0030 - 0x0000)
struct DynamicAtlasFactory_CreateDynamicAtlasSprite final
{
public:
	class UTexture2D*                             SpriteTexture;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SpriteKey;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AtlasGroupKey;                                     // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicAtlasSpriteRef*                 ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DynamicAtlasFactory_CreateDynamicAtlasSprite;

// Function DynamicAtlas.DynamicAtlasFactory.FindDynamicAtlasSprite
// 0x0018 (0x0018 - 0x0000)
struct DynamicAtlasFactory_FindDynamicAtlasSprite final
{
public:
	class FString                                 SpriteKey;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicAtlasSpriteRef*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DynamicAtlasFactory_FindDynamicAtlasSprite;

// Function DynamicAtlas.DynamicAtlasFactory.GetAllAtlasFillRate
// 0x0004 (0x0004 - 0x0000)
struct DynamicAtlasFactory_GetAllAtlasFillRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DynamicAtlasFactory_GetAllAtlasFillRate;

// Function DynamicAtlas.DynamicAtlasFactory.GetAsyncLoadSprite
// 0x0001 (0x0001 - 0x0000)
struct DynamicAtlasFactory_GetAsyncLoadSprite final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DynamicAtlasFactory_GetAsyncLoadSprite;

// Function DynamicAtlas.DynamicAtlasFactory.SetAsyncLoadSprite
// 0x0001 (0x0001 - 0x0000)
struct DynamicAtlasFactory_SetAsyncLoadSprite final
{
public:
	bool                                          bAsyncLoad;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DynamicAtlasFactory_SetAsyncLoadSprite;

// Function DynamicAtlas.DynamicAtlasFactory.GetAllAtlas
// 0x0010 (0x0010 - 0x0000)
struct DynamicAtlasFactory_GetAllAtlas final
{
public:
	TArray<class UDynamicAtlas*>                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DynamicAtlasFactory_GetAllAtlas;

}

