#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: EffectFunctionComponent

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EffectFunctionComponent.EffectFunctionComponent_C
// 0x0050 (0x0100 - 0x00B0)
class UEffectFunctionComponent_C final : public UActorComponent
{
public:
	TScriptInterface<class IEffectSourceInterface> Source;                                           // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         EffectId;                                          // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Radius;                                            // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num;                                               // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 Tag;                                               // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         X;                                                 // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Y;                                                 // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z;                                                 // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChooseNum;                                         // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SPTargetTag;                                       // 0x00F4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxNum;                                            // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Mon_AnimHeiBiAn_Skill03Blade();
	void Mon_RandomChoosePlayersRepeatableToSPT();
	void Mon_BossLiecheHand_Skill02Bullet();
	void Mon_BossJushi_Skill08Bullet();
	void Mon_BossJushi_Skill04HeadBullet();
	void Mon_BossShenpan_Skill03BulletLoc();
	void Mon_BossKuxiu_Skill05BulletLoc2();
	void Mon_BossKuxiu_Skill05BulletLoc();
	void Mon_BossKuxiu_Skill03BulletLoc();
	void LizhanTargetLocation_Skill05();
	void SelfLocation();
	void Specificlocation();
	void RandomAreaLocation_Shijingzhe();
	void RelativeLocationToTarget();
	void GetHitNum();
	void SaveLocAtStaticCreator();
	void SaveLoc();
	void RandomAreaLocation();
	void ExecuteFunction(TScriptInterface<class IEffectSourceInterface> Source_0, int32 EffectId_0);
	void RandomLocation();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("EffectFunctionComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EffectFunctionComponent_C")
	}
	static class UEffectFunctionComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEffectFunctionComponent_C>();
	}
};
DUMPER7_ASSERTS_UEffectFunctionComponent_C;

}

