#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: EMLipSync

#include "Basic.hpp"

#include "EMLipSync_structs.hpp"


namespace SDK::Params
{

// Function EMLipSync.EMLipSyncBakedData.BakeRange
// 0x0008 (0x0008 - 0x0000)
struct EMLipSyncBakedData_BakeRange final
{
public:
	float                                         InStartTime;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InEndTime;                                         // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncBakedData_BakeRange;

// Function EMLipSync.EMLipSyncBakedData.GetEmptyFrameInfo
// 0x0058 (0x0058 - 0x0000)
struct EMLipSyncBakedData_GetEmptyFrameInfo final
{
public:
	struct FEMLipSyncInfo                         OutLipSyncInfo;                                    // 0x0000(0x0058)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncBakedData_GetEmptyFrameInfo;

// Function EMLipSync.EMLipSyncBakedData.GetFrameInfo
// 0x0068 (0x0068 - 0x0000)
struct EMLipSyncBakedData_GetFrameInfo final
{
public:
	float                                         InTime;                                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FEMLipSyncInfo                         OutLipSyncInfo;                                    // 0x0008(0x0058)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-DNA ])
};
DUMPER7_ASSERTS_EMLipSyncBakedData_GetFrameInfo;

// Function EMLipSync.EMLipSyncBakedData.GetFrameInfoByPercent
// 0x0068 (0x0068 - 0x0000)
struct EMLipSyncBakedData_GetFrameInfoByPercent final
{
public:
	float                                         InPercent;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FEMLipSyncInfo                         OutLipSyncInfo;                                    // 0x0008(0x0058)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-DNA ])
};
DUMPER7_ASSERTS_EMLipSyncBakedData_GetFrameInfoByPercent;

// Function EMLipSync.EMLipSyncBakedData.GetFrameInfos
// 0x0010 (0x0010 - 0x0000)
struct EMLipSyncBakedData_GetFrameInfos final
{
public:
	TArray<struct FEMLipSyncInfo>                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncBakedData_GetFrameInfos;

// Function EMLipSync.EMLipSyncBakedData.IsEqual
// 0x0010 (0x0010 - 0x0000)
struct EMLipSyncBakedData_IsEqual final
{
public:
	class UEMLipSyncBakedData*                    Other;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-DNA ])
};
DUMPER7_ASSERTS_EMLipSyncBakedData_IsEqual;

// Function EMLipSync.EMLipSyncBakedData.SetFrameInfos
// 0x0010 (0x0010 - 0x0000)
struct EMLipSyncBakedData_SetFrameInfos final
{
public:
	TArray<struct FEMLipSyncInfo>                 NewFrameInfos;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncBakedData_SetFrameInfos;

// Function EMLipSync.EMLipSyncBakedData.SetProfileData
// 0x0008 (0x0008 - 0x0000)
struct EMLipSyncBakedData_SetProfileData final
{
public:
	class UEMLipSyncProfileData*                  NewProfileData;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncBakedData_SetProfileData;

// Function EMLipSync.EMLipSyncBakedData.SetSoundWave
// 0x0008 (0x0008 - 0x0000)
struct EMLipSyncBakedData_SetSoundWave final
{
public:
	class USoundWave*                             NewSoundWave;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncBakedData_SetSoundWave;

// Function EMLipSync.EMLipSyncBakedData.SetTimeOffset
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncBakedData_SetTimeOffset final
{
public:
	float                                         NewTimeOffset;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncBakedData_SetTimeOffset;

// Function EMLipSync.EMLipSyncBakedData.GetProfileData
// 0x0008 (0x0008 - 0x0000)
struct EMLipSyncBakedData_GetProfileData final
{
public:
	class UEMLipSyncProfileData*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncBakedData_GetProfileData;

// Function EMLipSync.EMLipSyncBakedData.GetSoundWave
// 0x0008 (0x0008 - 0x0000)
struct EMLipSyncBakedData_GetSoundWave final
{
public:
	class USoundWave*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncBakedData_GetSoundWave;

// Function EMLipSync.EMLipSyncBakedData.GetTimeOffset
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncBakedData_GetTimeOffset final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncBakedData_GetTimeOffset;

// Function EMLipSync.EMLipSyncCalculator.CalcLipSync
// 0x0078 (0x0078 - 0x0000)
struct EMLipSyncCalculator_CalcLipSync final
{
public:
	TArray<float>                                 InSamples;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 OutMFCC;                                           // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FEMLipSyncInfo                         OutLipSyncInfo;                                    // 0x0020(0x0058)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncCalculator_CalcLipSync;

// Function EMLipSync.EMLipSyncCalculator.CalcMFCC
// 0x0020 (0x0020 - 0x0000)
struct EMLipSyncCalculator_CalcMFCC final
{
public:
	TArray<float>                                 InSamples;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 OutMFCC;                                           // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncCalculator_CalcMFCC;

// Function EMLipSync.EMLipSyncCalculator.ReceiveSamples
// 0x0010 (0x0010 - 0x0000)
struct EMLipSyncCalculator_ReceiveSamples final
{
public:
	TArray<float>                                 InSamples;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncCalculator_ReceiveSamples;

// Function EMLipSync.EMLipSyncCalculator.StartCalculateMFCC
// 0x0010 (0x0010 - 0x0000)
struct EMLipSyncCalculator_StartCalculateMFCC final
{
public:
	class UEMLipSyncProfileData*                  InProfileData;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InSampleRate;                                      // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InChannelNum;                                      // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncCalculator_StartCalculateMFCC;

// Function EMLipSync.EMLipSyncCalculator.CalcMFCCInternal
// 0x0010 (0x0010 - 0x0000)
struct EMLipSyncCalculator_CalcMFCCInternal final
{
public:
	TArray<float>                                 OutMFCC;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncCalculator_CalcMFCCInternal;

// Function EMLipSync.EMLipSyncCalculator.CalcPhonemeRatiosInternal
// 0x0068 (0x0068 - 0x0000)
struct EMLipSyncCalculator_CalcPhonemeRatiosInternal final
{
public:
	TArray<float>                                 InMFCC;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEMLipSyncInfo                         OutLipSyncInfo;                                    // 0x0010(0x0058)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncCalculator_CalcPhonemeRatiosInternal;

// Function EMLipSync.EMLipSyncCalculator.CalcVolumeInternal
// 0x0058 (0x0058 - 0x0000)
struct EMLipSyncCalculator_CalcVolumeInternal final
{
public:
	struct FEMLipSyncInfo                         OutLipSyncInfo;                                    // 0x0000(0x0058)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncCalculator_CalcVolumeInternal;

// Function EMLipSync.EMLipSyncComponent.GetBlendInfos
// 0x0010 (0x0010 - 0x0000)
struct EMLipSyncComponent_GetBlendInfos final
{
public:
	TArray<struct FEMLipSyncBlendInfo>            ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncComponent_GetBlendInfos;

// Function EMLipSync.EMLipSyncComponent.SetBakedData
// 0x0008 (0x0008 - 0x0000)
struct EMLipSyncComponent_SetBakedData final
{
public:
	class UEMLipSyncBakedData*                    InBakedData;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncComponent_SetBakedData;

// Function EMLipSync.EMLipSyncComponent.SetBlendInfos
// 0x0010 (0x0010 - 0x0000)
struct EMLipSyncComponent_SetBlendInfos final
{
public:
	TArray<struct FEMLipSyncBlendInfo>            NewBlendInfos;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncComponent_SetBlendInfos;

// Function EMLipSync.EMLipSyncComponent.SetSmoothness
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncComponent_SetSmoothness final
{
public:
	float                                         NewSmoothness;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncComponent_SetSmoothness;

// Function EMLipSync.EMLipSyncComponent.GetBakedData
// 0x0008 (0x0008 - 0x0000)
struct EMLipSyncComponent_GetBakedData final
{
public:
	class UEMLipSyncBakedData*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncComponent_GetBakedData;

// Function EMLipSync.EMLipSyncComponent.GetSmoothness
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncComponent_GetSmoothness final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncComponent_GetSmoothness;

// Function EMLipSync.EMLipSyncProfileData.GetMFCCInfos
// 0x0010 (0x0010 - 0x0000)
struct EMLipSyncProfileData_GetMFCCInfos final
{
public:
	TArray<struct FEM_PhonemeLipSyncMFCCInfo>     ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_GetMFCCInfos;

// Function EMLipSync.EMLipSyncProfileData.SetFrameRate
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncProfileData_SetFrameRate final
{
public:
	float                                         NewFrameRate;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_SetFrameRate;

// Function EMLipSync.EMLipSyncProfileData.SetMelSpectrumNum
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncProfileData_SetMelSpectrumNum final
{
public:
	float                                         NewMelSpectrumNum;                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_SetMelSpectrumNum;

// Function EMLipSync.EMLipSyncProfileData.SetMFCCInfos
// 0x0010 (0x0010 - 0x0000)
struct EMLipSyncProfileData_SetMFCCInfos final
{
public:
	TArray<struct FEM_PhonemeLipSyncMFCCInfo>     NewMFCCInfos;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_SetMFCCInfos;

// Function EMLipSync.EMLipSyncProfileData.SetMFCCMaxSize
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncProfileData_SetMFCCMaxSize final
{
public:
	float                                         NewMFCCMaxSize;                                    // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_SetMFCCMaxSize;

// Function EMLipSync.EMLipSyncProfileData.SetPreEmphasisCoefficient
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncProfileData_SetPreEmphasisCoefficient final
{
public:
	float                                         NewPreEmphasisCoefficient;                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_SetPreEmphasisCoefficient;

// Function EMLipSync.EMLipSyncProfileData.SetTargetFrameSampleNum
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncProfileData_SetTargetFrameSampleNum final
{
public:
	float                                         NewTargetFrameSampleNum;                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_SetTargetFrameSampleNum;

// Function EMLipSync.EMLipSyncProfileData.SetTargetSampleRate
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncProfileData_SetTargetSampleRate final
{
public:
	float                                         NewTargetSampleRate;                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_SetTargetSampleRate;

// Function EMLipSync.EMLipSyncProfileData.SetVolumeFilterMax
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncProfileData_SetVolumeFilterMax final
{
public:
	float                                         NewVolumeFilterMax;                                // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_SetVolumeFilterMax;

// Function EMLipSync.EMLipSyncProfileData.SetVolumeFilterMin
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncProfileData_SetVolumeFilterMin final
{
public:
	float                                         NewVolumeFilterMin;                                // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_SetVolumeFilterMin;

// Function EMLipSync.EMLipSyncProfileData.GetFrameRate
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncProfileData_GetFrameRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_GetFrameRate;

// Function EMLipSync.EMLipSyncProfileData.GetMelSpectrumNum
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncProfileData_GetMelSpectrumNum final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_GetMelSpectrumNum;

// Function EMLipSync.EMLipSyncProfileData.GetMFCCMaxSize
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncProfileData_GetMFCCMaxSize final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_GetMFCCMaxSize;

// Function EMLipSync.EMLipSyncProfileData.GetPreEmphasisCoefficient
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncProfileData_GetPreEmphasisCoefficient final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_GetPreEmphasisCoefficient;

// Function EMLipSync.EMLipSyncProfileData.GetTargetFrameSampleNum
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncProfileData_GetTargetFrameSampleNum final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_GetTargetFrameSampleNum;

// Function EMLipSync.EMLipSyncProfileData.GetTargetSampleRate
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncProfileData_GetTargetSampleRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_GetTargetSampleRate;

// Function EMLipSync.EMLipSyncProfileData.GetVolumeFilterMax
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncProfileData_GetVolumeFilterMax final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_GetVolumeFilterMax;

// Function EMLipSync.EMLipSyncProfileData.GetVolumeFilterMin
// 0x0004 (0x0004 - 0x0000)
struct EMLipSyncProfileData_GetVolumeFilterMin final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMLipSyncProfileData_GetVolumeFilterMin;

// Function EMLipSync.EMSoundWaveProxy.GetFrameSample
// 0x0018 (0x0018 - 0x0000)
struct EMSoundWaveProxy_GetFrameSample final
{
public:
	int64                                         InFrameIndex;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 OutFrameSample;                                    // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSoundWaveProxy_GetFrameSample;

// Function EMLipSync.EMSoundWaveProxy.Init
// 0x0010 (0x0010 - 0x0000)
struct EMSoundWaveProxy_Init final
{
public:
	class USoundWave*                             SoundWave;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         InFrameRate;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSoundWaveProxy_Init;

// Function EMLipSync.EMSoundWaveProxy.SetChannelNum
// 0x0004 (0x0004 - 0x0000)
struct EMSoundWaveProxy_SetChannelNum final
{
public:
	float                                         InChannelNum;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSoundWaveProxy_SetChannelNum;

// Function EMLipSync.EMSoundWaveProxy.SetFrameRate
// 0x0008 (0x0008 - 0x0000)
struct EMSoundWaveProxy_SetFrameRate final
{
public:
	int64                                         InFrameRate;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSoundWaveProxy_SetFrameRate;

// Function EMLipSync.EMSoundWaveProxy.GetChannelNum
// 0x0004 (0x0004 - 0x0000)
struct EMSoundWaveProxy_GetChannelNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSoundWaveProxy_GetChannelNum;

// Function EMLipSync.EMSoundWaveProxy.GetDuration
// 0x0004 (0x0004 - 0x0000)
struct EMSoundWaveProxy_GetDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSoundWaveProxy_GetDuration;

// Function EMLipSync.EMSoundWaveProxy.GetFrameIndex
// 0x0008 (0x0008 - 0x0000)
struct EMSoundWaveProxy_GetFrameIndex final
{
public:
	float                                         InTime;                                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSoundWaveProxy_GetFrameIndex;

// Function EMLipSync.EMSoundWaveProxy.GetFrameRate
// 0x0004 (0x0004 - 0x0000)
struct EMSoundWaveProxy_GetFrameRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSoundWaveProxy_GetFrameRate;

// Function EMLipSync.EMSoundWaveProxy.GetFrameSampleNum
// 0x0008 (0x0008 - 0x0000)
struct EMSoundWaveProxy_GetFrameSampleNum final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSoundWaveProxy_GetFrameSampleNum;

// Function EMLipSync.EMSoundWaveProxy.GetSampleRate
// 0x0004 (0x0004 - 0x0000)
struct EMSoundWaveProxy_GetSampleRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSoundWaveProxy_GetSampleRate;

}

