#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: EMLipSync

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "EMLipSync_structs.hpp"


namespace SDK
{

// Class EMLipSync.EMArrayFunctions
// 0x0000 (0x0028 - 0x0028)
class UEMArrayFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMArrayFunctions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMArrayFunctions")
	}
	static class UEMArrayFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMArrayFunctions>();
	}
};
DUMPER7_ASSERTS_UEMArrayFunctions;

// Class EMLipSync.EMCurveVectorFunctions
// 0x0000 (0x0028 - 0x0028)
class UEMCurveVectorFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMCurveVectorFunctions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMCurveVectorFunctions")
	}
	static class UEMCurveVectorFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMCurveVectorFunctions>();
	}
};
DUMPER7_ASSERTS_UEMCurveVectorFunctions;

// Class EMLipSync.EMLipSyncBakedData
// 0x0028 (0x0050 - 0x0028)
class UEMLipSyncBakedData final : public UObject
{
public:
	class UEMLipSyncProfileData*                  ProfileData;                                       // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundWave*                             SoundWave;                                         // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TimeOffset;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<struct FEMLipSyncInfo>                 FrameInfos;                                        // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)

public:
	void Bake();
	void BakeRange(const float InStartTime, const float InEndTime);
	void GetEmptyFrameInfo(struct FEMLipSyncInfo* OutLipSyncInfo);
	bool GetFrameInfo(const float InTime, struct FEMLipSyncInfo* OutLipSyncInfo);
	bool GetFrameInfoByPercent(const float InPercent, struct FEMLipSyncInfo* OutLipSyncInfo);
	const TArray<struct FEMLipSyncInfo> GetFrameInfos();
	bool IsEqual(class UEMLipSyncBakedData* Other);
	void SetFrameInfos(const TArray<struct FEMLipSyncInfo>& NewFrameInfos);
	void SetProfileData(class UEMLipSyncProfileData* NewProfileData);
	void SetSoundWave(class USoundWave* NewSoundWave);
	void SetTimeOffset(const float NewTimeOffset);

	class UEMLipSyncProfileData* GetProfileData() const;
	class USoundWave* GetSoundWave() const;
	float GetTimeOffset() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMLipSyncBakedData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMLipSyncBakedData")
	}
	static class UEMLipSyncBakedData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMLipSyncBakedData>();
	}
};
DUMPER7_ASSERTS_UEMLipSyncBakedData;

// Class EMLipSync.EMLipSyncCalculator
// 0x0028 (0x0050 - 0x0028)
class UEMLipSyncCalculator final : public UObject
{
public:
	class UEMLipSyncProfileData*                  ProfileData;                                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ChannelNum;                                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         DownSampleStep;                                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CacheSampleIndex;                                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<float>                                 CacheSamples;                                      // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void CalcLipSync(const TArray<float>& InSamples, TArray<float>* OutMFCC, struct FEMLipSyncInfo* OutLipSyncInfo);
	void CalcMFCC(const TArray<float>& InSamples, TArray<float>* OutMFCC);
	void EndCalculateMFCC();
	void ReceiveSamples(const TArray<float>& InSamples);
	void ResetCacheSamples();
	void StartCalculateMFCC(class UEMLipSyncProfileData* InProfileData, const float InSampleRate, const int32 InChannelNum);

	void CalcMFCCInternal(TArray<float>* OutMFCC) const;
	void CalcPhonemeRatiosInternal(const TArray<float>& InMFCC, struct FEMLipSyncInfo* OutLipSyncInfo) const;
	void CalcVolumeInternal(struct FEMLipSyncInfo* OutLipSyncInfo) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMLipSyncCalculator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMLipSyncCalculator")
	}
	static class UEMLipSyncCalculator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMLipSyncCalculator>();
	}
};
DUMPER7_ASSERTS_UEMLipSyncCalculator;

// Class EMLipSync.EMLipSyncComponent
// 0x00A8 (0x0158 - 0x00B0)
class UEMLipSyncComponent final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(const float InVolumeWeight, const TArray<struct FEMLipSyncBlendInfo>& InBlendInfos)> OnBlendUpdate; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnBlendStop;                                       // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UEMLipSyncBakedData*                    BakedData;                                         // 0x00D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Smoothness;                                        // 0x00D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<struct FEMLipSyncBlendInfo>            BlendInfos;                                        // 0x00E0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	EEMLipSyncState                               CurrentState;                                      // 0x00F0(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	float                                         CurrentSeconds;                                    // 0x00F4(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FEMLipSyncInfo                         CurrentLipSyncInfo;                                // 0x00F8(0x0058)(Edit, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPrivate)
	float                                         CurrentVolumeRatio;                                // 0x0150(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentVolumeRatioVelocity;                        // 0x0154(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	const TArray<struct FEMLipSyncBlendInfo> GetBlendInfos();
	void SetBakedData(class UEMLipSyncBakedData* InBakedData);
	void SetBlendInfos(const TArray<struct FEMLipSyncBlendInfo>& NewBlendInfos);
	void SetSmoothness(const float NewSmoothness);
	void Start();
	void Stop();

	class UEMLipSyncBakedData* GetBakedData() const;
	float GetSmoothness() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMLipSyncComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMLipSyncComponent")
	}
	static class UEMLipSyncComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMLipSyncComponent>();
	}
};
DUMPER7_ASSERTS_UEMLipSyncComponent;

// Class EMLipSync.EMLipSyncProfileData
// 0x0030 (0x0058 - 0x0028)
class UEMLipSyncProfileData final : public UObject
{
public:
	float                                         VolumeFilterMin;                                   // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         VolumeFilterMax;                                   // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FrameRate;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TargetSampleRate;                                  // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         TargetFrameSampleNum;                              // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PreEmphasisCoefficient;                            // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MelSpectrumNum;                                    // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MFCCMaxSize;                                       // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FEM_PhonemeLipSyncMFCCInfo>     MFCCInfos;                                         // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	const TArray<struct FEM_PhonemeLipSyncMFCCInfo> GetMFCCInfos();
	void SetFrameRate(const float NewFrameRate);
	void SetMelSpectrumNum(const float NewMelSpectrumNum);
	void SetMFCCInfos(const TArray<struct FEM_PhonemeLipSyncMFCCInfo>& NewMFCCInfos);
	void SetMFCCMaxSize(const float NewMFCCMaxSize);
	void SetPreEmphasisCoefficient(const float NewPreEmphasisCoefficient);
	void SetTargetFrameSampleNum(const float NewTargetFrameSampleNum);
	void SetTargetSampleRate(const float NewTargetSampleRate);
	void SetVolumeFilterMax(const float NewVolumeFilterMax);
	void SetVolumeFilterMin(const float NewVolumeFilterMin);

	float GetFrameRate() const;
	float GetMelSpectrumNum() const;
	float GetMFCCMaxSize() const;
	float GetPreEmphasisCoefficient() const;
	float GetTargetFrameSampleNum() const;
	float GetTargetSampleRate() const;
	float GetVolumeFilterMax() const;
	float GetVolumeFilterMin() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMLipSyncProfileData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMLipSyncProfileData")
	}
	static class UEMLipSyncProfileData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMLipSyncProfileData>();
	}
};
DUMPER7_ASSERTS_UEMLipSyncProfileData;

// Class EMLipSync.EMLipSyncSoundWaveProfileData
// 0x0020 (0x0048 - 0x0028)
class UEMLipSyncSoundWaveProfileData final : public UObject
{
public:
	class USoundWave*                             SoundWave;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEMLipSyncProfileData*                  LipSyncProfileData;                                // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FEMLipSyncSoundWaveProfileInfo> SoundWaveProfileInfos;                             // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void FillLipSyncProfileDataMFCC();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMLipSyncSoundWaveProfileData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMLipSyncSoundWaveProfileData")
	}
	static class UEMLipSyncSoundWaveProfileData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMLipSyncSoundWaveProfileData>();
	}
};
DUMPER7_ASSERTS_UEMLipSyncSoundWaveProfileData;

// Class EMLipSync.EMMathFunctions
// 0x0000 (0x0028 - 0x0028)
class UEMMathFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMMathFunctions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMMathFunctions")
	}
	static class UEMMathFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMMathFunctions>();
	}
};
DUMPER7_ASSERTS_UEMMathFunctions;

// Class EMLipSync.EMSoundWaveFunctions
// 0x0000 (0x0028 - 0x0028)
class UEMSoundWaveFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMSoundWaveFunctions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMSoundWaveFunctions")
	}
	static class UEMSoundWaveFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMSoundWaveFunctions>();
	}
};
DUMPER7_ASSERTS_UEMSoundWaveFunctions;

// Class EMLipSync.EMSoundWaveProxy
// 0x0028 (0x0050 - 0x0028)
class UEMSoundWaveProxy final : public UObject
{
public:
	TArray<float>                                 Samples;                                           // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	int64                                         SampleRate;                                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ChannelNum;                                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	int64                                         FrameRate;                                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void GetFrameSample(const int64 InFrameIndex, TArray<float>* OutFrameSample);
	void Init(class USoundWave* SoundWave, const int64 InFrameRate);
	void SetChannelNum(const float InChannelNum);
	void SetFrameRate(const int64 InFrameRate);

	int32 GetChannelNum() const;
	float GetDuration() const;
	int32 GetFrameIndex(const float InTime) const;
	float GetFrameRate() const;
	int64 GetFrameSampleNum() const;
	float GetSampleRate() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMSoundWaveProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMSoundWaveProxy")
	}
	static class UEMSoundWaveProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMSoundWaveProxy>();
	}
};
DUMPER7_ASSERTS_UEMSoundWaveProxy;

}

