#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: EMLipSync

#include "Basic.hpp"


namespace SDK
{

// Enum EMLipSync.EEMLipSyncState
// NumValues: 0x0004
enum class EEMLipSyncState : uint8
{
	Running                                  = 0,
	PreStopped                               = 1,
	Stopped                                  = 2,
	EEMLipSyncState_MAX                      = 3,
};

// ScriptStruct EMLipSync.EMLipSyncBlendInfo
// 0x0014 (0x0014 - 0x0000)
struct FEMLipSyncBlendInfo final
{
public:
	class FName                                   PhonemeName;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EffectRate;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WeightVelocity;                                    // 0x0010(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FEMLipSyncBlendInfo;

// ScriptStruct EMLipSync.EMLipSyncInfo
// 0x0058 (0x0058 - 0x0000)
struct FEMLipSyncInfo final
{
public:
	float                                         VolumeRatio;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	TMap<class FName, float>                      PhonemeRatios;                                     // 0x0008(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FEMLipSyncInfo;

// ScriptStruct EMLipSync.EM_PhonemeLipSyncMFCCInfo
// 0x0018 (0x0018 - 0x0000)
struct FEM_PhonemeLipSyncMFCCInfo final
{
public:
	class FName                                   PhonemeName;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 MFCC;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FEM_PhonemeLipSyncMFCCInfo;

// ScriptStruct EMLipSync.EMLipSyncSoundWaveProfileInfo
// 0x0010 (0x0010 - 0x0000)
struct FEMLipSyncSoundWaveProfileInfo final
{
public:
	class FName                                   PhonemeName;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndTime;                                           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FEMLipSyncSoundWaveProfileInfo;

}

