#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: EMNiagaraFunctionLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function EMNiagaraFunctionLibrary.EMNiagaraFunctionLibrary_C.Set Niagara Tickable when Paused
// 0x0010 (0x0010 - 0x0000)
struct EMNiagaraFunctionLibrary_C_Set_Niagara_Tickable_when_Paused final
{
public:
	class UNiagaraComponent*                      Niagara;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EMNiagaraFunctionLibrary_C_Set_Niagara_Tickable_when_Paused;

// Function EMNiagaraFunctionLibrary.EMNiagaraFunctionLibrary_C.PlayChangeRoleEffect
// 0x0018 (0x0018 - 0x0000)
struct EMNiagaraFunctionLibrary_C_PlayChangeRoleEffect final
{
public:
	class ABP_PlayerCharacter_C*                  PlayerCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_PlayEffectByID_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EMNiagaraFunctionLibrary_C_PlayChangeRoleEffect;

}

