#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: EMSequencerTracks

#include "Basic.hpp"

#include "MovieScene_structs.hpp"


namespace SDK
{

// Enum EMSequencerTracks.ECustomSequencerTrackType
// NumValues: 0x0003
enum class ECustomSequencerTrackType : uint32
{
	MasterTrack                              = 0,
	ObjectTrack                              = 1,
	ECustomSequencerTrackType_MAX            = 2,
};

// ScriptStruct EMSequencerTracks.EMSequencerTemplate
// 0x0008 (0x0028 - 0x0020)
struct FEMSequencerTemplate final : public FMovieSceneEvalTemplate
{
public:
	class UEMSequencerSection*                    Section;                                           // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FEMSequencerTemplate;

// ScriptStruct EMSequencerTracks.EMSequencerCustomButtonParam
// 0x0070 (0x0070 - 0x0000)
struct alignas(0x10) FEMSequencerCustomButtonParam final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Size After Last Property [ Dumper-DNA ])
	class FName                                   BrushName;                                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x0048(0x0018)(NativeAccessSpecifierPublic)
	bool                                          RefreshEditor;                                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0xF];                                       // 0x0061(0x000F)(Fixing Struct Size After Last Property [ Dumper-DNA ])
};
DUMPER7_ASSERTS_FEMSequencerCustomButtonParam;

}

