#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EMSequencerTracks

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MovieScene_classes.hpp"
#include "MovieSceneTracks_structs.hpp"
#include "EMSequencerTracks_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class EMSequencerTracks.EMSequencerSection
// 0x0040 (0x0128 - 0x00E8)
class UEMSequencerSection : public UMovieSceneSection
{
public:
	class FText                                   SectionDisplayName;                                // 0x00E8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class UEMSequencerTrack*                      OwnerTrack;                                        // 0x0100(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQualifiedFrameTime                    SequencerFrameTime;                                // 0x0108(0x0010)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMovieSceneStringChannel>       Channels;                                          // 0x0118(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMSequencerSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMSequencerSection")
	}
	static class UEMSequencerSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMSequencerSection>();
	}
};
DUMPER7_ASSERTS_UEMSequencerSection;

// Class EMSequencerTracks.EMSequencerTrack
// 0x0140 (0x01D0 - 0x0090)
class UEMSequencerTrack : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSupportsMultipleRows;                             // 0x0098(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportsBlending;                                 // 0x0099(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	ECustomSequencerTrackType                     TrackType;                                         // 0x009C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 SupportedObjectType;                               // 0x00A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LimitSectionOnlyDefault;                           // 0x00A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Singleton;                                         // 0x00A9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA[0x26];                                      // 0x00AA(0x0026)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Icon;                                              // 0x00D0(0x00D0)(Edit, DisableEditOnInstance, AssetRegistrySearchable, NativeAccessSpecifierPublic)
	class FName                                   ButtonAddSectionName;                              // 0x01A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AddTrackType;                                      // 0x01A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AddTrackName;                                      // 0x01B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x01B8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UObject*                                BindingObject;                                     // 0x01C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMSequencerTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMSequencerTrack")
	}
	static class UEMSequencerTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMSequencerTrack>();
	}
};
DUMPER7_ASSERTS_UEMSequencerTrack;

// Class EMSequencerTracks.EMSequenceTrackSetting
// 0x0000 (0x0038 - 0x0038)
class UEMSequenceTrackSetting final : public UDeveloperSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMSequenceTrackSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMSequenceTrackSetting")
	}
	static class UEMSequenceTrackSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMSequenceTrackSetting>();
	}
};
DUMPER7_ASSERTS_UEMSequenceTrackSetting;

}

