#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: Explore_Chest

#include "Basic.hpp"


namespace SDK::Params
{

// Function Explore_Chest.Explore_Chest_C.ExecuteUbergraph_Explore_Chest
// 0x0030 (0x0030 - 0x0000)
struct Explore_Chest_C_ExecuteUbergraph_Explore_Chest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<class UStaticCreatorComponent*>        K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class ACombatItemBase*                        K2Node_ComponentBoundEvent_Mechanism;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_StateId;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_LeaveStateId;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Explore_Chest_C_ExecuteUbergraph_Explore_Chest;

// Function Explore_Chest.Explore_Chest_C.BndEvt__Common_Chest_Chest_K2Node_ComponentBoundEvent_0_OnMechanismStateChangeDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Explore_Chest_C_BndEvt__Common_Chest_Chest_K2Node_ComponentBoundEvent_0_OnMechanismStateChangeDelegate__DelegateSignature final
{
public:
	class ACombatItemBase*                        Mechanism;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StateId;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LeaveStateId;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Explore_Chest_C_BndEvt__Common_Chest_Chest_K2Node_ComponentBoundEvent_0_OnMechanismStateChangeDelegate__DelegateSignature;

}

