#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explore_Icelake_Pan01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Explore_Icelake_Pan01.Explore_Icelake_Pan01_C
// 0x0038 (0x03F8 - 0x03C0)
class AExplore_Icelake_Pan01_C final : public AExploreStaticCreator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_StaticCreatorComponent_C*           Pan4;                                              // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           Pan3;                                              // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           Pan2;                                              // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           Pan1;                                              // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         CloseNum;                                          // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TalkTriggerId;                                     // 0x03F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Explore_Icelake_Pan01_Pan4_K2Node_ComponentBoundEvent_6_OnMechanismStateChangeDelegate__DelegateSignature(class ACombatItemBase* Mechanism, int32 StateId, int32 LeaveStateId);
	void ExecuteUbergraph_Explore_Icelake_Pan01(int32 EntryPoint);
	void BndEvt__Explore_Fort01_Yahaha01_JiDian2_K2Node_ComponentBoundEvent_1_OnMechanismStateChangeDelegate__DelegateSignature(class ACombatItemBase* Mechanism, int32 StateId, int32 LeaveStateId);
	void ReceiveOnExploreGroupActive();
	void BndEvt__Common_Shooter_Chest_K2Node_ComponentBoundEvent_2_OnMechanismStateChangeDelegate__DelegateSignature(class ACombatItemBase* Mechanism, int32 StateId, int32 LeaveStateId);
	void OnPlayTalkEnd_A373917A4058D3B47B54E9A3611BCEF8();
	void OnPlayTalkInterrupted_A373917A4058D3B47B54E9A3611BCEF8();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Explore_Icelake_Pan01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Explore_Icelake_Pan01_C")
	}
	static class AExplore_Icelake_Pan01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AExplore_Icelake_Pan01_C>();
	}
};
DUMPER7_ASSERTS_AExplore_Icelake_Pan01_C;

}

