#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explore_Badge_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Explore_Badge_Base.Explore_Badge_Base_C.ExecuteUbergraph_Explore_Badge_Base
// 0x0068 (0x0068 - 0x0000)
struct Explore_Badge_Base_C_ExecuteUbergraph_Explore_Badge_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_SetSceneComponentHiddenInGame_HiddenComponents; // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBP_AudioManager_C*                     CallFunc_GetClientAudioManager_AudioManager;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_SetSceneComponentHiddenInGame_HiddenComponents_1; // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USceneComponent*>                CallFunc_SetSceneComponentHiddenInGame_HiddenComponents_2; // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_SetSceneComponentHiddenInGame_HiddenComponents_3; // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_Explore_Badge_Base_C_ExecuteUbergraph_Explore_Badge_Base;

// Function Explore_Badge_Base.Explore_Badge_Base_C.UserConstructionScript
// 0x000C (0x000C - 0x0000)
struct Explore_Badge_Base_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Explore_Badge_Base_C_UserConstructionScript;

}

