#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explore_Pan_MultiPickUp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Explore_Pan_MultiPickUp.Explore_Pan_MultiPickUp_C
// 0x0050 (0x0410 - 0x03C0)
class AExplore_Pan_MultiPickUp_C final : public AExploreStaticCreator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_StaticCreatorComponent_C*           PanPickUp;                                         // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 PanCreatorID;                                      // 0x03D8(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 StaticIDPassword;                                  // 0x03E8(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 StaticIDInput;                                     // 0x03F8(0x0010)(Edit, BlueprintVisible)
	int32                                         Talk_Trigger_ID;                                   // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnPlayTalkInterrupted_AC14D41F49A9BBB2C2E6C98BE7898937();
	void OnPlayTalkEnd_AC14D41F49A9BBB2C2E6C98BE7898937();
	void ReceiveOnExploreGroupActive();
	void OnExploreMechanismStateChange(int32 CreatorId, int32 StateId, int32 LeaveStateId);
	void ExecuteUbergraph_Explore_Pan_MultiPickUp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Explore_Pan_MultiPickUp_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Explore_Pan_MultiPickUp_C")
	}
	static class AExplore_Pan_MultiPickUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AExplore_Pan_MultiPickUp_C>();
	}
};
DUMPER7_ASSERTS_AExplore_Pan_MultiPickUp_C;

}

