#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explore_Drone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Explore_Drone.Explore_Drone_C
// 0x0070 (0x0430 - 0x03C0)
class AExplore_Drone_C final : public AExploreStaticCreator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_StaticCreatorComponent_C*           drone5;                                            // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           drone4;                                            // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           StillDrone7;                                       // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           StillDrone6;                                       // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           StillDrone5;                                       // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           StillDrone4;                                       // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           StillDrone3;                                       // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           StillDrone2;                                       // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           StillDrone1;                                       // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           drone3;                                            // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           drone2;                                            // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           drone1;                                            // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Explore_Drone_drone5_K2Node_ComponentBoundEvent_4_OnMechanismStateChangeDelegate__DelegateSignature(class ACombatItemBase* Mechanism, int32 StateId, int32 LeaveStateId);
	void ExecuteUbergraph_Explore_Drone(int32 EntryPoint);
	void BndEvt__Explore_Drone_drone4_K2Node_ComponentBoundEvent_0_OnMechanismStateChangeDelegate__DelegateSignature(class ACombatItemBase* Mechanism, int32 StateId, int32 LeaveStateId);
	void BndEvt__Explore_Drone_drone3_K2Node_ComponentBoundEvent_3_OnMechanismStateChangeDelegate__DelegateSignature(class ACombatItemBase* Mechanism, int32 StateId, int32 LeaveStateId);
	void BndEvt__Explore_Drone_drone2_K2Node_ComponentBoundEvent_2_OnMechanismStateChangeDelegate__DelegateSignature(class ACombatItemBase* Mechanism, int32 StateId, int32 LeaveStateId);
	void BndEvt__Explore_Drone_drone1_K2Node_ComponentBoundEvent_1_OnMechanismStateChangeDelegate__DelegateSignature(class ACombatItemBase* Mechanism, int32 StateId, int32 LeaveStateId);
	void ReceiveOnExploreGroupActive();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Explore_Drone_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Explore_Drone_C")
	}
	static class AExplore_Drone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AExplore_Drone_C>();
	}
};
DUMPER7_ASSERTS_AExplore_Drone_C;

}

