#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explore_Pan_InteractiveParkour

#include "Basic.hpp"

#include "PanControl_structs.hpp"
#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Explore_Pan_InteractiveParkour.Explore_Pan_InteractiveParkour_C
// 0x0048 (0x0408 - 0x03C0)
class AExplore_Pan_InteractiveParkour_C final : public AExploreStaticCreator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_StaticCreatorComponent_C*           FootPrint;                                         // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           Pan;                                               // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         PanOpenState;                                      // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PanRunState;                                       // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PanRunNum;                                         // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPanControl>                    PanControl;                                        // 0x03F0(0x0010)(Edit, BlueprintVisible)
	int32                                         TalkTriggerId;                                     // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Explore_Pan_InteractiveParkour(int32 EntryPoint);
	void OnExploreMechanismStateChange(int32 CreatorId, int32 StateId, int32 LeaveStateId);
	void ReceiveOnExploreGroupActive();
	void BndEvt__Common_Chest_Chest_K2Node_ComponentBoundEvent_0_OnMechanismStateChangeDelegate__DelegateSignature(class ACombatItemBase* Mechanism, int32 StateId, int32 LeaveStateId);
	void Finish_C493071C42ACC40652A3D49A3C5223D1();
	void Interrupt_C493071C42ACC40652A3D49A3C5223D1();
	void OnPlayTalkEnd_169323E347001BBBCA173D8493A16837();
	void OnPlayTalkInterrupted_169323E347001BBBCA173D8493A16837();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Explore_Pan_InteractiveParkour_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Explore_Pan_InteractiveParkour_C")
	}
	static class AExplore_Pan_InteractiveParkour_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AExplore_Pan_InteractiveParkour_C>();
	}
};
DUMPER7_ASSERTS_AExplore_Pan_InteractiveParkour_C;

}

