#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: Explore_Drop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Explore_Drop.Explore_Drop_C
// 0x0020 (0x03E0 - 0x03C0)
class AExplore_Drop_C final : public AExploreStaticCreator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_StaticCreatorComponent_C*           Drop;                                              // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         ResourceID;                                        // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResourceNum;                                       // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Explore_Drop(int32 EntryPoint);
	void BndEvt__Common_Drop_Drop_K2Node_ComponentBoundEvent_1_OnPlayerGetResourceDelegate__DelegateSignature(class ACharacterBase* Character, int32 ResourceID_0, int32 ResourceNum_0);
	void ReceiveOnExploreGroupActive();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Explore_Drop_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Explore_Drop_C")
	}
	static class AExplore_Drop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AExplore_Drop_C>();
	}
};
DUMPER7_ASSERTS_AExplore_Drop_C;

}

