#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explore_Parkour

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ParkourControl_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Explore_Parkour.Explore_Parkour_C
// 0x00C8 (0x0488 - 0x03C0)
class AExplore_Parkour_C final : public AExploreStaticCreator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_StaticCreatorComponent_C*           DistanceControl;                                   // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ManualMechanismComponent_C*         ManualMechanism1;                                  // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           Resource;                                          // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           Trap1;                                             // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           Chest;                                             // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           Mechanism;                                         // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LimitTime;                                         // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Mobile_Limit_Time;                                 // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Add_Time;                                          // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Mobile_Add_Time;                                   // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 LimitTitle;                                        // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LimitDes;                                          // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ChestState;                                        // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MechanismState;                                    // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DropOpenState;                                     // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Limit_Distance;                                    // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FParkourControl>                ParkourArray;                                      // 0x0440(0x0010)(Edit, BlueprintVisible)
	int32                                         ParkourDeadNum;                                    // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ParkourTrapNum;                                    // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FParkourControl>                ManualArray;                                       // 0x0458(0x0010)(Edit, BlueprintVisible)
	int32                                         ManualMechanismState;                              // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ManualMechanismFinishState;                        // 0x046C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IfLimitDistanceFollowTrap;                         // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         Level_Sequence;                                    // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SequenceID;                                        // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Explore_Parkour(int32 EntryPoint);
	void Start();
	void ReceiveOnExploreGroupFailed();
	void ResetManualState();
	void OnExploreMechanismStateChange(int32 CreatorId, int32 StateId, int32 LeaveStateId);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveOnExploreGroupReset();
	void ReceiveOnExploreLimitStarted(const class FString& Title, const class FString& Des, const int32 TotalTargetNum);
	void BndEvt__Common_Shooter_Mechanism_K2Node_ComponentBoundEvent_4_OnMechanismStateChangeDelegate__DelegateSignature(class ACombatItemBase* Mechanism_0, int32 StateId, int32 LeaveStateId);
	void BndEvt__Common_Shooter_Chest_K2Node_ComponentBoundEvent_2_OnMechanismStateChangeDelegate__DelegateSignature(class ACombatItemBase* Mechanism_0, int32 StateId, int32 LeaveStateId);
	void ReceiveOnExploreGroupSuccess(bool bShowToast);
	void ReceiveOnExploreGroupActive();
	void OnPlayTalkEnd_84C9C2414450EBD1F0415D861A85AFE0();
	void OnPlayTalkInterrupted_84C9C2414450EBD1F0415D861A85AFE0();
	void StopSound();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Explore_Parkour_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Explore_Parkour_C")
	}
	static class AExplore_Parkour_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AExplore_Parkour_C>();
	}
};
DUMPER7_ASSERTS_AExplore_Parkour_C;

}

