#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explore_Shoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShootBallControl_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Explore_Shoot.Explore_Shoot_C
// 0x00C8 (0x0488 - 0x03C0)
class AExplore_Shoot_C final : public AExploreStaticCreator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UExploreSplineComponent*                ExploreSpline1;                                    // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           Ball1;                                             // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           DistanceControl;                                   // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           Resource;                                          // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           Chest;                                             // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_StaticCreatorComponent_C*           Mechanism;                                         // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LimitTime;                                         // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Mobile_Limit_Time;                                 // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Add_Time;                                          // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Mobile_Add_Time;                                   // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 LimitTitle;                                        // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LimitDes;                                          // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ChestState;                                        // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MechanismState;                                    // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BallDeadNum;                                       // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Limit_Distance;                                    // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FShootBallControl>              ShootArray;                                        // 0x0440(0x0010)(Edit, BlueprintVisible)
	int32                                         BallNum;                                           // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FShootBallControl>              ShootAdditionArray;                                // 0x0458(0x0010)(Edit, BlueprintVisible)
	int32                                         BallOrder;                                         // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Sub_Region_Id;                                     // 0x046C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Sequence_ID;                                       // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         State_Id;                                          // 0x0474(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         Level_Sequence;                                    // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SequenceID;                                        // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Explore_Shoot(int32 EntryPoint);
	void Start();
	void OnExploreMechanismStateChange(int32 CreatorId, int32 StateId, int32 LeaveStateId);
	void ReceiveOnExploreLimitStarted(const class FString& Title, const class FString& Des, const int32 TotalTargetNum);
	void OnExploreCombatPropDead(class ACombatPropBase* CombatProp, int32 StaticCreator);
	void ReceiveOnExploreGroupReset();
	void BndEvt__Common_Shooter_Mechanism_K2Node_ComponentBoundEvent_4_OnMechanismStateChangeDelegate__DelegateSignature(class ACombatItemBase* Mechanism_0, int32 StateId, int32 LeaveStateId);
	void BndEvt__Common_Shooter_Chest_K2Node_ComponentBoundEvent_2_OnMechanismStateChangeDelegate__DelegateSignature(class ACombatItemBase* Mechanism_0, int32 StateId, int32 LeaveStateId);
	void ReceiveOnExploreGroupSuccess(bool bShowToast);
	void ReceiveOnExploreGroupActive();
	void OnPlayTalkEnd_B758F070439662467231FA8CD3519C25();
	void OnPlayTalkInterrupted_B758F070439662467231FA8CD3519C25();
	void Finish_040FB8C34F8C7CE9077249A5FA45B1D6();
	void Interrupt_040FB8C34F8C7CE9077249A5FA45B1D6();
	void StopSound();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Explore_Shoot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Explore_Shoot_C")
	}
	static class AExplore_Shoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AExplore_Shoot_C>();
	}
};
DUMPER7_ASSERTS_AExplore_Shoot_C;

}

