#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Explore_Drone

#include "Basic.hpp"


namespace SDK::Params
{

// Function Explore_Drone.Explore_Drone_C.BndEvt__Explore_Drone_drone5_K2Node_ComponentBoundEvent_4_OnMechanismStateChangeDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Explore_Drone_C_BndEvt__Explore_Drone_drone5_K2Node_ComponentBoundEvent_4_OnMechanismStateChangeDelegate__DelegateSignature final
{
public:
	class ACombatItemBase*                        Mechanism;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StateId;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LeaveStateId;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Explore_Drone_C_BndEvt__Explore_Drone_drone5_K2Node_ComponentBoundEvent_4_OnMechanismStateChangeDelegate__DelegateSignature;

// Function Explore_Drone.Explore_Drone_C.ExecuteUbergraph_Explore_Drone
// 0x00A0 (0x00A0 - 0x0000)
struct Explore_Drone_C_ExecuteUbergraph_Explore_Drone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACombatItemBase*                        K2Node_ComponentBoundEvent_Mechanism;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_StateId;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_LeaveStateId;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EMGameMode_C*                       K2Node_DynamicCast_AsBP_EMGame_Mode;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACombatItemBase*                        K2Node_ComponentBoundEvent_Mechanism_4;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_StateId_4;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_LeaveStateId_4;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACombatItemBase*                        K2Node_ComponentBoundEvent_Mechanism_3;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_StateId_3;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_LeaveStateId_3;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACombatItemBase*                        K2Node_ComponentBoundEvent_Mechanism_2;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_StateId_2;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_LeaveStateId_2;         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_3;                 // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACombatItemBase*                        K2Node_ComponentBoundEvent_Mechanism_1;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_StateId_1;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_LeaveStateId_1;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticCreatorComponent*>        K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchInteger_CmpSuccess_4;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Explore_Drone_C_ExecuteUbergraph_Explore_Drone;

// Function Explore_Drone.Explore_Drone_C.BndEvt__Explore_Drone_drone4_K2Node_ComponentBoundEvent_0_OnMechanismStateChangeDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Explore_Drone_C_BndEvt__Explore_Drone_drone4_K2Node_ComponentBoundEvent_0_OnMechanismStateChangeDelegate__DelegateSignature final
{
public:
	class ACombatItemBase*                        Mechanism;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StateId;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LeaveStateId;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Explore_Drone_C_BndEvt__Explore_Drone_drone4_K2Node_ComponentBoundEvent_0_OnMechanismStateChangeDelegate__DelegateSignature;

// Function Explore_Drone.Explore_Drone_C.BndEvt__Explore_Drone_drone3_K2Node_ComponentBoundEvent_3_OnMechanismStateChangeDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Explore_Drone_C_BndEvt__Explore_Drone_drone3_K2Node_ComponentBoundEvent_3_OnMechanismStateChangeDelegate__DelegateSignature final
{
public:
	class ACombatItemBase*                        Mechanism;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StateId;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LeaveStateId;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Explore_Drone_C_BndEvt__Explore_Drone_drone3_K2Node_ComponentBoundEvent_3_OnMechanismStateChangeDelegate__DelegateSignature;

// Function Explore_Drone.Explore_Drone_C.BndEvt__Explore_Drone_drone2_K2Node_ComponentBoundEvent_2_OnMechanismStateChangeDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Explore_Drone_C_BndEvt__Explore_Drone_drone2_K2Node_ComponentBoundEvent_2_OnMechanismStateChangeDelegate__DelegateSignature final
{
public:
	class ACombatItemBase*                        Mechanism;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StateId;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LeaveStateId;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Explore_Drone_C_BndEvt__Explore_Drone_drone2_K2Node_ComponentBoundEvent_2_OnMechanismStateChangeDelegate__DelegateSignature;

// Function Explore_Drone.Explore_Drone_C.BndEvt__Explore_Drone_drone1_K2Node_ComponentBoundEvent_1_OnMechanismStateChangeDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Explore_Drone_C_BndEvt__Explore_Drone_drone1_K2Node_ComponentBoundEvent_1_OnMechanismStateChangeDelegate__DelegateSignature final
{
public:
	class ACombatItemBase*                        Mechanism;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StateId;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LeaveStateId;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Explore_Drone_C_BndEvt__Explore_Drone_drone1_K2Node_ComponentBoundEvent_1_OnMechanismStateChangeDelegate__DelegateSignature;

}

