#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Flow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum Flow.EFlowLogVerbosity
// NumValues: 0x0007
enum class EFlowLogVerbosity : uint8
{
	Error                                    = 0,
	Warning                                  = 1,
	Display                                  = 2,
	Log                                      = 3,
	Verbose                                  = 4,
	VeryVerbose                              = 5,
	EFlowLogVerbosity_MAX                    = 6,
};

// Enum Flow.EFlowOnScreenMessageType
// NumValues: 0x0003
enum class EFlowOnScreenMessageType : uint8
{
	Temporary                                = 0,
	Permanent                                = 1,
	EFlowOnScreenMessageType_MAX             = 2,
};

// Enum Flow.EFlowTagContainerMatchType
// NumValues: 0x0005
enum class EFlowTagContainerMatchType : uint8
{
	HasAny                                   = 0,
	HasAnyExact                              = 1,
	HasAll                                   = 2,
	HasAllExact                              = 3,
	EFlowTagContainerMatchType_MAX           = 4,
};

// Enum Flow.EFlowNetMode
// NumValues: 0x0006
enum class EFlowNetMode : uint8
{
	Any                                      = 0,
	Authority                                = 1,
	ClientOnly                               = 2,
	ServerOnly                               = 3,
	SinglePlayerOnly                         = 4,
	EFlowNetMode_MAX                         = 5,
};

// Enum Flow.EFlowFinishPolicy
// NumValues: 0x0003
enum class EFlowFinishPolicy : uint8
{
	Keep                                     = 0,
	Abort                                    = 1,
	EFlowFinishPolicy_MAX                    = 2,
};

// Enum Flow.EFlowNodeState
// NumValues: 0x0005
enum class EFlowNodeState : uint8
{
	NeverActivated                           = 0,
	Active                                   = 1,
	Completed                                = 2,
	Aborted                                  = 3,
	EFlowNodeState_MAX                       = 4,
};

// ScriptStruct Flow.MovieSceneFlowTemplateBase
// 0x0008 (0x0028 - 0x0020)
struct FMovieSceneFlowTemplateBase : public FMovieSceneEvalTemplate
{
public:
	uint8                                         bFireEventsWhenForwards : 1;                       // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bFireEventsWhenBackwards : 1;                      // 0x0020(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneFlowTemplateBase;

// ScriptStruct Flow.FlowNodeSaveData
// 0x0020 (0x0020 - 0x0000)
struct FFlowNodeSaveData final
{
public:
	struct FGUID                                  NodeGuid;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 NodeData;                                          // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, SaveGame, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFlowNodeSaveData;

// ScriptStruct Flow.FlowAssetSaveData
// 0x0040 (0x0040 - 0x0000)
struct FFlowAssetSaveData final
{
public:
	class FString                                 WorldName;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InstanceName;                                      // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 AssetData;                                         // 0x0020(0x0010)(Edit, ZeroConstructor, EditConst, SaveGame, NativeAccessSpecifierPublic)
	TArray<struct FFlowNodeSaveData>              NodeRecords;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, SaveGame, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFlowAssetSaveData;

// ScriptStruct Flow.MovieSceneFlowRepeaterTemplate
// 0x0010 (0x0038 - 0x0028)
struct FMovieSceneFlowRepeaterTemplate final : public FMovieSceneFlowTemplateBase
{
public:
	class FString                                 EventName;                                         // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneFlowRepeaterTemplate;

// ScriptStruct Flow.NotifyTagReplication
// 0x0010 (0x0010 - 0x0000)
struct FNotifyTagReplication final
{
public:
	struct FGameplayTag                           ActorTag;                                          // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           NotifyTag;                                         // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNotifyTagReplication;

// ScriptStruct Flow.ConnectedPin
// 0x0018 (0x0018 - 0x0000)
struct FConnectedPin final
{
public:
	struct FGUID                                  NodeGuid;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PinName;                                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConnectedPin;

// ScriptStruct Flow.FlowPin
// 0x0018 (0x0018 - 0x0000)
struct FFlowPin final
{
public:
	class FName                                   PinName;                                           // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PinToolTip;                                        // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFlowPin;

// ScriptStruct Flow.FlowComponentSaveData
// 0x0030 (0x0030 - 0x0000)
struct FFlowComponentSaveData final
{
public:
	class FString                                 WorldName;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActorInstanceName;                                 // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ComponentData;                                     // 0x0020(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFlowComponentSaveData;

// ScriptStruct Flow.MovieSceneFlowTriggerTemplate
// 0x0020 (0x0048 - 0x0028)
struct FMovieSceneFlowTriggerTemplate final : public FMovieSceneFlowTemplateBase
{
public:
	TArray<struct FFrameNumber>                   EventTimes;                                        // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         EventNames;                                        // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMovieSceneFlowTriggerTemplate;

}

