#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: FMODStudio

#include "Basic.hpp"

#include "MovieSceneTracks_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum FMODStudio.EFMODEventProperty
// NumValues: 0x0007
enum class EFMODEventProperty : uint8
{
	ChannelPriority                          = 0,
	ScheduleDelay                            = 1,
	ScheduleLookahead                        = 2,
	MinimumDistance                          = 3,
	MaximumDistance                          = 4,
	Count                                    = 5,
	EFMODEventProperty_MAX                   = 6,
};

// Enum FMODStudio.EFMOD_STUDIO_STOP_MODE
// NumValues: 0x0003
enum class EFMOD_STUDIO_STOP_MODE : uint8
{
	ALLOWFADEOUT                             = 0,
	IMMEDIATE                                = 1,
	EFMOD_STUDIO_STOP_MODE_MAX               = 2,
};

// Enum FMODStudio.EFMODEventControlKey
// NumValues: 0x0004
enum class EFMODEventControlKey : uint8
{
	Stop                                     = 0,
	Play                                     = 1,
	Pause                                    = 2,
	EFMODEventControlKey_MAX                 = 3,
};

// Enum FMODStudio.EFMODCodec
// NumValues: 0x0006
enum class EFMODCodec : uint8
{
	VORBIS                                   = 0,
	FADPCM                                   = 1,
	OPUS                                     = 2,
	XMA                                      = 3,
	AT9                                      = 4,
	EFMODCodec_MAX                           = 5,
};

// Enum FMODStudio.EFMODPlatforms
// NumValues: 0x000D
enum class EFMODPlatforms : uint8
{
	Windows                                  = 0,
	Linux                                    = 1,
	Mac                                      = 2,
	Android                                  = 3,
	IOS                                      = 4,
	PS4                                      = 5,
	PS5                                      = 6,
	Deprecated                               = 7,
	Switch                                   = 8,
	XboxOne                                  = 9,
	XSX                                      = 10,
	Editor                                   = 11,
	EFMODPlatforms_MAX                       = 12,
};

// Enum FMODStudio.EFMODOutput
// NumValues: 0x000F
enum class EFMODOutput : uint8
{
	TYPE_AUTODETECT                          = 0,
	TYPE_NOSOUND                             = 1,
	TYPE_WASAPI                              = 2,
	TYPE_ASIO                                = 3,
	TYPE_PULSEAUDIO                          = 4,
	TYPE_ALSA                                = 5,
	TYPE_COREAUDIO                           = 6,
	TYPE_AUDIOTRACK                          = 7,
	TYPE_OPENSL                              = 8,
	TYPE_AUDIOOUT                            = 9,
	TYPE_AUDIO3D                             = 10,
	TYPE_NNAUDIO                             = 11,
	TYPE_WINSONIC                            = 12,
	TYPE_AAUDIO                              = 13,
	TYPE_MAX                                 = 14,
};

// Enum FMODStudio.EFMODSpeakerMode
// NumValues: 0x0005
enum class EFMODSpeakerMode : uint8
{
	Stereo                                   = 0,
	Surround_5_1                             = 1,
	Surround_7_1                             = 2,
	Surround_7_1_4                           = 3,
	EFMODSpeakerMode_MAX                     = 4,
};

// Enum FMODStudio.EFMODLogging
// NumValues: 0x0005
enum class EFMODLogging : uint8
{
	LEVEL_NONE                               = 0,
	LEVEL_ERROR                              = 1,
	LEVEL_WARNING                            = 2,
	LEVEL_LOG                                = 4,
	LEVEL_MAX                                = 5,
};

// ScriptStruct FMODStudio.FMODEventInstance
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FFMODEventInstance final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-DNA ])
};
DUMPER7_ASSERTS_FFMODEventInstance;

// ScriptStruct FMODStudio.FMODEventControlChannel
// 0x0000 (0x0098 - 0x0098)
struct FFMODEventControlChannel final : public FMovieSceneByteChannel
{
};
DUMPER7_ASSERTS_FFMODEventControlChannel;

// ScriptStruct FMODStudio.FMODAssetLookupRow
// 0x0020 (0x0028 - 0x0008)
struct FFMODAssetLookupRow final : public FTableRowBase
{
public:
	class FString                                 PackageName;                                       // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetName;                                         // 0x0018(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFMODAssetLookupRow;

// ScriptStruct FMODStudio.FMODOcclusionDetails
// 0x0003 (0x0003 - 0x0000)
struct FFMODOcclusionDetails final
{
public:
	bool                                          bEnableOcclusion;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             OcclusionTraceChannel;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseComplexCollisionForOcclusion;                  // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFMODOcclusionDetails;

// ScriptStruct FMODStudio.FMODAttenuationDetails
// 0x000C (0x000C - 0x0000)
struct FFMODAttenuationDetails final
{
public:
	uint8                                         bOverrideAttenuation : 1;                          // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	float                                         MinimumDistance;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumDistance;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFMODAttenuationDetails;

// ScriptStruct FMODStudio.FMODLocalizedBankTable
// 0x0008 (0x0010 - 0x0008)
struct FFMODLocalizedBankTable final : public FTableRowBase
{
public:
	class UDataTable*                             Banks;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFMODLocalizedBankTable;

// ScriptStruct FMODStudio.FMODLocalizedBankRow
// 0x0010 (0x0018 - 0x0008)
struct FFMODLocalizedBankRow final : public FTableRowBase
{
public:
	class FString                                 Path;                                              // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFMODLocalizedBankRow;

// ScriptStruct FMODStudio.FMODEventControlSectionTemplate
// 0x00A0 (0x00C0 - 0x0020)
struct FFMODEventControlSectionTemplate final : public FMovieSceneEvalTemplate
{
public:
	struct FFMODEventControlChannel               ControlKeys;                                       // 0x0020(0x0098)(NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-DNA ])
};
DUMPER7_ASSERTS_FFMODEventControlSectionTemplate;

// ScriptStruct FMODStudio.FMODEventParameterSectionTemplate
// 0x0000 (0x0080 - 0x0080)
struct FFMODEventParameterSectionTemplate final : public FMovieSceneParameterSectionTemplate
{
};
DUMPER7_ASSERTS_FFMODEventParameterSectionTemplate;

// ScriptStruct FMODStudio.FMODProjectLocale
// 0x0028 (0x0028 - 0x0000)
struct FFMODProjectLocale final
{
public:
	class FString                                 LocaleName;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LocaleCode;                                        // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDefault;                                          // 0x0020(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-DNA ])
};
DUMPER7_ASSERTS_FFMODProjectLocale;

// ScriptStruct FMODStudio.FMODPlatformSettings
// 0x0060 (0x0060 - 0x0000)
struct FFMODPlatformSettings final
{
public:
	int32                                         RealChannelCount;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SampleRate;                                        // 0x0004(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFMODSpeakerMode                              SpeakerMode;                                       // 0x0008(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFMODOutput                                   OutputType;                                        // 0x0009(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-DNA ])
	int32                                         CustomPoolSize;                                    // 0x000C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EFMODCodec, int32>                       Codecs;                                            // 0x0010(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFMODPlatformSettings;

// ScriptStruct FMODStudio.SetGlobalSoundParamTemplate
// 0x0000 (0x0080 - 0x0080)
struct FSetGlobalSoundParamTemplate final : public FMovieSceneParameterSectionTemplate
{
};
DUMPER7_ASSERTS_FSetGlobalSoundParamTemplate;

}

