#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayMessageRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GameplayMessageRuntime.CancellableAsyncAction
// 0x0000 (0x0030 - 0x0030)
class UCancellableAsyncAction : public UBlueprintAsyncActionBase
{
public:
	void Cancel();

	bool IsActive() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CancellableAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CancellableAsyncAction")
	}
	static class UCancellableAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCancellableAsyncAction>();
	}
};
DUMPER7_ASSERTS_UCancellableAsyncAction;

// Class GameplayMessageRuntime.AsyncAction_ListenForGameplayMessage
// 0x0080 (0x00B0 - 0x0030)
class UAsyncAction_ListenForGameplayMessage final : public UCancellableAsyncAction
{
public:
	TMulticastInlineDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> OnMessageReceived; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x70];                                      // 0x0040(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_ListenForGameplayMessage* ListenForGameplayMessages(class UObject* WorldContextObject, const struct FGameplayTag& Channel, class UScriptStruct* PayloadType, const class FString& UnitType, int32 UnitId);

	bool GetPayload(int32& OutPayload);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncAction_ListenForGameplayMessage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncAction_ListenForGameplayMessage")
	}
	static class UAsyncAction_ListenForGameplayMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_ListenForGameplayMessage>();
	}
};
DUMPER7_ASSERTS_UAsyncAction_ListenForGameplayMessage;

// Class GameplayMessageRuntime.LuaCheckHelper
// 0x0008 (0x0030 - 0x0028)
class ULuaCheckHelper final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool EnterTriggerBoxChecker(const struct FCheckParams& Params_0, class AActor* EnteredTriggerBox, class AActor* EnteredActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaCheckHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaCheckHelper")
	}
	static class ULuaCheckHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaCheckHelper>();
	}
};
DUMPER7_ASSERTS_ULuaCheckHelper;

// Class GameplayMessageRuntime.GameplayMessageSubsystem
// 0x00F8 (0x0128 - 0x0030)
class UGameplayMessageSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0xA0];                                      // 0x0030(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	class ULuaCheckHelper*                        LuaMessageHelper;                                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x50];                                      // 0x00D8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void K2_BroadcastMessage(const struct FGameplayTag& Channel, const int32& Message);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayMessageSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayMessageSubsystem")
	}
	static class UGameplayMessageSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayMessageSubsystem>();
	}
};
DUMPER7_ASSERTS_UGameplayMessageSubsystem;

}

