#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayMessageRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum GameplayMessageRuntime.EGameplayMessageMatch
// NumValues: 0x0003
enum class EGameplayMessageMatch : uint8
{
	ExactMatch                               = 0,
	PartialMatch                             = 1,
	EGameplayMessageMatch_MAX                = 2,
};

// ScriptStruct GameplayMessageRuntime.GameplayMessageListenerHandle
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FGameplayMessageListenerHandle final
{
public:
	TWeakObjectPtr<class UGameplayMessageSubsystem> Subsystem;                                       // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           Channel;                                           // 0x0008(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ID;                                                // 0x0010(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGameplayMessageListenerHandle;

// ScriptStruct GameplayMessageRuntime.GameplayMessageListenerData
// 0x0070 (0x0070 - 0x0000)
struct alignas(0x10) FGameplayMessageListenerData final
{
public:
	uint8                                         Pad_0[0x70];                                       // 0x0000(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGameplayMessageListenerData;

// ScriptStruct GameplayMessageRuntime.CheckParams
// 0x0018 (0x0018 - 0x0000)
struct FCheckParams final
{
public:
	class FString                                 UnitType;                                          // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UnitId;                                            // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCheckParams;

// ScriptStruct GameplayMessageRuntime.EnterTriggerBox
// 0x0010 (0x0010 - 0x0000)
struct FEnterTriggerBox final
{
public:
	class AActor*                                 EnteredTriggerBox;                                 // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 EnteredActor;                                      // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FEnterTriggerBox;

}

