#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: Guide_TextFloatList_PC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Guide_TextFloatList_PC.Guide_TextFloatList_PC_C
// 0x0038 (0x0638 - 0x0600)
class UGuide_TextFloatList_PC_C final : public UGuideAsyncActionUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GuideText_Out;                                     // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GuideText_in;                                      // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGuide_TextFloat_PC_C*                  Guide_TextFloat_PC;                                // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           List_Float;                                        // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Panel_Guide;                                       // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Guide_TextFloatList_PC(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Guide_TextFloatList_PC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Guide_TextFloatList_PC_C")
	}
	static class UGuide_TextFloatList_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuide_TextFloatList_PC_C>();
	}
};
DUMPER7_ASSERTS_UGuide_TextFloatList_PC_C;

}

