#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: Guide_TextFloat_PC

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Guide_TextFloat_PC.Guide_TextFloat_PC_C.ExecuteUbergraph_Guide_TextFloat_PC
// 0x0018 (0x0018 - 0x0000)
struct Guide_TextFloat_PC_C_ExecuteUbergraph_Guide_TextFloat_PC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Guide_TextFloat_PC_C_ExecuteUbergraph_Guide_TextFloat_PC;

// Function Guide_TextFloat_PC.Guide_TextFloat_PC_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct Guide_TextFloat_PC_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Guide_TextFloat_PC_C_OnListItemObjectSet;

// Function Guide_TextFloat_PC.Guide_TextFloat_PC_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct Guide_TextFloat_PC_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Guide_TextFloat_PC_C_BP_OnItemSelectionChanged;

// Function Guide_TextFloat_PC.Guide_TextFloat_PC_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct Guide_TextFloat_PC_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Guide_TextFloat_PC_C_BP_OnItemExpansionChanged;

// Function Guide_TextFloat_PC.Guide_TextFloat_PC_C.UpdateGuideBgContentSize
// 0x0038 (0x0038 - 0x0000)
struct Guide_TextFloat_PC_C_UpdateGuideBgContentSize final
{
public:
	float                                         FontCount;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OneLineCount;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_As_____;                        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Guide_TextFloat_PC_C_UpdateGuideBgContentSize;

// Function Guide_TextFloat_PC.Guide_TextFloat_PC_C.SetGuideColorByType
// 0x0018 (0x0018 - 0x0000)
struct Guide_TextFloat_PC_C_SetGuideColorByType final
{
public:
	class FString                                 GuideType;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Guide_TextFloat_PC_C_SetGuideColorByType;

// Function Guide_TextFloat_PC.Guide_TextFloat_PC_C.OnKeyDown
// 0x0128 (0x0128 - 0x0000)
struct Guide_TextFloat_PC_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_Guide_TextFloat_PC_C_OnKeyDown;

// Function Guide_TextFloat_PC.Guide_TextFloat_PC_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Guide_TextFloat_PC_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Guide_TextFloat_PC_C_GetModuleName;

}

