#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: Guide_TextFloatList_PC

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Guide_TextFloatList_PC.Guide_TextFloatList_PC_C.ExecuteUbergraph_Guide_TextFloatList_PC
// 0x0028 (0x0028 - 0x0000)
struct Guide_TextFloatList_PC_C_ExecuteUbergraph_Guide_TextFloatList_PC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDevicePlatformName_ReturnValue;        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Guide_TextFloatList_PC_C_ExecuteUbergraph_Guide_TextFloatList_PC;

// Function Guide_TextFloatList_PC.Guide_TextFloatList_PC_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Guide_TextFloatList_PC_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Guide_TextFloatList_PC_C_PreConstruct;

// Function Guide_TextFloatList_PC.Guide_TextFloatList_PC_C.OnKeyDown
// 0x0128 (0x0128 - 0x0000)
struct Guide_TextFloatList_PC_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_Guide_TextFloatList_PC_C_OnKeyDown;

// Function Guide_TextFloatList_PC.Guide_TextFloatList_PC_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Guide_TextFloatList_PC_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Guide_TextFloatList_PC_C_GetModuleName;

}

