#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroNewBDCPlugin

#include "Basic.hpp"

#include "HeroNewBDCPlugin_structs.hpp"


namespace SDK::Params
{

// Function HeroNewBDCPlugin.NewBdcSubsystem.DeletePublicAttribute
// 0x0050 (0x0050 - 0x0000)
struct NewBdcSubsystem_DeletePublicAttribute final
{
public:
	TSet<class FString>                           DeletePublicAttribute_0;                           // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_DeletePublicAttribute;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetAdsJson
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetAdsJson final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetAdsJson;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetAndroidId
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetAndroidId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetAndroidId;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetAppChannelId
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetAppChannelId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetAppChannelId;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetBundleId
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetBundleId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetBundleId;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetChannelId
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetChannelId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetChannelId;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetClientVersion
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetClientVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetClientVersion;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetDataSource
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetDataSource final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetDataSource;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetDeviceID
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetDeviceID final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetDeviceID;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetDeviceKey
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetDeviceKey final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetDeviceKey;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetDeviceModel
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetDeviceModel final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetDeviceModel;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetDisk
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetDisk final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetDisk;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetGaid
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetGaid final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetGaid;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetIDFA
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetIDFA final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetIDFA;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetIDFV
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetIDFV final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetIDFV;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetImgChannelId
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetImgChannelId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetImgChannelId;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetInstallTime
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetInstallTime final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetInstallTime;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetManufacturer
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetManufacturer final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetManufacturer;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetNetWorkCarrier
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetNetWorkCarrier final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetNetWorkCarrier;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetNetworkType
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetNetworkType final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetNetworkType;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetOaid
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetOaid final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetOaid;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetOS
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetOS final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetOS;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetPlatform
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetPlatform final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetPlatform;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetPublicAttribute
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetPublicAttribute final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetPublicAttribute;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetRam
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetRam final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetRam;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetScreenHeight
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetScreenHeight final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetScreenHeight;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetScreenWidth
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetScreenWidth final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetScreenWidth;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetSDKType
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetSDKType final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetSDKType;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetSDKVersion
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetSDKVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetSDKVersion;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetSessionId
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetSessionId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetSessionId;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetSystemLanguage
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetSystemLanguage final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetSystemLanguage;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetSystemVersion
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetSystemVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetSystemVersion;

// Function HeroNewBDCPlugin.NewBdcSubsystem.GetUserAgent
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_GetUserAgent final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_GetUserAgent;

// Function HeroNewBDCPlugin.NewBdcSubsystem.Init
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_Init final
{
public:
	TDelegate<void(bool bIsSuccess, const class FString& ErrorMsg)> InitCallback;                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_Init;

// Function HeroNewBDCPlugin.NewBdcSubsystem.Login
// 0x0020 (0x0020 - 0x0000)
struct NewBdcSubsystem_Login final
{
public:
	class FString                                 AccountId;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleKey;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_Login;

// Function HeroNewBDCPlugin.NewBdcSubsystem.SetAdsJson
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_SetAdsJson final
{
public:
	class FString                                 AdsJson;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_SetAdsJson;

// Function HeroNewBDCPlugin.NewBdcSubsystem.setChannelInfo
// 0x0030 (0x0030 - 0x0000)
struct NewBdcSubsystem_setChannelInfo final
{
public:
	class FString                                 ChannelId;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AppChannelId;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ImgChannelId;                                      // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_setChannelInfo;

// Function HeroNewBDCPlugin.NewBdcSubsystem.SetDynamicProperties
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_SetDynamicProperties final
{
public:
	TDelegate<void()>                             DynamicCallback;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_SetDynamicProperties;

// Function HeroNewBDCPlugin.NewBdcSubsystem.SetGaid
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_SetGaid final
{
public:
	class FString                                 Gaid;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_SetGaid;

// Function HeroNewBDCPlugin.NewBdcSubsystem.SetLogCallBack
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_SetLogCallBack final
{
public:
	TDelegate<void(const class FString& ErrorMsg)> LogCallback;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_SetLogCallBack;

// Function HeroNewBDCPlugin.NewBdcSubsystem.SetOaid
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_SetOaid final
{
public:
	class FString                                 Oaid;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_SetOaid;

// Function HeroNewBDCPlugin.NewBdcSubsystem.SetPublicAttribute
// 0x0010 (0x0010 - 0x0000)
struct NewBdcSubsystem_SetPublicAttribute final
{
public:
	class FString                                 Properties;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_SetPublicAttribute;

// Function HeroNewBDCPlugin.NewBdcSubsystem.UploadTrackLog
// 0x0020 (0x0020 - 0x0000)
struct NewBdcSubsystem_UploadTrackLog final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Properties;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NewBdcSubsystem_UploadTrackLog;

// Function HeroNewBDCPlugin.NewBdcSubsystem.UploadUserLog
// 0x0020 (0x0020 - 0x0000)
struct NewBdcSubsystem_UploadUserLog final
{
public:
	EBDCUserEventType                             userEventType;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Properties;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBDCUserType                                  UserType;                                          // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NewBdcSubsystem_UploadUserLog;

}

