#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HotPatcherRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BinariesPatchFeature_structs.hpp"


namespace SDK
{

// Enum HotPatcherRuntime.ETargetPlatform
// NumValues: 0x0003
enum class ETargetPlatform : uint8
{
	None                                     = 0,
	AllPlatforms                             = 1,
	ETargetPlatform_MAX                      = 2,
};

// Enum HotPatcherRuntime.EAssetRegistryRule
// NumValues: 0x0004
enum class EAssetRegistryRule : uint8
{
	PATCH                                    = 0,
	PER_CHUNK                                = 1,
	CUSTOM                                   = 2,
	EAssetRegistryRule_MAX                   = 3,
};

// Enum HotPatcherRuntime.EMatchOperator
// NumValues: 0x0005
enum class EMatchOperator : uint8
{
	None                                     = 0,
	GREAT_THAN                               = 1,
	LESS_THAN                                = 2,
	EQUAL                                    = 3,
	EMatchOperator_MAX                       = 4,
};

// Enum HotPatcherRuntime.EMatchRule
// NumValues: 0x0004
enum class EMatchRule : uint8
{
	None                                     = 0,
	Match                                    = 1,
	Ignore                                   = 2,
	EMatchRule_MAX                           = 3,
};

// Enum HotPatcherRuntime.EMonolithicPathMode
// NumValues: 0x0003
enum class EMonolithicPathMode : uint8
{
	MountPath                                = 0,
	PackagePath                              = 1,
	EMonolithicPathMode_MAX                  = 2,
};

// Enum HotPatcherRuntime.EShaderLibNameRule
// NumValues: 0x0004
enum class EShaderLibNameRule : uint8
{
	CHUNK_NAME                               = 0,
	PROJECT_NAME                             = 1,
	CUSTOM                                   = 2,
	EShaderLibNameRule_MAX                   = 3,
};

// Enum HotPatcherRuntime.EHashCalculator
// NumValues: 0x0004
enum class EHashCalculator : uint32
{
	NoHash                                   = 0,
	MD5                                      = 1,
	SHA1                                     = 2,
	EHashCalculator_MAX                      = 3,
};

// Enum HotPatcherRuntime.EHotPatcherMatchModEx
// NumValues: 0x0003
enum class EHotPatcherMatchModEx : uint8
{
	StartWith                                = 0,
	Equal                                    = 1,
	EHotPatcherMatchModEx_MAX                = 2,
};

// Enum HotPatcherRuntime.EAssetRegistryDependencyTypeEx
// NumValues: 0x000A
enum class EAssetRegistryDependencyTypeEx : uint8
{
	None                                     = 0,
	Soft                                     = 1,
	Hard                                     = 2,
	SearchableName                           = 4,
	SoftManage                               = 8,
	HardManage                               = 16,
	Packages                                 = 3,
	Manage                                   = 24,
	All                                      = 31,
	EAssetRegistryDependencyTypeEx_MAX       = 32,
};

// Enum HotPatcherRuntime.EPSOSaveMode
// NumValues: 0x0004
enum class EPSOSaveMode : uint8
{
	Incremental                              = 0,
	BoundPSOsOnly                            = 1,
	SortedBoundPSOs                          = 2,
	EPSOSaveMode_MAX                         = 3,
};

// Enum HotPatcherRuntime.ESearchCaseMode
// NumValues: 0x0003
enum class ESearchCaseMode : uint8
{
	CaseSensitive                            = 0,
	IgnoreCase                               = 1,
	ESearchCaseMode_MAX                      = 2,
};

// Enum HotPatcherRuntime.EOptionalPatchAssetState
// NumValues: 0x0004
enum class EOptionalPatchAssetState : uint8
{
	None                                     = 0,
	Downloading                              = 1,
	Downloaded                               = 2,
	EOptionalPatchAssetState_MAX             = 3,
};

// Enum HotPatcherRuntime.EUpdateEvent
// NumValues: 0x0015
enum class EUpdateEvent : uint32
{
	GameStart                                = 1,
	TheLatestVersion                         = 2,
	OutdatedVersion                          = 3,
	StartDownload                            = 4,
	DownloadCompleted                        = 5,
	PersistentCompleted                      = 6,
	PatchFinish                              = 7,
	PatchFinishEX                            = 8,
	DevelopmentMode                          = 9,
	FailedStartId                            = 100,
	GetRemoteVersionFailed                   = 101,
	GetRemotePakListFailed                   = 102,
	DownloadFailed                           = 103,
	DownloadSaveFailed                       = 104,
	PersistentFailed_ReDownload              = 105,
	PersistentFailed_PakMoveFailed           = 106,
	PersistentFailed_InfoFileMoveFailed      = 107,
	PersistentFailed_VersionListWriteFailed  = 108,
	CancalDownload                           = 109,
	VerifyFailed                             = 110,
	EUpdateEvent_MAX                         = 111,
};

// ScriptStruct HotPatcherRuntime.PatcherSpecifyAsset
// 0x0030 (0x0030 - 0x0000)
struct FPatcherSpecifyAsset final
{
public:
	struct FSoftObjectPath                        Asset;                                             // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnalysisAssetDependencies;                        // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EAssetRegistryDependencyTypeEx>        AssetRegistryDependencyTypes;                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPatcherSpecifyAsset;

// ScriptStruct HotPatcherRuntime.AssetScanConfig
// 0x0088 (0x0088 - 0x0000)
struct FAssetScanConfig final
{
public:
	bool                                          bPackageTracker;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDirectoryPath>                 AssetIncludeFilters;                               // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDirectoryPath>                 AssetIgnoreFilters;                                // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIncludeHasRefAssetsOnly;                          // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnalysisFilterDependencies;                       // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EAssetRegistryDependencyTypeEx>        AssetRegistryDependencyTypes;                      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPatcherSpecifyAsset>           IncludeSpecifyAssets;                              // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bRecursiveWidgetTree;                              // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnalysisMaterialInstance;                         // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnalysisMaterialFunction;                         // 0x0052(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnalysisSkeletalMeshLodSetting;                   // 0x0053(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnalysisAnimMontage;                              // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportWorldComposition;                          // 0x0055(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceSkipContent;                                 // 0x0056(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDirectoryPath>                 ForceSkipContentRules;                             // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                ForceSkipAssets;                                   // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UClass*>                         ForceSkipClasses;                                  // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAssetScanConfig;

// ScriptStruct HotPatcherRuntime.IoStorePlatformContainers
// 0x0038 (0x0038 - 0x0000)
struct FIoStorePlatformContainers final
{
public:
	struct FDirectoryPath                         BasePackageStagedRootDir;                          // 0x0000(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bGenerateDiffPatch;                                // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFilePath                              GlobalContainersOverride;                          // 0x0018(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FFilePath                              PatchSourceOverride;                               // 0x0028(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIoStorePlatformContainers;

// ScriptStruct HotPatcherRuntime.IoStoreSettings
// 0x0080 (0x0080 - 0x0000)
struct FIoStoreSettings final
{
public:
	bool                                          bIoStore;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowBulkDataInIoStore;                           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         IoStorePakListOptions;                             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         IoStoreCommandletOptions;                          // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<ETargetPlatform, struct FIoStorePlatformContainers> PlatformContainers;                     // 0x0028(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bStoragePakList;                                   // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStorageBulkDataInfo;                              // 0x0079(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FIoStoreSettings;

// ScriptStruct HotPatcherRuntime.PakMountInfo
// 0x0018 (0x0018 - 0x0000)
struct FPakMountInfo final
{
public:
	class FString                                 Pak;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PakOrder;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPakMountInfo;

// ScriptStruct HotPatcherRuntime.AssetDetail
// 0x0018 (0x0018 - 0x0000)
struct FAssetDetail final
{
public:
	class FName                                   PackagePath;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AssetType;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GUID;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAssetDetail;

// ScriptStruct HotPatcherRuntime.AssetDependenciesDetail
// 0x0060 (0x0060 - 0x0000)
struct FAssetDependenciesDetail final
{
public:
	class FString                                 ModuleCategory;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FAssetDetail>      AssetDependencyDetails;                            // 0x0010(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAssetDependenciesDetail;

// ScriptStruct HotPatcherRuntime.AssetDependenciesInfo
// 0x0050 (0x0050 - 0x0000)
struct FAssetDependenciesInfo final
{
public:
	TMap<class FString, struct FAssetDependenciesDetail> AssetsDependenciesMap;                      // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAssetDependenciesInfo;

// ScriptStruct HotPatcherRuntime.AssetRegistryOptions
// 0x0030 (0x0030 - 0x0000)
struct FAssetRegistryOptions final
{
public:
	bool                                          bSerializeAssetRegistry;                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSerializeAssetRegistryManifest;                   // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AssetRegistryMountPointRegular;                    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAssetRegistryRule                            AssetRegistryRule;                                 // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCustomAssetRegistryName;                          // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AssetRegistryNameRegular;                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAssetRegistryOptions;

// ScriptStruct HotPatcherRuntime.PakEncryptSettings
// 0x0018 (0x0018 - 0x0000)
struct FPakEncryptSettings final
{
public:
	bool                                          bUseDefaultCryptoIni;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFilePath                              CryptoKeys;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPakEncryptSettings;

// ScriptStruct HotPatcherRuntime.PlatformBasePak
// 0x0018 (0x0018 - 0x0000)
struct FPlatformBasePak final
{
public:
	ETargetPlatform                               Platform;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFilePath>                      Paks;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPlatformBasePak;

// ScriptStruct HotPatcherRuntime.MatchRule
// 0x0028 (0x0028 - 0x0000)
struct FMatchRule final
{
public:
	EMatchRule                                    Rule;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMatchOperator                                Operator;                                          // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Size;                                              // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Formaters;                                         // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         AssetTypes;                                        // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMatchRule;

// ScriptStruct HotPatcherRuntime.BinariesPatchConfig
// 0x0050 (0x0050 - 0x0000)
struct FBinariesPatchConfig final
{
public:
	EBinariesPatchFeature                         BinariesPatchType;                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x17];                                       // 0x0001(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPakEncryptSettings                    EncryptSettings;                                   // 0x0018(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FPlatformBasePak>               BaseVersionPaks;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMatchRule>                     MatchRules;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBinariesPatchConfig;

// ScriptStruct HotPatcherRuntime.ChunkAssetDescribe
// 0x0148 (0x0148 - 0x0000)
struct alignas(0x08) FChunkAssetDescribe final
{
public:
	uint8                                         Pad_0[0x148];                                      // 0x0000(0x0148)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChunkAssetDescribe;

// ScriptStruct HotPatcherRuntime.ChunkPakCommand
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FChunkPakCommand final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChunkPakCommand;

// ScriptStruct HotPatcherRuntime.ExternFileInfo
// 0x0038 (0x0038 - 0x0000)
struct FExternFileInfo final
{
public:
	struct FFilePath                              FilePath;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 MountPath;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FileHash;                                          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FExternFileInfo;

// ScriptStruct HotPatcherRuntime.ExternDirectoryInfo
// 0x0038 (0x0038 - 0x0000)
struct FExternDirectoryInfo final
{
public:
	struct FDirectoryPath                         DirectoryPath;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 MountPoint;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWildcard;                                         // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WildcardStr;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FExternDirectoryInfo;

// ScriptStruct HotPatcherRuntime.PlatformExternAssets
// 0x0028 (0x0028 - 0x0000)
struct FPlatformExternAssets final
{
public:
	ETargetPlatform                               TargetPlatform;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FExternFileInfo>                AddExternFileToPak;                                // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FExternDirectoryInfo>           AddExternDirectoryToPak;                           // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPlatformExternAssets;

// ScriptStruct HotPatcherRuntime.PakInternalInfo
// 0x0006 (0x0006 - 0x0000)
struct FPakInternalInfo final
{
public:
	uint8                                         Pad_0[0x3];                                        // 0x0000(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIncludeEngineIni;                                 // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludePluginIni;                                 // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeProjectIni;                                // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPakInternalInfo;

// ScriptStruct HotPatcherRuntime.CookShaderOptions
// 0x0028 (0x0028 - 0x0000)
struct FCookShaderOptions final
{
public:
	bool                                          bSharedShaderLibrary;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNativeShader;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x1];                                        // 0x0002(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EShaderLibNameRule                            ShaderNameRule;                                    // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CustomShaderName;                                  // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ShaderLibMountPointRegular;                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCookShaderOptions;

// ScriptStruct HotPatcherRuntime.ChunkInfo
// 0x0198 (0x0198 - 0x0000)
struct FChunkInfo final
{
public:
	class FString                                 ChunkName;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ChunkAliasName;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMonolithic;                                       // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMonolithicPathMode                           MonolithicPathMode;                                // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputDebugInfo;                                  // 0x0026(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27[0x9];                                       // 0x0027(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OptionalPatchSign;                                 // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExamineIgnore;                                    // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDirectoryPath>                 AssetIncludeFilters;                               // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDirectoryPath>                 AssetIgnoreFilters;                                // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bAnalysisFilterDependencies;                       // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EAssetRegistryDependencyTypeEx>        AssetRegistryDependencyTypes;                      // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPatcherSpecifyAsset>           IncludeSpecifyAssets;                              // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bForceSkipContent;                                 // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDirectoryPath>                 ForceSkipContentRules;                             // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                ForceSkipAssets;                                   // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPlatformExternAssets>          AddExternAssetsToPlatform;                         // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TSet<class FString>                           ExternFilesToIgnore;                               // 0x00D8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPakInternalInfo                       InternalFiles;                                     // 0x0128(0x0006)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCookShaderOptions                     CookShaderOptions;                                 // 0x0130(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAssetRegistryOptions                  AssetRegistryOptions;                              // 0x0158(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_188[0x10];                                     // 0x0188(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChunkInfo;

// ScriptStruct HotPatcherRuntime.PakCommand
// 0x0058 (0x0058 - 0x0000)
struct FPakCommand final
{
public:
	class FString                                 ChunkName;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MountPath;                                         // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetPackage;                                      // 0x0020(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         PakCommands;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         IoStoreCommands;                                   // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPakCommand;

// ScriptStruct HotPatcherRuntime.PakFileProxy
// 0x0048 (0x0048 - 0x0000)
struct FPakFileProxy final
{
public:
	class FString                                 ChunkStoreName;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETargetPlatform                               Platform;                                          // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StorageDirectory;                                  // 0x0018(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPakCommand>                    PakCommands;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         IoStoreCommands;                                   // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPakFileProxy;

// ScriptStruct HotPatcherRuntime.CookerConfig
// 0x0088 (0x0088 - 0x0000)
struct FCookerConfig final
{
public:
	class FString                                 EngineBin;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProjectPath;                                       // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EngineParams;                                      // 0x0020(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         CookPlatforms;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bCookAllMap;                                       // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CookMaps;                                          // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         CookFilter;                                        // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         CookSettings;                                      // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Options;                                           // 0x0078(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCookerConfig;

// ScriptStruct HotPatcherRuntime.PatcherEntitySettingBase
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FPatcherEntitySettingBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPatcherEntitySettingBase;

// ScriptStruct HotPatcherRuntime.HotPatcherSettingBase
// 0x00C0 (0x00C8 - 0x0008)
struct FHotPatcherSettingBase : public FPatcherEntitySettingBase
{
public:
	struct FAssetScanConfig                       AssetScanConfig;                                   // 0x0008(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bStorageConfig;                                    // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDirectoryPath                         SavePath;                                          // 0x0098(0x0010)(Edit, NativeAccessSpecifierPublic)
	EHashCalculator                               HashCalculator;                                    // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStandaloneMode;                                   // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         AdditionalCommandletArgs;                          // 0x00B0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bOptionalPatch;                                    // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRepatch;                                          // 0x00C1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRestart;                                          // 0x00C2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPackBase;                                         // 0x00C3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClearAllVersionList;                              // 0x00C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHotPatcherSettingBase;

// ScriptStruct HotPatcherRuntime.CookAdvancedOptions
// 0x0058 (0x0058 - 0x0000)
struct FCookAdvancedOptions final
{
public:
	bool                                          bCookParallelSerialize;                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumberOfAssetsPerFrame;                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UClass*, int32>                    OverrideNumberOfAssetsPerFrame;                    // 0x0008(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCookAdvancedOptions;

// ScriptStruct HotPatcherRuntime.UnrealPakSettings
// 0x0028 (0x0028 - 0x0000)
struct FUnrealPakSettings final
{
public:
	TArray<class FString>                         UnrealPakListOptions;                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         UnrealCommandletOptions;                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bStoragePakList;                                   // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FUnrealPakSettings;

// ScriptStruct HotPatcherRuntime.ReplaceText
// 0x0028 (0x0028 - 0x0000)
struct FReplaceText final
{
public:
	class FString                                 From;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 To;                                                // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESearchCaseMode                               SearchCase;                                        // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FReplaceText;

// ScriptStruct HotPatcherRuntime.ExportPatchSettings
// 0x0340 (0x0408 - 0x00C8)
struct FExportPatchSettings final : public FHotPatcherSettingBase
{
public:
	bool                                          bByBaseVersion;                                    // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFilePath                              BaseVersion;                                       // 0x00D0(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 VersionId;                                         // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportProjectSettings;                            // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBinariesPatch;                                    // 0x00F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBinariesPatchConfig                   BinariesPatchConfig;                               // 0x00F8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_148[0x6];                                      // 0x0148(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIncludeEngineIni;                                 // 0x014E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludePluginIni;                                 // 0x014F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeProjectIni;                                // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableExternFilesDiff;                            // 0x0151(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         IgnoreDeletionModulesAsset;                        // 0x0158(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPlatformExternAssets>          AddExternAssetsToPlatform;                         // 0x0168(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TSet<class FString>                           ExternFilesToIgnore;                               // 0x0178(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bIncludePakVersionFile;                            // 0x01C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PakVersionFileMountPoint;                          // 0x01D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableChunk;                                      // 0x01E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateDefaultChunk;                               // 0x01E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FChunkInfo>                     ChunkInfos;                                        // 0x01E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bCookPatchAssets;                                  // 0x01F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCookAdvancedOptions                   CookAdvancedOptions;                               // 0x0200(0x0058)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FCookShaderOptions                     CookShaderOptions;                                 // 0x0258(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAssetRegistryOptions                  SerializeAssetRegistryOptions;                     // 0x0280(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FIoStoreSettings                       IoStoreSettings;                                   // 0x02B0(0x0080)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FUnrealPakSettings                     UnrealPakSettings;                                 // 0x0330(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<class FString>                         DefaultPakListOptions;                             // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         DefaultCommandletOptions;                          // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FPakEncryptSettings                    EncryptSettings;                                   // 0x0378(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FReplaceText>                   ReplacePakListTexts;                               // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<ETargetPlatform>                       PakTargetPlatforms;                                // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bCustomPakNameRegular;                             // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PakNameRegular;                                    // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCustomPakSaveDirRegular;                          // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PakSaveDirRegular;                                 // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStorageNewRelease;                                // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStoragePakFileInfo;                               // 0x03E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreDeletedAssetsInfo;                          // 0x03E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStorageDeletedAssetsToNewReleaseJson;             // 0x03E3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStorageDiffAnalysisResults;                       // 0x03E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E5[0x1];                                      // 0x03E5(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableProfiling;                                  // 0x03E6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E7[0x1];                                      // 0x03E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StorageCookedDir;                                  // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OptionalSign;                                      // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FExportPatchSettings;

// ScriptStruct HotPatcherRuntime.PatherResult
// 0x0010 (0x0010 - 0x0000)
struct FPatherResult final
{
public:
	TArray<struct FAssetDetail>                   PatcherAssetDetails;                               // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPatherResult;

// ScriptStruct HotPatcherRuntime.PlatformPakListFiles
// 0x0038 (0x0038 - 0x0000)
struct FPlatformPakListFiles final
{
public:
	ETargetPlatform                               TargetPlatform;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFilePath>                      PakResponseFiles;                                  // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFilePath>                      PakFiles;                                          // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 AESKey;                                            // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPlatformPakListFiles;

// ScriptStruct HotPatcherRuntime.ExportReleaseSettings
// 0x0060 (0x0128 - 0x00C8)
struct FExportReleaseSettings final : public FHotPatcherSettingBase
{
public:
	class FString                                 VersionId;                                         // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ByPakList;                                         // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPlatformPakListFiles>          PlatformsPakListFiles;                             // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bImportProjectSettings;                            // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPlatformExternAssets>          AddExternAssetsToPlatform;                         // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bBackupMetadata;                                   // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBackupProjectConfig;                              // 0x0109(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ETargetPlatform>                       BackupMetadataPlatforms;                           // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bNoShaderCompile;                                  // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FExportReleaseSettings;

// ScriptStruct HotPatcherRuntime.HotPatcherAssetDependency
// 0x0038 (0x0038 - 0x0000)
struct FHotPatcherAssetDependency final
{
public:
	struct FAssetDetail                           Asset;                                             // 0x0000(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FAssetDetail>                   AssetReference;                                    // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAssetDetail>                   AssetDependency;                                   // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHotPatcherAssetDependency;

// ScriptStruct HotPatcherRuntime.HotPatcherVersion
// 0x0118 (0x0118 - 0x0000)
struct FHotPatcherVersion final
{
public:
	class FString                                 VersionId;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
