#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: HoudiniEngineRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "HoudiniEngineRuntime_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// Class HoudiniEngineRuntime.HoudiniAssetParameter
// 0x0058 (0x0080 - 0x0028)
class UHoudiniAssetParameter : public UObject
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameter")
	}
	static class UHoudiniAssetParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameter>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameter;

// Class HoudiniEngineRuntime.HoudiniParameter
// 0x00E0 (0x0108 - 0x0028)
class UHoudiniParameter : public UObject
{
public:
	class FString                                 Name_0;                                            // 0x0028(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 Label;                                             // 0x0038(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniParameterType                         ParmType;                                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	uint32                                        TupleSize;                                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NodeId;                                            // 0x0050(0x0004)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ParmId;                                            // 0x0054(0x0004)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ParentParmId;                                      // 0x0058(0x0004)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ChildIndex;                                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsVisible;                                        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsParentFolderVisible;                            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsDisabled;                                       // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasChanged;                                       // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNeedsToTriggerUpdate;                             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsDefault;                                        // 0x0065(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSpare;                                          // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bJoinNext;                                         // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsChildOfMultiParm;                               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsDirectChildOfMultiParm;                         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPendingRevertToDefault;                           // 0x006A(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<int32>                                 TuplePendingRevertToDefault;                       // 0x0070(0x0010)(ZeroConstructor, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	class FString                                 Help;                                              // 0x0080(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        TagCount;                                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ValueIndex;                                        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasExpression;                                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowExpression;                                   // 0x0099(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 ParamExpression;                                   // 0x00A0(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FString, class FString>            Tags;                                              // 0x00B0(0x0050)(Protected, NativeAccessSpecifierProtected)
	bool                                          bAutoUpdate;                                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniParameter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniParameter")
	}
	static class UHoudiniParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniParameter>();
	}
};
DUMPER7_ASSERTS_UHoudiniParameter;

// Class HoudiniEngineRuntime.HoudiniParameterChoice
// 0x0070 (0x0178 - 0x0108)
class UHoudiniParameterChoice final : public UHoudiniParameter
{
public:
	int32                                         IntValue;                                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DefaultIntValue;                                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 StringValue;                                       // 0x0110(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 DefaultStringValue;                                // 0x0120(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FString>                         StringChoiceValues;                                // 0x0130(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FString>                         StringChoiceLabels;                                // 0x0140(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_150[0x10];                                     // 0x0150(0x0010)(Fixing Size After Last Property [ Dumper-DNA ])
	bool                                          bIsChildOfRamp;                                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<int32>                                 IntValuesArray;                                    // 0x0168(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniParameterChoice")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniParameterChoice")
	}
	static class UHoudiniParameterChoice* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniParameterChoice>();
	}
};
DUMPER7_ASSERTS_UHoudiniParameterChoice;

// Class HoudiniEngineRuntime.HoudiniAsset
// 0x0028 (0x0050 - 0x0028)
class UHoudiniAsset final : public UObject
{
public:
	class FString                                 AssetFileName;                                     // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 AssetBytes;                                        // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint32                                        AssetBytesCount;                                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAssetLimitedCommercial;                           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAssetNonCommercial;                               // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAssetExpanded;                                    // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAsset")
	}
	static class UHoudiniAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAsset>();
	}
};
DUMPER7_ASSERTS_UHoudiniAsset;

// Class HoudiniEngineRuntime.HoudiniAssetParameterChoice
// 0x0038 (0x00B8 - 0x0080)
class UHoudiniAssetParameterChoice final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0x38];                                      // 0x0080(0x0038)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterChoice")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterChoice")
	}
	static class UHoudiniAssetParameterChoice* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterChoice>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterChoice;

// Class HoudiniEngineRuntime.HoudiniParameterFile
// 0x0038 (0x0140 - 0x0108)
class UHoudiniParameterFile final : public UHoudiniParameter
{
public:
	TArray<class FString>                         Values;                                            // 0x0108(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FString>                         DefaultValues;                                     // 0x0118(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class FString                                 Filters;                                           // 0x0128(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsReadOnly;                                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniParameterFile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniParameterFile")
	}
	static class UHoudiniParameterFile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniParameterFile>();
	}
};
DUMPER7_ASSERTS_UHoudiniParameterFile;

// Class HoudiniEngineRuntime.HoudiniAssetActor
// 0x0008 (0x02A8 - 0x02A0)
class AHoudiniAssetActor final : public AActor
{
public:
	class UHoudiniAssetComponent*                 HoudiniAssetComponent;                             // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetActor")
	}
	static class AHoudiniAssetActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHoudiniAssetActor>();
	}
};
DUMPER7_ASSERTS_AHoudiniAssetActor;

// Class HoudiniEngineRuntime.HoudiniAssetComponent
// 0x04C0 (0x0930 - 0x0470)
class UHoudiniAssetComponent : public UPrimitiveComponent
{
public:
	uint8                                         Pad_468[0x8];                                      // 0x0468(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	class UHoudiniAsset*                          HoudiniAsset;                                      // 0x0470(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookOnParameterChange;                            // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUploadTransformsToHoudiniEngine;                  // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookOnTransformChange;                            // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookOnAssetInputCook;                             // 0x047B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputless;                                       // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputTemplateGeos;                               // 0x047D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOutputNodes;                                   // 0x047E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_47F[0x1];                                      // 0x047F(0x0001)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FDirectoryPath                         TemporaryCookFolder;                               // 0x0480(0x0010)(NativeAccessSpecifierPublic)
	struct FDirectoryPath                         BakeFolder;                                        // 0x0490(0x0010)(NativeAccessSpecifierPublic)
	EHoudiniStaticMeshMethod                      StaticMeshMethod;                                  // 0x04A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FHoudiniStaticMeshGenerationProperties StaticMeshGenerationProperties;                    // 0x04A8(0x01A8)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMeshBuildSettings                     StaticMeshBuildSettings;                           // 0x0650(0x0030)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideGlobalProxyStaticMeshSettings;            // 0x0680(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshOverride;                    // 0x0681(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshRefinementByTimerOverride;   // 0x0682(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_683[0x1];                                      // 0x0683(0x0001)(Fixing Size After Last Property [ Dumper-DNA ])
	float                                         ProxyMeshAutoRefineTimeoutSecondsOverride;         // 0x0684(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshRefinementOnPreSaveWorldOverride; // 0x0688(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshRefinementOnPreBeginPIEOverride; // 0x0689(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68A[0x2];                                      // 0x068A(0x0002)(Fixing Size After Last Property [ Dumper-DNA ])
	int32                                         AssetId;                                           // 0x068C(0x0004)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<int32>                                 NodeIdsToCook;                                     // 0x0690(0x0010)(ZeroConstructor, Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	TMap<int32, int32>                            OutputNodeCookCounts;                              // 0x06A0(0x0050)(Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	TSet<class UHoudiniAssetComponent*>           DownstreamHoudiniAssets;                           // 0x06F0(0x0050)(ExportObject, DuplicateTransient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FGUID                                  ComponentGUID;                                     // 0x0740(0x0010)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGUID                                  HapiGUID;                                          // 0x0750(0x0010)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 HapiAssetName;                                     // 0x0760(0x0010)(ZeroConstructor, DuplicateTransient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniAssetState                            AssetState;                                        // 0x0770(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniAssetState                            DebugLastAssetState;                               // 0x0771(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniAssetStateResult                      AssetStateResult;                                  // 0x0772(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_773[0xD];                                      // 0x0773(0x000D)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FTransform                             LastComponentTransform;                            // 0x0780(0x0030)(DuplicateTransient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint32                                        SubAssetIndex;                                     // 0x07B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         AssetCookCount;                                    // 0x07B4(0x0004)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasBeenLoaded;                                    // 0x07B8(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasBeenDuplicated;                                // 0x07B9(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPendingDelete;                                    // 0x07BA(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRecookRequested;                                  // 0x07BB(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRebuildRequested;                                 // 0x07BC(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableCooking;                                    // 0x07BD(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceNeedUpdate;                                  // 0x07BE(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLastCookSuccess;                                  // 0x07BF(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bParameterDefinitionUpdateNeeded;                  // 0x07C0(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBlueprintStructureModified;                       // 0x07C1(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBlueprintModified;                                // 0x07C2(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C3[0x5];                                      // 0x07C3(0x0005)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<class UHoudiniParameter*>              Parameters;                                        // 0x07C8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UHoudiniInput*>                  Inputs;                                            // 0x07D8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UHoudiniOutput*>                 Outputs;                                           // 0x07E8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FHoudiniBakedOutput>            BakedOutputs;                                      // 0x07F8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AActor>>          UntrackedOutputs;                                  // 0x0808(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UHoudiniHandleComponent*>        HandleComponents;                                  // 0x0818(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          bHasComponentTransformChanged;                     // 0x0828(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFullyLoaded;                                      // 0x0829(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_82A[0x6];                                      // 0x082A(0x0006)(Fixing Size After Last Property [ Dumper-DNA ])
	class UHoudiniPDGAssetLink*                   PDGAssetLink;                                      // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                           RefineMeshesTimer;                                 // 0x0838(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_840[0x18];                                     // 0x0840(0x0018)(Fixing Size After Last Property [ Dumper-DNA ])
	bool                                          bNoProxyMeshNextCookRequested;                     // 0x0858(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_859[0x7];                                      // 0x0859(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	TMap<class UObject*, int32>                   InputPresets;                                      // 0x0860(0x0050)(Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	bool                                          bBakeAfterNextCook;                                // 0x08B0(0x0001)(ZeroConstructor, DuplicateTransient, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniBakeAfterNextCook                     BakeAfterNextCook;                                 // 0x08B1(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8B2[0x4E];                                     // 0x08B2(0x004E)(Fixing Size After Last Property [ Dumper-DNA ])
	bool                                          bCachedIsPreview;                                  // 0x0900(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_901[0xF];                                      // 0x0901(0x000F)(Fixing Size After Last Property [ Dumper-DNA ])
	double                                        LastTickTime;                                      // 0x0910(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_918[0x18];                                     // 0x0918(0x0018)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetComponent")
	}
	static class UHoudiniAssetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetComponent>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetComponent;

// Class HoudiniEngineRuntime.HoudiniAssetBlueprintComponent
// 0x0100 (0x0A30 - 0x0930)
class UHoudiniAssetBlueprintComponent final : public UHoudiniAssetComponent
{
public:
	uint8                                         Pad_930[0x48];                                     // 0x0930(0x0048)(Fixing Size After Last Property [ Dumper-DNA ])
	bool                                          FauxBPProperty;                                    // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHoudiniAssetChanged;                              // 0x0979(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUpdatedFromTemplate;                              // 0x097A(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsInBlueprintEditor;                              // 0x097B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanDeleteHoudiniNodes;                            // 0x097C(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasRegisteredComponentTemplate;                   // 0x097D(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_97E[0xA];                                      // 0x097E(0x000A)(Fixing Size After Last Property [ Dumper-DNA ])
	TMap<struct FHoudiniOutputObjectIdentifier, struct FGUID> CachedOutputNodes;                     // 0x0988(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<struct FGUID, struct FGUID>              CachedInputNodes;                                  // 0x09D8(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A28[0x8];                                      // 0x0A28(0x0008)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	bool HasParameter(const class FString& Name_0);
	void SetFloatParameter(const class FString& Name_0, float Value, int32 Index_0);
	void SetToggleValueAt(const class FString& Name_0, bool Value, int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetBlueprintComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetBlueprintComponent")
	}
	static class UHoudiniAssetBlueprintComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetBlueprintComponent>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetBlueprintComponent;

// Class HoudiniEngineRuntime.HoudiniAssetParameterButton
// 0x0000 (0x0080 - 0x0080)
class UHoudiniAssetParameterButton final : public UHoudiniAssetParameter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterButton")
	}
	static class UHoudiniAssetParameterButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterButton>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterButton;

// Class HoudiniEngineRuntime.HoudiniAssetParameterColor
// 0x0010 (0x0090 - 0x0080)
class UHoudiniAssetParameterColor final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterColor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterColor")
	}
	static class UHoudiniAssetParameterColor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterColor>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterColor;

// Class HoudiniEngineRuntime.HoudiniAssetParameterFile
// 0x0028 (0x00A8 - 0x0080)
class UHoudiniAssetParameterFile final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0x28];                                      // 0x0080(0x0028)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterFile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterFile")
	}
	static class UHoudiniAssetParameterFile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterFile>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterFile;

// Class HoudiniEngineRuntime.HoudiniAssetParameterFloat
// 0x0038 (0x00B8 - 0x0080)
class UHoudiniAssetParameterFloat final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0x38];                                      // 0x0080(0x0038)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterFloat")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterFloat")
	}
	static class UHoudiniAssetParameterFloat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterFloat>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterFloat;

// Class HoudiniEngineRuntime.HoudiniAssetParameterFolder
// 0x0000 (0x0080 - 0x0080)
class UHoudiniAssetParameterFolder final : public UHoudiniAssetParameter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterFolder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterFolder")
	}
	static class UHoudiniAssetParameterFolder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterFolder>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterFolder;

// Class HoudiniEngineRuntime.HoudiniAssetParameterFolderList
// 0x0000 (0x0080 - 0x0080)
class UHoudiniAssetParameterFolderList final : public UHoudiniAssetParameter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterFolderList")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterFolderList")
	}
	static class UHoudiniAssetParameterFolderList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterFolderList>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterFolderList;

// Class HoudiniEngineRuntime.HoudiniAssetParameterInt
// 0x0030 (0x00B0 - 0x0080)
class UHoudiniAssetParameterInt final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0x30];                                      // 0x0080(0x0030)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterInt")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterInt")
	}
	static class UHoudiniAssetParameterInt* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterInt>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterInt;

// Class HoudiniEngineRuntime.HoudiniAssetParameterLabel
// 0x0000 (0x0080 - 0x0080)
class UHoudiniAssetParameterLabel final : public UHoudiniAssetParameter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterLabel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterLabel")
	}
	static class UHoudiniAssetParameterLabel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterLabel>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterLabel;

// Class HoudiniEngineRuntime.HoudiniAssetParameterMultiparm
// 0x0008 (0x0088 - 0x0080)
class UHoudiniAssetParameterMultiparm final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterMultiparm")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterMultiparm")
	}
	static class UHoudiniAssetParameterMultiparm* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterMultiparm>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterMultiparm;

// Class HoudiniEngineRuntime.HoudiniAssetParameterRamp
// 0x0018 (0x0098 - 0x0080)
class UHoudiniAssetParameterRamp final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0x18];                                      // 0x0080(0x0018)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterRamp")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterRamp")
	}
	static class UHoudiniAssetParameterRamp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterRamp>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterRamp;

// Class HoudiniEngineRuntime.HoudiniAssetParameterSeparator
// 0x0000 (0x0080 - 0x0080)
class UHoudiniAssetParameterSeparator final : public UHoudiniAssetParameter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterSeparator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterSeparator")
	}
	static class UHoudiniAssetParameterSeparator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterSeparator>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterSeparator;

// Class HoudiniEngineRuntime.HoudiniAssetParameterString
// 0x0010 (0x0090 - 0x0080)
class UHoudiniAssetParameterString final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterString")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterString")
	}
	static class UHoudiniAssetParameterString* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterString>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterString;

// Class HoudiniEngineRuntime.HoudiniAssetParameterToggle
// 0x0010 (0x0090 - 0x0080)
class UHoudiniAssetParameterToggle final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetParameterToggle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetParameterToggle")
	}
	static class UHoudiniAssetParameterToggle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterToggle>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetParameterToggle;

// Class HoudiniEngineRuntime.HoudiniAssetComponentMaterials_V1
// 0x00A0 (0x00C8 - 0x0028)
class UHoudiniAssetComponentMaterials_V1 final : public UObject
{
public:
	uint8                                         Pad_28[0xA0];                                      // 0x0028(0x00A0)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetComponentMaterials_V1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetComponentMaterials_V1")
	}
	static class UHoudiniAssetComponentMaterials_V1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetComponentMaterials_V1>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetComponentMaterials_V1;

// Class HoudiniEngineRuntime.HoudiniHandleComponent_V1
// 0x0090 (0x0280 - 0x01F0)
class UHoudiniHandleComponent_V1 final : public USceneComponent
{
public:
	uint8                                         Pad_1F0[0x90];                                     // 0x01F0(0x0090)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniHandleComponent_V1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniHandleComponent_V1")
	}
	static class UHoudiniHandleComponent_V1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniHandleComponent_V1>();
	}
};
DUMPER7_ASSERTS_UHoudiniHandleComponent_V1;

// Class HoudiniEngineRuntime.HoudiniSplineComponent_V1
// 0x00F0 (0x02E0 - 0x01F0)
class UHoudiniSplineComponent_V1 final : public USceneComponent
{
public:
	uint8                                         Pad_1F0[0xF0];                                     // 0x01F0(0x00F0)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniSplineComponent_V1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniSplineComponent_V1")
	}
	static class UHoudiniSplineComponent_V1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniSplineComponent_V1>();
	}
};
DUMPER7_ASSERTS_UHoudiniSplineComponent_V1;

// Class HoudiniEngineRuntime.HoudiniAssetInput
// 0x0120 (0x01A0 - 0x0080)
class UHoudiniAssetInput final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0x120];                                     // 0x0080(0x0120)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetInput")
	}
	static class UHoudiniAssetInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetInput>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetInput;

// Class HoudiniEngineRuntime.HoudiniAssetInstanceInput
// 0x00E0 (0x0160 - 0x0080)
class UHoudiniAssetInstanceInput final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0xE0];                                      // 0x0080(0x00E0)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetInstanceInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetInstanceInput")
	}
	static class UHoudiniAssetInstanceInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetInstanceInput>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetInstanceInput;

// Class HoudiniEngineRuntime.HoudiniAssetInstanceInputField
// 0x0168 (0x0190 - 0x0028)
class UHoudiniAssetInstanceInputField final : public UObject
{
public:
	uint8                                         Pad_28[0x168];                                     // 0x0028(0x0168)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetInstanceInputField")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetInstanceInputField")
	}
	static class UHoudiniAssetInstanceInputField* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetInstanceInputField>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetInstanceInputField;

// Class HoudiniEngineRuntime.HoudiniAssetComponent_V1
// 0x0510 (0x0980 - 0x0470)
class UHoudiniAssetComponent_V1 final : public UPrimitiveComponent
{
public:
	uint8                                         bGeneratedDoubleSidedGeometry : 1;                 // 0x0468(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class UPhysicalMaterial*                      GeneratedPhysMaterial;                             // 0x0470(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBodyInstance                          DefaultBodyInstance;                               // 0x0478(0x0158)(Edit, NativeAccessSpecifierPublic)
	ECollisionTraceFlag                           GeneratedCollisionTraceFlag;                       // 0x05D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D1[0x3];                                      // 0x05D1(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	int32                                         GeneratedLightMapResolution;                       // 0x05D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GeneratedDistanceFieldResolutionScale;             // 0x05D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWalkableSlopeOverride                 GeneratedWalkableSlopeOverride;                    // 0x05DC(0x0010)(Edit, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	int32                                         GeneratedLightMapCoordinateIndex;                  // 0x05EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bGeneratedUseMaximumStreamingTexelRatio : 1;       // 0x05F0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_5F1[0x3];                                      // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	float                                         GeneratedStreamingDistanceMultiplier;              // 0x05F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFoliageType_InstancedStaticMesh*       GeneratedFoliageDefaultSettings;                   // 0x05F8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAssetUserData*>                 GeneratedAssetUserData;                            // 0x0600(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, NativeAccessSpecifierPublic)
	class FText                                   BakeFolder;                                        // 0x0610(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   TempCookFolder;                                    // 0x0628(0x0018)(NativeAccessSpecifierPublic)
	uint8                                         Pad_640[0x340];                                    // 0x0640(0x0340)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniAssetComponent_V1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniAssetComponent_V1")
	}
	static class UHoudiniAssetComponent_V1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetComponent_V1>();
	}
};
DUMPER7_ASSERTS_UHoudiniAssetComponent_V1;

// Class HoudiniEngineRuntime.HoudiniInstancedActorComponent_V1
// 0x0020 (0x0210 - 0x01F0)
class UHoudiniInstancedActorComponent_V1 final : public USceneComponent
{
public:
	uint8                                         Pad_1F0[0x20];                                     // 0x01F0(0x0020)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniInstancedActorComponent_V1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniInstancedActorComponent_V1")
	}
	static class UHoudiniInstancedActorComponent_V1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniInstancedActorComponent_V1>();
	}
};
DUMPER7_ASSERTS_UHoudiniInstancedActorComponent_V1;

// Class HoudiniEngineRuntime.HoudiniMeshSplitInstancerComponent_V1
// 0x0020 (0x0210 - 0x01F0)
class UHoudiniMeshSplitInstancerComponent_V1 final : public USceneComponent
{
public:
	uint8                                         Pad_1F0[0x20];                                     // 0x01F0(0x0020)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniMeshSplitInstancerComponent_V1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniMeshSplitInstancerComponent_V1")
	}
	static class UHoudiniMeshSplitInstancerComponent_V1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniMeshSplitInstancerComponent_V1>();
	}
};
DUMPER7_ASSERTS_UHoudiniMeshSplitInstancerComponent_V1;

// Class HoudiniEngineRuntime.HoudiniEngineCopyPropertiesInterface
// 0x0000 (0x0000 - 0x0000)
class IHoudiniEngineCopyPropertiesInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniEngineCopyPropertiesInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniEngineCopyPropertiesInterface")
	}
	static class IHoudiniEngineCopyPropertiesInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHoudiniEngineCopyPropertiesInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IHoudiniEngineCopyPropertiesInterface;

// Class HoudiniEngineRuntime.HoudiniHandleParameter
// 0x0010 (0x0038 - 0x0028)
class UHoudiniHandleParameter final : public UObject
{
public:
	class UHoudiniParameter*                      AssetParameter;                                    // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TupleIndex;                                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniHandleParameter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniHandleParameter")
	}
	static class UHoudiniHandleParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniHandleParameter>();
	}
};
DUMPER7_ASSERTS_UHoudiniHandleParameter;

// Class HoudiniEngineRuntime.HoudiniHandleComponent
// 0x0040 (0x0230 - 0x01F0)
class UHoudiniHandleComponent final : public USceneComponent
{
public:
	TArray<class UHoudiniHandleParameter*>        XformParms;                                        // 0x01F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UHoudiniHandleParameter*                RSTParm;                                           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHoudiniHandleParameter*                RotOrderParm;                                      // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniHandleType                            HandleType;                                        // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 HandleName;                                        // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoudiniHandleComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoudiniHandleComponent")
	}
	static class UHoudiniHandleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniHandleComponent>();
	}
};
DUMPER7_ASSERTS_UHoudiniHandleComponent;

// Class HoudiniEngineRuntime.HoudiniInput
// 0x0200 (0x0228 - 0x0028)
class UHoudiniInput final : public UObject
{
public:
	class FString                                 Name_0;                                            // 0x0028(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 Label;                                             // 0x0038(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniInputType                             Type;                                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniInputType                             PreviousType;                                      // 0x0049(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-DNA ])
	int32                                         AssetNodeId;                                       // 0x004C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InputNodeId;                                       // 0x0050(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InputIndex;                                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ParmId;                                            // 0x0058(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsObjectPathParameter;                            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<int32>                                 CreatedDataNodeIds;                                // 0x0060(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NonTransactional, Protected, NativeAccessSpecifierProtected)
	bool                                          bHasChanged;                                       // 0x0070(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNeedsToTriggerUpdate;                             // 0x0071(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-DNA ])
