#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JJYYNiagaraUIParticle

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "Niagara_classes.hpp"
#include "JJYYNiagaraUIParticle_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class JJYYNiagaraUIParticle.JJYYMaterialInstanceConstant
// 0x0000 (0x0358 - 0x0358)
class UJJYYMaterialInstanceConstant final : public UMaterialInstanceConstant
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JJYYMaterialInstanceConstant")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JJYYMaterialInstanceConstant")
	}
	static class UJJYYMaterialInstanceConstant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJJYYMaterialInstanceConstant>();
	}
};
DUMPER7_ASSERTS_UJJYYMaterialInstanceConstant;

// Class JJYYNiagaraUIParticle.JJYYNiagaraComponent
// 0x0000 (0x0650 - 0x0650)
class UJJYYNiagaraComponent final : public UNiagaraComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JJYYNiagaraComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JJYYNiagaraComponent")
	}
	static class UJJYYNiagaraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJJYYNiagaraComponent>();
	}
};
DUMPER7_ASSERTS_UJJYYNiagaraComponent;

// Class JJYYNiagaraUIParticle.JJYYNiagaraWidget
// 0x0038 (0x0170 - 0x0138)
class UJJYYNiagaraWidget final : public UWidget
{
public:
	class UNiagaraSystem*                         NiagaraSystem;                                     // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAutoActivate : 1;                                 // 0x0140(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSlateMeshData>                 MeshData;                                          // 0x0148(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_158[0x10];                                     // 0x0158(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UJJYYNiagaraComponent*                  NiagaraComponent;                                  // 0x0168(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetAutoActivate(bool bInAutoActivate);
	void UpdateNiagaraSystem(class UNiagaraSystem* NewNiagaraSystem);

	bool GetAutoActivate() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JJYYNiagaraWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JJYYNiagaraWidget")
	}
	static class UJJYYNiagaraWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJJYYNiagaraWidget>();
	}
};
DUMPER7_ASSERTS_UJJYYNiagaraWidget;

}

