#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: KawaiiInterface

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function KawaiiInterface.KawaiiInterface_C.NewKawaiiLayer
// 0x0048 (0x0048 - 0x0000)
struct KawaiiInterface_C_NewKawaiiLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          bEnableKawaiiSetting;                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 CurrentKawaiiState;                                // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UPlayerAnimInstance*                    OwnerInstance;                                     // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPhantom;                                         // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FPoseLink                              NewKawaiiLayer_0;                                  // 0x0038(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_KawaiiInterface_C_NewKawaiiLayer;

// Function KawaiiInterface.KawaiiInterface_C.ChestLayer
// 0x0020 (0x0020 - 0x0000)
struct KawaiiInterface_C_ChestLayer final
{
public:
	struct FPoseLink                              InPose_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ChestLayer_0;                                      // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_KawaiiInterface_C_ChestLayer;

// Function KawaiiInterface.KawaiiInterface_C.InteractiveKawaiiLayer
// 0x0040 (0x0040 - 0x0000)
struct KawaiiInterface_C_InteractiveKawaiiLayer final
{
public:
	struct FPoseLink                              InPose_2;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          bEnableKawaiiSetting;                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 CurrentKawaiiState;                                // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UPlayerAnimInstance*                    OwnerInstance1;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              InteractiveKawaiiLayer_0;                          // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_KawaiiInterface_C_InteractiveKawaiiLayer;

}

