#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: MagicLeapPlanes

#include "Basic.hpp"

#include "MagicLeapPlanes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MagicLeapPlanes.MagicLeapPlanesComponent
// 0x0070 (0x0260 - 0x01F0)
class UMagicLeapPlanesComponent final : public USceneComponent
{
public:
	TArray<EMagicLeapPlaneQueryFlags>             QueryFlags;                                        // 0x01F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UBoxComponent*                          SearchVolume;                                      // 0x0200(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxResults;                                        // 0x0208(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinHolePerimeter;                                  // 0x020C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinPlaneArea;                                      // 0x0210(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMagicLeapPlaneQueryType                      QueryType;                                         // 0x0214(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	float                                         SimilarityThreshold;                               // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	TMulticastInlineDelegate<void(const bool bSuccess, const TArray<struct FMagicLeapPlaneResult>& Planes, const TArray<struct FMagicLeapPlaneBoundaries>& Polygons)> OnPlanesQueryResult; // 0x0220(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const bool bSuccess, const struct FGUID& QueryHandle, const EMagicLeapPlaneQueryType QueryType, const TArray<struct FMagicLeapPlaneResult>& NewPlanes, const TArray<struct FGUID>& RemovedPlaneIDs, const TArray<struct FMagicLeapPlaneBoundaries>& NewPolygons, const TArray<struct FGUID>& RemovedPolygonIDs)> OnPersistentPlanesQueryResult; // 0x0230(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_240[0x20];                                     // 0x0240(0x0020)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	bool RequestPlanesAsync();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapPlanesComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapPlanesComponent")
	}
	static class UMagicLeapPlanesComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapPlanesComponent>();
	}
};
DUMPER7_ASSERTS_UMagicLeapPlanesComponent;

// Class MagicLeapPlanes.MagicLeapPlanesFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMagicLeapPlanesFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FGUID AddPersistentQuery(EMagicLeapPlaneQueryType PersistentQueryType);
	static bool CreateTracker();
	static bool DestroyTracker();
	static struct FTransform GetContentScale(const class AActor* ContentActor, const struct FMagicLeapPlaneResult& PlaneResult);
	static bool IsTrackerValid();
	static bool PlanesPersistentQueryBeginAsync(const struct FMagicLeapPlanesQuery& Query, const struct FGUID& Handle, const TDelegate<void(const bool bSuccess, const struct FGUID& QueryHandle, const EMagicLeapPlaneQueryType QueryType, const TArray<struct FMagicLeapPlaneResult>& NewPlanes, const TArray<struct FGUID>& RemovedPlaneIDs, const TArray<struct FMagicLeapPlaneBoundaries>& NewPolygons, const TArray<struct FGUID>& RemovedPolygonIDs)>& ResultDelegate);
	static bool PlanesQueryBeginAsync(const struct FMagicLeapPlanesQuery& Query, const TDelegate<void(const bool bSuccess, const TArray<struct FMagicLeapPlaneResult>& Planes, const TArray<struct FMagicLeapPlaneBoundaries>& Polygons)>& ResultDelegate);
	static void RemoveFlagsNotInQuery(const TArray<EMagicLeapPlaneQueryFlags>& InQueryFlags, const TArray<EMagicLeapPlaneQueryFlags>& InResultFlags, TArray<EMagicLeapPlaneQueryFlags>* OutFlags);
	static bool RemovePersistentQuery(const struct FGUID& Handle);
	static void ReorderPlaneFlags(const TArray<EMagicLeapPlaneQueryFlags>& InPriority, const TArray<EMagicLeapPlaneQueryFlags>& InFlagsToReorder, TArray<EMagicLeapPlaneQueryFlags>* OutReorderedFlags);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapPlanesFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapPlanesFunctionLibrary")
	}
	static class UMagicLeapPlanesFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapPlanesFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UMagicLeapPlanesFunctionLibrary;

}

