#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: MagicLeapImageTracker

#include "Basic.hpp"

#include "MagicLeapImageTracker_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MagicLeapImageTracker.MagicLeapImageTrackerComponent
// 0x0080 (0x0270 - 0x01F0)
class UMagicLeapImageTrackerComponent final : public USceneComponent
{
public:
	class UTexture2D*                             TargetImageTexture;                                // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x01F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LongerDimension;                                   // 0x0208(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsStationary;                                     // 0x020C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseUnreliablePose;                                // 0x020D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMagicLeapImageTargetOrientation              AxisOrientation;                                   // 0x020E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20F[0x1];                                      // 0x020F(0x0001)(Fixing Size After Last Property [ Dumper-DNA ])
	TMulticastInlineDelegate<void()>              OnSetImageTargetSucceeded;                         // 0x0210(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnSetImageTargetFailed;                            // 0x0220(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnImageTargetFound;                                // 0x0230(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnImageTargetLost;                                 // 0x0240(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FVector& LastTrackedLocation, const struct FRotator& LastTrackedRotation, const struct FVector& NewUnreliableLocation, const struct FRotator& NewUnreliableRotation)> OnImageTargetUnreliableTracking; // 0x0250(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_260[0x10];                                     // 0x0260(0x0010)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	bool RemoveTargetAsync();
	bool SetTargetAsync(class UTexture2D* ImageTarget);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapImageTrackerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapImageTrackerComponent")
	}
	static class UMagicLeapImageTrackerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapImageTrackerComponent>();
	}
};
DUMPER7_ASSERTS_UMagicLeapImageTrackerComponent;

// Class MagicLeapImageTracker.MagicLeapImageTrackerFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMagicLeapImageTrackerFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void EnableImageTracking(bool bEnable);
	static int32 GetMaxSimultaneousTargets();
	static bool IsImageTrackingEnabled();
	static void SetMaxSimultaneousTargets(int32 MaxSimultaneousTargets);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapImageTrackerFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapImageTrackerFunctionLibrary")
	}
	static class UMagicLeapImageTrackerFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapImageTrackerFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UMagicLeapImageTrackerFunctionLibrary;

}

