#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: MagicLeapARPin

#include "Basic.hpp"

#include "MagicLeapARPin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MagicLeapARPin.MagicLeapARPinComponent
// 0x01C0 (0x03B0 - 0x01F0)
class UMagicLeapARPinComponent final : public USceneComponent
{
public:
	class FString                                 ObjectUID;                                         // 0x01F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UserIndex;                                         // 0x0200(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMagicLeapAutoPinType                         AutoPinType;                                       // 0x0204(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPinActor;                                   // 0x0205(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_206[0x2];                                      // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-DNA ])
	TSubclassOf<class UMagicLeapARPinSaveGame>    PinDataClass;                                      // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<EMagicLeapARPinType>                     SearchPinTypes;                                    // 0x0210(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class USphereComponent*                       SearchVolume;                                      // 0x0260(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bRestoredOrSynced)> OnPersistentEntityPinned;                 // 0x0268(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPersistentEntityPinLost;                         // 0x0278(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bDataRestored)> OnPinDataLoadAttemptCompleted;                // 0x0288(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGUID                                  PinnedCFUID;                                       // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                        PinnedSceneComponent;                              // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMagicLeapARPinSaveGame*                PinData;                                           // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B8[0xF8];                                     // 0x02B8(0x00F8)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	bool AttemptPinDataRestoration();
	void AttemptPinDataRestorationAsync();
	class UMagicLeapARPinSaveGame* GetPinData(TSubclassOf<class UMagicLeapARPinSaveGame> PinDataClass_0);
	bool PinActor(class AActor* ActorToPin);
	bool PinSceneComponent(class USceneComponent* ComponentToPin);
	void PinToBestFit();
	bool PinToID(const struct FGUID& PinId);
	bool PinToRestoredOrSyncedID();
	class UMagicLeapARPinSaveGame* TryGetPinData(TSubclassOf<class UMagicLeapARPinSaveGame> InPinDataClass, bool* OutPinDataValid);
	void UnPin();

	bool GetPinnedPinID(struct FGUID* PinId) const;
	bool GetPinState(struct FMagicLeapARPinState* State) const;
	bool IsPinned() const;
	bool PinRestoredOrSynced() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapARPinComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapARPinComponent")
	}
	static class UMagicLeapARPinComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapARPinComponent>();
	}
};
DUMPER7_ASSERTS_UMagicLeapARPinComponent;

// Class MagicLeapARPin.MagicLeapARPinFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMagicLeapARPinFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class FString ARPinIdToString(const struct FGUID& ARPinId);
	static void BindToOnMagicLeapARPinUpdatedDelegate(const TDelegate<void(const TArray<struct FGUID>& Added, const TArray<struct FGUID>& Updated, const TArray<struct FGUID>& Deleted)>& Delegate);
	static void BindToOnMagicLeapContentBindingFoundDelegate(const TDelegate<void(const struct FGUID& PinId, const TSet<class FString>& PinnedObjectIds)>& Delegate);
	static EMagicLeapPassableWorldError CreateTracker();
	static EMagicLeapPassableWorldError DestroyTracker();
	static bool GetARPinPositionAndOrientation(const struct FGUID& PinId, struct FVector* Position, struct FRotator* Orientation, bool* PinFoundInEnvironment);
	static bool GetARPinPositionAndOrientation_TrackingSpace(const struct FGUID& PinId, struct FVector* Position, struct FRotator* Orientation, bool* PinFoundInEnvironment);
	static EMagicLeapPassableWorldError GetARPinState(const struct FGUID& PinId, struct FMagicLeapARPinState* State);
	static class FString GetARPinStateToString(const struct FMagicLeapARPinState& State);
	static EMagicLeapPassableWorldError GetAvailableARPins(int32 NumRequested, TArray<struct FGUID>* Pins);
	static EMagicLeapPassableWorldError GetClosestARPin(const struct FVector& SearchPoint, struct FGUID* PinId);
	static int32 GetContentBindingSaveGameUserIndex();
	static EMagicLeapPassableWorldError GetGlobalQueryFilter(struct FMagicLeapARPinQuery* CurrentGlobalFilter);
	static EMagicLeapPassableWorldError GetNumAvailableARPins(int32* Count);
	static bool IsTrackerValid();
	static bool ParseStringToARPinId(const class FString& PinIdString, struct FGUID* ARPinId);
	static EMagicLeapPassableWorldError QueryARPins(const struct FMagicLeapARPinQuery& Query, TArray<struct FGUID>* Pins);
	static void SetContentBindingSaveGameUserIndex(int32 UserIndex);
	static EMagicLeapPassableWorldError SetGlobalQueryFilter(const struct FMagicLeapARPinQuery& InGlobalFilter);
	static void UnBindToOnMagicLeapARPinUpdatedDelegate(const TDelegate<void(const TArray<struct FGUID>& Added, const TArray<struct FGUID>& Updated, const TArray<struct FGUID>& Deleted)>& Delegate);
	static void UnBindToOnMagicLeapContentBindingFoundDelegate(const TDelegate<void(const struct FGUID& PinId, const TSet<class FString>& PinnedObjectIds)>& Delegate);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapARPinFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapARPinFunctionLibrary")
	}
	static class UMagicLeapARPinFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapARPinFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UMagicLeapARPinFunctionLibrary;

// Class MagicLeapARPin.MagicLeapARPinInfoActorBase
// 0x0018 (0x02B8 - 0x02A0)
class AMagicLeapARPinInfoActorBase : public AActor
{
public:
	struct FGUID                                  PinId;                                             // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisibilityOverride;                               // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	void OnUpdateARPinState();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapARPinInfoActorBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapARPinInfoActorBase")
	}
	static class AMagicLeapARPinInfoActorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMagicLeapARPinInfoActorBase>();
	}
};
DUMPER7_ASSERTS_AMagicLeapARPinInfoActorBase;

// Class MagicLeapARPin.MagicLeapARPinRenderer
// 0x0068 (0x0308 - 0x02A0)
class AMagicLeapARPinRenderer final : public AActor
{
public:
	bool                                          bInfoActorsVisibilityOverride;                     // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	TMap<struct FGUID, class AMagicLeapARPinInfoActorBase*> AllInfoActors;                           // 0x02A8(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	TSubclassOf<class AMagicLeapARPinInfoActorBase> ClassToSpawn;                                    // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetVisibilityOverride(const bool InVisibilityOverride);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapARPinRenderer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapARPinRenderer")
	}
	static class AMagicLeapARPinRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMagicLeapARPinRenderer>();
	}
};
DUMPER7_ASSERTS_AMagicLeapARPinRenderer;

// Class MagicLeapARPin.MagicLeapARPinSettings
// 0x0018 (0x0040 - 0x0028)
class UMagicLeapARPinSettings final : public UObject
{
public:
	float                                         UpdateCheckFrequency;                              // 0x0028(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMagicLeapARPinState                   OnUpdatedEventTriggerDelta;                        // 0x002C(0x0014)(Edit, Config, GlobalConfig, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapARPinSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapARPinSettings")
	}
	static class UMagicLeapARPinSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapARPinSettings>();
	}
};
DUMPER7_ASSERTS_UMagicLeapARPinSettings;

// Class MagicLeapARPin.MagicLeapARPinSaveGame
// 0x0088 (0x00B0 - 0x0028)
class UMagicLeapARPinSaveGame final : public USaveGame
{
public:
	struct FGUID                                  PinnedID;                                          // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FTransform                             ComponentWorldTransform;                           // 0x0040(0x0030)(Edit, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             PinTransform;                                      // 0x0070(0x0030)(Edit, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bShouldPinActor;                                   // 0x00A0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0xF];                                       // 0x00A1(0x000F)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapARPinSaveGame")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapARPinSaveGame")
	}
	static class UMagicLeapARPinSaveGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapARPinSaveGame>();
	}
};
DUMPER7_ASSERTS_UMagicLeapARPinSaveGame;

// Class MagicLeapARPin.MagicLeapARPinContentBindings
// 0x0050 (0x0078 - 0x0028)
class UMagicLeapARPinContentBindings final : public USaveGame
{
public:
	TMap<struct FGUID, struct FMagicLeapARPinObjectIdList> AllContentBindings;                       // 0x0028(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapARPinContentBindings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapARPinContentBindings")
	}
	static class UMagicLeapARPinContentBindings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapARPinContentBindings>();
	}
};
DUMPER7_ASSERTS_UMagicLeapARPinContentBindings;

}

