#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: Nvzhu_Skill02_Cam

#include "Basic.hpp"


namespace SDK::Params
{

// Function Nvzhu_Skill02_Cam.SequenceDirector_C.ExecuteUbergraph_SequenceDirector
// 0x0038 (0x0038 - 0x0000)
struct SequenceDirector_C_ExecuteUbergraph_SequenceDirector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class AEnvirSystemActor_C*                    K2Node_CustomEvent_Env_Ail;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SequencePostProcess_C*              K2Node_CustomEvent_BP_Sequence_Post_Process__2__1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SequencePostProcess_C*              K2Node_CustomEvent_BP_Sequence_Post_Process_1;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SequencePostProcess_C*              K2Node_CustomEvent_BP_Sequence_Post_Process__2_;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SequencePostProcess_C*              K2Node_CustomEvent_BP_Sequence_Post_Process;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEnvirSystemActor_C*                    K2Node_CustomEvent_Env_Ail_1;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_ExecuteUbergraph_SequenceDirector;

// Function Nvzhu_Skill02_Cam.SequenceDirector_C.SequenceUpdateLight_1
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_SequenceUpdateLight_1 final
{
public:
	class AEnvirSystemActor_C*                    Env_Ail;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_SequenceUpdateLight_1;

// Function Nvzhu_Skill02_Cam.SequenceDirector_C.SequenceUpdateLight_0
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_SequenceUpdateLight_0 final
{
public:
	class AEnvirSystemActor_C*                    Env_Ail;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_SequenceUpdateLight_0;

// Function Nvzhu_Skill02_Cam.SequenceDirector_C.BP_Sequence_Post_Process_Event_1
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_BP_Sequence_Post_Process_Event_1 final
{
public:
	class ABP_SequencePostProcess_C*              BP_Sequence_Post_Process;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_BP_Sequence_Post_Process_Event_1;

// Function Nvzhu_Skill02_Cam.SequenceDirector_C.BP_Sequence_Post_Process_(2)_Event_1
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_BP_Sequence_Post_Process__2__Event_1 final
{
public:
	class ABP_SequencePostProcess_C*              BP_Sequence_Post_Process__2_;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_BP_Sequence_Post_Process__2__Event_1;

// Function Nvzhu_Skill02_Cam.SequenceDirector_C.BP_Sequence_Post_Process_Event_0
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_BP_Sequence_Post_Process_Event_0 final
{
public:
	class ABP_SequencePostProcess_C*              BP_Sequence_Post_Process;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_BP_Sequence_Post_Process_Event_0;

// Function Nvzhu_Skill02_Cam.SequenceDirector_C.BP_Sequence_Post_Process_(2)_Event_0
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_BP_Sequence_Post_Process__2__Event_0 final
{
public:
	class ABP_SequencePostProcess_C*              BP_Sequence_Post_Process__2_;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_BP_Sequence_Post_Process__2__Event_0;

// Function Nvzhu_Skill02_Cam.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_0
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_0 final
{
public:
	class ABP_SequencePostProcess_C*              BP_Sequence_Post_Process__2_;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_0;

// Function Nvzhu_Skill02_Cam.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_1
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_1 final
{
public:
	class ABP_SequencePostProcess_C*              BP_Sequence_Post_Process;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_1;

// Function Nvzhu_Skill02_Cam.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_2
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_2 final
{
public:
	class ABP_SequencePostProcess_C*              BP_Sequence_Post_Process;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_2;

// Function Nvzhu_Skill02_Cam.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_3
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_3 final
{
public:
	class ABP_SequencePostProcess_C*              BP_Sequence_Post_Process__2_;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_3;

// Function Nvzhu_Skill02_Cam.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_4
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_4 final
{
public:
	class AEnvirSystemActor_C*                    Env_Ail;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_4;

// Function Nvzhu_Skill02_Cam.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_5
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_5 final
{
public:
	class AEnvirSystemActor_C*                    Env_Ail;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_5;

// Function Nvzhu_Skill02_Cam.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_6
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_6 final
{
public:
	class ABP_SequencePostProcess_C*              BP_Sequence_Post_Process__2_;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_6;

// Function Nvzhu_Skill02_Cam.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_7
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_7 final
{
public:
	class ABP_SequencePostProcess_C*              BP_Sequence_Post_Process__2_;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_7;

}

