#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: Prologue_Void_Art

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function Prologue_Void_Art.Prologue_Void_Art_C.ExecuteUbergraph_Prologue_Void_Art
// 0x0038 (0x0038 - 0x0000)
struct Prologue_Void_Art_C_ExecuteUbergraph_Prologue_Void_Art final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EMGameMode_Void_01_C*               K2Node_DynamicCast_AsBP_EMGame_Mode_Void_01;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0020(0x0018)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Prologue_Void_Art_C_ExecuteUbergraph_Prologue_Void_Art;

// Function Prologue_Void_Art.Prologue_Void_Art_C.InpActEvt_Five_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct Prologue_Void_Art_C_InpActEvt_Five_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Prologue_Void_Art_C_InpActEvt_Five_K2Node_InputKeyEvent_0;

}

