#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: Sentry

#include "Basic.hpp"

#include "Sentry_structs.hpp"


namespace SDK::Params
{

// Function Sentry.SentryAttachment.InitializeWithData
// 0x0030 (0x0030 - 0x0000)
struct SentryAttachment_InitializeWithData final
{
public:
	TArray<uint8>                                 Data;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContentType;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryAttachment_InitializeWithData;

// Function Sentry.SentryAttachment.InitializeWithPath
// 0x0030 (0x0030 - 0x0000)
struct SentryAttachment_InitializeWithPath final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContentType;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryAttachment_InitializeWithPath;

// Function Sentry.SentryAttachment.GetContentType
// 0x0010 (0x0010 - 0x0000)
struct SentryAttachment_GetContentType final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryAttachment_GetContentType;

// Function Sentry.SentryAttachment.GetData
// 0x0010 (0x0010 - 0x0000)
struct SentryAttachment_GetData final
{
public:
	TArray<uint8>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryAttachment_GetData;

// Function Sentry.SentryAttachment.GetFilename
// 0x0010 (0x0010 - 0x0000)
struct SentryAttachment_GetFilename final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryAttachment_GetFilename;

// Function Sentry.SentryAttachment.GetPath
// 0x0010 (0x0010 - 0x0000)
struct SentryAttachment_GetPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryAttachment_GetPath;

// Function Sentry.SentryBeforeBreadcrumbHandler.HandleBeforeBreadcrumb
// 0x0018 (0x0018 - 0x0000)
struct SentryBeforeBreadcrumbHandler_HandleBeforeBreadcrumb final
{
public:
	class USentryBreadcrumb*                      Breadcrumb;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryHint*                            Hint;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryBreadcrumb*                      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryBeforeBreadcrumbHandler_HandleBeforeBreadcrumb;

// Function Sentry.SentryBeforeSendHandler.HandleBeforeSend
// 0x0018 (0x0018 - 0x0000)
struct SentryBeforeSendHandler_HandleBeforeSend final
{
public:
	class USentryEvent*                           Event;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryHint*                            Hint;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryEvent*                           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryBeforeSendHandler_HandleBeforeSend;

// Function Sentry.SentryBreadcrumb.SetCategory
// 0x0010 (0x0010 - 0x0000)
struct SentryBreadcrumb_SetCategory final
{
public:
	class FString                                 Category;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryBreadcrumb_SetCategory;

// Function Sentry.SentryBreadcrumb.SetData
// 0x0050 (0x0050 - 0x0000)
struct SentryBreadcrumb_SetData final
{
public:
	TMap<class FString, class FString>            Data;                                              // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryBreadcrumb_SetData;

// Function Sentry.SentryBreadcrumb.SetLevel
// 0x0001 (0x0001 - 0x0000)
struct SentryBreadcrumb_SetLevel final
{
public:
	ESentryLevel                                  Level;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryBreadcrumb_SetLevel;

// Function Sentry.SentryBreadcrumb.SetMessage
// 0x0010 (0x0010 - 0x0000)
struct SentryBreadcrumb_SetMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryBreadcrumb_SetMessage;

// Function Sentry.SentryBreadcrumb.SetType
// 0x0010 (0x0010 - 0x0000)
struct SentryBreadcrumb_SetType final
{
public:
	class FString                                 Type;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryBreadcrumb_SetType;

// Function Sentry.SentryBreadcrumb.GetCategory
// 0x0010 (0x0010 - 0x0000)
struct SentryBreadcrumb_GetCategory final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryBreadcrumb_GetCategory;

// Function Sentry.SentryBreadcrumb.GetData
// 0x0050 (0x0050 - 0x0000)
struct SentryBreadcrumb_GetData final
{
public:
	TMap<class FString, class FString>            ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryBreadcrumb_GetData;

// Function Sentry.SentryBreadcrumb.GetLevel
// 0x0001 (0x0001 - 0x0000)
struct SentryBreadcrumb_GetLevel final
{
public:
	ESentryLevel                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryBreadcrumb_GetLevel;

// Function Sentry.SentryBreadcrumb.GetMessage
// 0x0010 (0x0010 - 0x0000)
struct SentryBreadcrumb_GetMessage final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryBreadcrumb_GetMessage;

// Function Sentry.SentryBreadcrumb.GetType
// 0x0010 (0x0010 - 0x0000)
struct SentryBreadcrumb_GetType final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryBreadcrumb_GetType;

// Function Sentry.SentryEvent.SetLevel
// 0x0001 (0x0001 - 0x0000)
struct SentryEvent_SetLevel final
{
public:
	ESentryLevel                                  Level;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryEvent_SetLevel;

// Function Sentry.SentryEvent.SetMessage
// 0x0010 (0x0010 - 0x0000)
struct SentryEvent_SetMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryEvent_SetMessage;

// Function Sentry.SentryEvent.GetId
// 0x0010 (0x0010 - 0x0000)
struct SentryEvent_GetId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryEvent_GetId;

// Function Sentry.SentryEvent.GetLevel
// 0x0001 (0x0001 - 0x0000)
struct SentryEvent_GetLevel final
{
public:
	ESentryLevel                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryEvent_GetLevel;

// Function Sentry.SentryEvent.GetMessage
// 0x0010 (0x0010 - 0x0000)
struct SentryEvent_GetMessage final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryEvent_GetMessage;

// Function Sentry.SentryEvent.IsAnr
// 0x0001 (0x0001 - 0x0000)
struct SentryEvent_IsAnr final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryEvent_IsAnr;

// Function Sentry.SentryEvent.IsCrash
// 0x0001 (0x0001 - 0x0000)
struct SentryEvent_IsCrash final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryEvent_IsCrash;

// Function Sentry.SentryHint.AddAttachment
// 0x0008 (0x0008 - 0x0000)
struct SentryHint_AddAttachment final
{
public:
	class USentryAttachment*                      Attachment;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryHint_AddAttachment;

// Function Sentry.SentryLibrary.CreateSentryAttachmentWithData
// 0x0038 (0x0038 - 0x0000)
struct SentryLibrary_CreateSentryAttachmentWithData final
{
public:
	TArray<uint8>                                 Data;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContentType;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryAttachment*                      ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryLibrary_CreateSentryAttachmentWithData;

// Function Sentry.SentryLibrary.CreateSentryAttachmentWithPath
// 0x0038 (0x0038 - 0x0000)
struct SentryLibrary_CreateSentryAttachmentWithPath final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContentType;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryAttachment*                      ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryLibrary_CreateSentryAttachmentWithPath;

// Function Sentry.SentryLibrary.CreateSentryBreadcrumb
// 0x0090 (0x0090 - 0x0000)
struct SentryLibrary_CreateSentryBreadcrumb final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Type;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Category;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Data;                                              // 0x0030(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ESentryLevel                                  Level;                                             // 0x0080(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class USentryBreadcrumb*                      ReturnValue;                                       // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryLibrary_CreateSentryBreadcrumb;

// Function Sentry.SentryLibrary.CreateSentryEvent
// 0x0020 (0x0020 - 0x0000)
struct SentryLibrary_CreateSentryEvent final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESentryLevel                                  Level;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class USentryEvent*                           ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryLibrary_CreateSentryEvent;

// Function Sentry.SentryLibrary.CreateSentryTransactionContext
// 0x0028 (0x0028 - 0x0000)
struct SentryLibrary_CreateSentryTransactionContext final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Operation;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryTransactionContext*              ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryLibrary_CreateSentryTransactionContext;

// Function Sentry.SentryLibrary.CreateSentryUser
// 0x0098 (0x0098 - 0x0000)
struct SentryLibrary_CreateSentryUser final
{
public:
	class FString                                 Email;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 userName;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IpAddress;                                         // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Data;                                              // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USentryUser*                            ReturnValue;                                       // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryLibrary_CreateSentryUser;

// Function Sentry.SentryLibrary.CreateSentryUserFeedback
// 0x0048 (0x0048 - 0x0000)
struct SentryLibrary_CreateSentryUserFeedback final
{
public:
	class FString                                 EventId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Email;                                             // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Comments;                                          // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryUserFeedback*                    ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryLibrary_CreateSentryUserFeedback;

// Function Sentry.SentrySamplingContext.GetCustomSamplingContext
// 0x0050 (0x0050 - 0x0000)
struct SentrySamplingContext_GetCustomSamplingContext final
{
public:
	TMap<class FString, class FString>            ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySamplingContext_GetCustomSamplingContext;

// Function Sentry.SentrySamplingContext.GetTransactionContext
// 0x0008 (0x0008 - 0x0000)
struct SentrySamplingContext_GetTransactionContext final
{
public:
	class USentryTransactionContext*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySamplingContext_GetTransactionContext;

// Function Sentry.SentryScope.AddAttachment
// 0x0008 (0x0008 - 0x0000)
struct SentryScope_AddAttachment final
{
public:
	class USentryAttachment*                      Attachment;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_AddAttachment;

// Function Sentry.SentryScope.AddBreadcrumb
// 0x0008 (0x0008 - 0x0000)
struct SentryScope_AddBreadcrumb final
{
public:
	class USentryBreadcrumb*                      Breadcrumb;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_AddBreadcrumb;

// Function Sentry.SentryScope.RemoveContext
// 0x0010 (0x0010 - 0x0000)
struct SentryScope_RemoveContext final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_RemoveContext;

// Function Sentry.SentryScope.RemoveExtra
// 0x0010 (0x0010 - 0x0000)
struct SentryScope_RemoveExtra final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_RemoveExtra;

// Function Sentry.SentryScope.RemoveTag
// 0x0010 (0x0010 - 0x0000)
struct SentryScope_RemoveTag final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_RemoveTag;

// Function Sentry.SentryScope.SetContext
// 0x0060 (0x0060 - 0x0000)
struct SentryScope_SetContext final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Values;                                            // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_SetContext;

// Function Sentry.SentryScope.SetDist
// 0x0010 (0x0010 - 0x0000)
struct SentryScope_SetDist final
{
public:
	class FString                                 Dist;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_SetDist;

// Function Sentry.SentryScope.SetEnvironment
// 0x0010 (0x0010 - 0x0000)
struct SentryScope_SetEnvironment final
{
public:
	class FString                                 Environment;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_SetEnvironment;

// Function Sentry.SentryScope.SetExtras
// 0x0050 (0x0050 - 0x0000)
struct SentryScope_SetExtras final
{
public:
	TMap<class FString, class FString>            Extras;                                            // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_SetExtras;

// Function Sentry.SentryScope.SetExtraValue
// 0x0020 (0x0020 - 0x0000)
struct SentryScope_SetExtraValue final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_SetExtraValue;

// Function Sentry.SentryScope.SetFingerprint
// 0x0010 (0x0010 - 0x0000)
struct SentryScope_SetFingerprint final
{
public:
	TArray<class FString>                         Fingerprint;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_SetFingerprint;

// Function Sentry.SentryScope.SetLevel
// 0x0001 (0x0001 - 0x0000)
struct SentryScope_SetLevel final
{
public:
	ESentryLevel                                  Level;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_SetLevel;

// Function Sentry.SentryScope.SetTags
// 0x0050 (0x0050 - 0x0000)
struct SentryScope_SetTags final
{
public:
	TMap<class FString, class FString>            Tags;                                              // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_SetTags;

// Function Sentry.SentryScope.SetTagValue
// 0x0020 (0x0020 - 0x0000)
struct SentryScope_SetTagValue final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_SetTagValue;

// Function Sentry.SentryScope.GetDist
// 0x0010 (0x0010 - 0x0000)
struct SentryScope_GetDist final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_GetDist;

// Function Sentry.SentryScope.GetEnvironment
// 0x0010 (0x0010 - 0x0000)
struct SentryScope_GetEnvironment final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_GetEnvironment;

// Function Sentry.SentryScope.GetExtras
// 0x0050 (0x0050 - 0x0000)
struct SentryScope_GetExtras final
{
public:
	TMap<class FString, class FString>            ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_GetExtras;

// Function Sentry.SentryScope.GetExtraValue
// 0x0020 (0x0020 - 0x0000)
struct SentryScope_GetExtraValue final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_GetExtraValue;

// Function Sentry.SentryScope.GetFingerprint
// 0x0010 (0x0010 - 0x0000)
struct SentryScope_GetFingerprint final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_GetFingerprint;

// Function Sentry.SentryScope.GetLevel
// 0x0001 (0x0001 - 0x0000)
struct SentryScope_GetLevel final
{
public:
	ESentryLevel                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_GetLevel;

// Function Sentry.SentryScope.GetTags
// 0x0050 (0x0050 - 0x0000)
struct SentryScope_GetTags final
{
public:
	TMap<class FString, class FString>            ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_GetTags;

// Function Sentry.SentryScope.GetTagValue
// 0x0020 (0x0020 - 0x0000)
struct SentryScope_GetTagValue final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryScope_GetTagValue;

// Function Sentry.SentrySpan.FinishWithTimestamp
// 0x0008 (0x0008 - 0x0000)
struct SentrySpan_FinishWithTimestamp final
{
public:
	int64                                         Timestamp;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySpan_FinishWithTimestamp;

// Function Sentry.SentrySpan.GetTrace
// 0x0020 (0x0020 - 0x0000)
struct SentrySpan_GetTrace final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySpan_GetTrace;

// Function Sentry.SentrySpan.RemoveData
// 0x0010 (0x0010 - 0x0000)
struct SentrySpan_RemoveData final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySpan_RemoveData;

// Function Sentry.SentrySpan.RemoveTag
// 0x0010 (0x0010 - 0x0000)
struct SentrySpan_RemoveTag final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySpan_RemoveTag;

// Function Sentry.SentrySpan.SetData
// 0x0060 (0x0060 - 0x0000)
struct SentrySpan_SetData final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Values;                                            // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySpan_SetData;

// Function Sentry.SentrySpan.SetTag
// 0x0020 (0x0020 - 0x0000)
struct SentrySpan_SetTag final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySpan_SetTag;

// Function Sentry.SentrySpan.StartChild
// 0x0028 (0x0028 - 0x0000)
struct SentrySpan_StartChild final
{
public:
	class FString                                 Operation;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentrySpan*                            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySpan_StartChild;

// Function Sentry.SentrySpan.StartChildWithTimestamp
// 0x0030 (0x0030 - 0x0000)
struct SentrySpan_StartChildWithTimestamp final
{
public:
	class FString                                 Operation;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Timestamp;                                         // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentrySpan*                            ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySpan_StartChildWithTimestamp;

// Function Sentry.SentrySpan.IsFinished
// 0x0001 (0x0001 - 0x0000)
struct SentrySpan_IsFinished final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySpan_IsFinished;

// Function Sentry.SentrySubsystem.AddBreadcrumb
// 0x0008 (0x0008 - 0x0000)
struct SentrySubsystem_AddBreadcrumb final
{
public:
	class USentryBreadcrumb*                      Breadcrumb;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_AddBreadcrumb;

// Function Sentry.SentrySubsystem.AddBreadcrumbWithParams
// 0x0088 (0x0088 - 0x0000)
struct SentrySubsystem_AddBreadcrumbWithParams final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Category;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Type;                                              // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Data;                                              // 0x0030(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ESentryLevel                                  Level;                                             // 0x0080(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-DNA ])
};
DUMPER7_ASSERTS_SentrySubsystem_AddBreadcrumbWithParams;

// Function Sentry.SentrySubsystem.CaptureEvent
// 0x0018 (0x0018 - 0x0000)
struct SentrySubsystem_CaptureEvent final
{
public:
	class USentryEvent*                           Event;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_CaptureEvent;

// Function Sentry.SentrySubsystem.CaptureEventWithScope
// 0x0028 (0x0028 - 0x0000)
struct SentrySubsystem_CaptureEventWithScope final
{
public:
	class USentryEvent*                           Event;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class USentryScope* Scope)>    OnConfigureScope;                                  // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_CaptureEventWithScope;

// Function Sentry.SentrySubsystem.CaptureMessage
// 0x0028 (0x0028 - 0x0000)
struct SentrySubsystem_CaptureMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESentryLevel                                  Level;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_CaptureMessage;

// Function Sentry.SentrySubsystem.CaptureMessageWithScope
// 0x0038 (0x0038 - 0x0000)
struct SentrySubsystem_CaptureMessageWithScope final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class USentryScope* Scope)>    OnConfigureScope;                                  // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	ESentryLevel                                  Level;                                             // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_CaptureMessageWithScope;

// Function Sentry.SentrySubsystem.CaptureUserFeedback
// 0x0008 (0x0008 - 0x0000)
struct SentrySubsystem_CaptureUserFeedback final
{
public:
	class USentryUserFeedback*                    UserFeedback;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_CaptureUserFeedback;

// Function Sentry.SentrySubsystem.CaptureUserFeedbackWithParams
// 0x0040 (0x0040 - 0x0000)
struct SentrySubsystem_CaptureUserFeedbackWithParams final
{
public:
	class FString                                 EventId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Email;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Comments;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_CaptureUserFeedbackWithParams;

// Function Sentry.SentrySubsystem.ConfigureScope
// 0x0010 (0x0010 - 0x0000)
struct SentrySubsystem_ConfigureScope final
{
public:
	TDelegate<void(class USentryScope* Scope)>    OnConfigureScope;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_ConfigureScope;

// Function Sentry.SentrySubsystem.ContinueTrace
// 0x0028 (0x0028 - 0x0000)
struct SentrySubsystem_ContinueTrace final
{
public:
	class FString                                 SentryTrace;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         BaggageHeaders;                                    // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class USentryTransactionContext*              ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_ContinueTrace;

// Function Sentry.SentrySubsystem.InitializeWithSettings
// 0x0010 (0x0010 - 0x0000)
struct SentrySubsystem_InitializeWithSettings final
{
public:
	TDelegate<void(class USentrySettings* Settings)> OnConfigureSettings;                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_InitializeWithSettings;

// Function Sentry.SentrySubsystem.RemoveTag
// 0x0010 (0x0010 - 0x0000)
struct SentrySubsystem_RemoveTag final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_RemoveTag;

// Function Sentry.SentrySubsystem.SetContext
// 0x0060 (0x0060 - 0x0000)
struct SentrySubsystem_SetContext final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Values;                                            // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_SetContext;

// Function Sentry.SentrySubsystem.SetLevel
// 0x0001 (0x0001 - 0x0000)
struct SentrySubsystem_SetLevel final
{
public:
	ESentryLevel                                  Level;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_SetLevel;

// Function Sentry.SentrySubsystem.SetTag
// 0x0020 (0x0020 - 0x0000)
struct SentrySubsystem_SetTag final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_SetTag;

// Function Sentry.SentrySubsystem.SetUser
// 0x0008 (0x0008 - 0x0000)
struct SentrySubsystem_SetUser final
{
public:
	class USentryUser*                            User;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_SetUser;

// Function Sentry.SentrySubsystem.StartTransaction
// 0x0028 (0x0028 - 0x0000)
struct SentrySubsystem_StartTransaction final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Operation;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryTransaction*                     ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_StartTransaction;

// Function Sentry.SentrySubsystem.StartTransactionWithContext
// 0x0010 (0x0010 - 0x0000)
struct SentrySubsystem_StartTransactionWithContext final
{
public:
	class USentryTransactionContext*              Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryTransaction*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_StartTransactionWithContext;

// Function Sentry.SentrySubsystem.StartTransactionWithContextAndOptions
// 0x0060 (0x0060 - 0x0000)
struct SentrySubsystem_StartTransactionWithContextAndOptions final
{
public:
	class USentryTransactionContext*              Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Options;                                           // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USentryTransaction*                     ReturnValue;                                       // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_StartTransactionWithContextAndOptions;

// Function Sentry.SentrySubsystem.StartTransactionWithContextAndTimestamp
// 0x0018 (0x0018 - 0x0000)
struct SentrySubsystem_StartTransactionWithContextAndTimestamp final
{
public:
	class USentryTransactionContext*              Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Timestamp;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryTransaction*                     ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_StartTransactionWithContextAndTimestamp;

// Function Sentry.SentrySubsystem.IsCrashedLastRun
// 0x0001 (0x0001 - 0x0000)
struct SentrySubsystem_IsCrashedLastRun final
{
public:
	ESentryCrashedLastRun                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_IsCrashedLastRun;

// Function Sentry.SentrySubsystem.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct SentrySubsystem_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_IsEnabled;

// Function Sentry.SentrySubsystem.IsSupportedForCurrentSettings
// 0x0001 (0x0001 - 0x0000)
struct SentrySubsystem_IsSupportedForCurrentSettings final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentrySubsystem_IsSupportedForCurrentSettings;

// Function Sentry.SentryTraceSampler.Sample
// 0x0010 (0x0010 - 0x0000)
struct SentryTraceSampler_Sample final
{
public:
	class USentrySamplingContext*                 samplingContext;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         samplingValue;                                     // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-DNA ])
};
DUMPER7_ASSERTS_SentryTraceSampler_Sample;

// Function Sentry.SentryTransaction.FinishWithTimestamp
// 0x0008 (0x0008 - 0x0000)
struct SentryTransaction_FinishWithTimestamp final
{
public:
	int64                                         Timestamp;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryTransaction_FinishWithTimestamp;

// Function Sentry.SentryTransaction.GetTrace
// 0x0020 (0x0020 - 0x0000)
struct SentryTransaction_GetTrace final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryTransaction_GetTrace;

// Function Sentry.SentryTransaction.RemoveData
// 0x0010 (0x0010 - 0x0000)
struct SentryTransaction_RemoveData final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryTransaction_RemoveData;

// Function Sentry.SentryTransaction.RemoveTag
// 0x0010 (0x0010 - 0x0000)
struct SentryTransaction_RemoveTag final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryTransaction_RemoveTag;

// Function Sentry.SentryTransaction.SetData
// 0x0060 (0x0060 - 0x0000)
struct SentryTransaction_SetData final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Values;                                            // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryTransaction_SetData;

// Function Sentry.SentryTransaction.SetName
// 0x0010 (0x0010 - 0x0000)
struct SentryTransaction_SetName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryTransaction_SetName;

// Function Sentry.SentryTransaction.SetTag
// 0x0020 (0x0020 - 0x0000)
struct SentryTransaction_SetTag final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryTransaction_SetTag;

// Function Sentry.SentryTransaction.StartChildSpan
// 0x0028 (0x0028 - 0x0000)
struct SentryTransaction_StartChildSpan final
{
public:
	class FString                                 Operation;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentrySpan*                            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryTransaction_StartChildSpan;

// Function Sentry.SentryTransaction.StartChildSpanWithTimestamp
// 0x0030 (0x0030 - 0x0000)
struct SentryTransaction_StartChildSpanWithTimestamp final
{
public:
	class FString                                 Operation;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Timestamp;                                         // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentrySpan*                            ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryTransaction_StartChildSpanWithTimestamp;

// Function Sentry.SentryTransaction.IsFinished
// 0x0001 (0x0001 - 0x0000)
struct SentryTransaction_IsFinished final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryTransaction_IsFinished;

// Function Sentry.SentryTransactionContext.Initialize
// 0x0020 (0x0020 - 0x0000)
struct SentryTransactionContext_Initialize final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Operation;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryTransactionContext_Initialize;

// Function Sentry.SentryTransactionContext.GetName
// 0x0010 (0x0010 - 0x0000)
struct SentryTransactionContext_GetName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryTransactionContext_GetName;

// Function Sentry.SentryTransactionContext.GetOperation
// 0x0010 (0x0010 - 0x0000)
struct SentryTransactionContext_GetOperation final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryTransactionContext_GetOperation;

// Function Sentry.SentryUser.SetData
// 0x0050 (0x0050 - 0x0000)
struct SentryUser_SetData final
{
public:
	TMap<class FString, class FString>            Data;                                              // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryUser_SetData;

// Function Sentry.SentryUser.SetEmail
// 0x0010 (0x0010 - 0x0000)
struct SentryUser_SetEmail final
{
public:
	class FString                                 Email;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryUser_SetEmail;

// Function Sentry.SentryUser.SetId
// 0x0010 (0x0010 - 0x0000)
struct SentryUser_SetId final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryUser_SetId;

// Function Sentry.SentryUser.SetIpAddress
// 0x0010 (0x0010 - 0x0000)
struct SentryUser_SetIpAddress final
{
public:
	class FString                                 IpAddress;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryUser_SetIpAddress;

// Function Sentry.SentryUser.SetUsername
// 0x0010 (0x0010 - 0x0000)
struct SentryUser_SetUsername final
{
public:
	class FString                                 userName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryUser_SetUsername;

// Function Sentry.SentryUser.GetData
// 0x0050 (0x0050 - 0x0000)
struct SentryUser_GetData final
{
public:
	TMap<class FString, class FString>            ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryUser_GetData;

// Function Sentry.SentryUser.GetEmail
// 0x0010 (0x0010 - 0x0000)
struct SentryUser_GetEmail final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SentryUser_GetEmail;

