#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerListItemContent

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ServerListItemContent.ServerListItemContent_C
// 0x0040 (0x0068 - 0x0028)
class UServerListItemContent_C final : public UObject
{
public:
	int32                                         HostId;                                            // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Area;                                              // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0030(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   IP;                                                // 0x0048(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         Port;                                              // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0064(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ServerListItemContent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ServerListItemContent_C")
	}
	static class UServerListItemContent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UServerListItemContent_C>();
	}
};
DUMPER7_ASSERTS_UServerListItemContent_C;

}

