#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: ShootBallControl

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ShootBallControl.ShootBallControl
// 0x0020 (0x0020 - 0x0000)
struct FShootBallControl final
{
public:
	int32                                         Ball_Id_15_B2996372442B0CD812E6BCBB83C68A99;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 SplineName_17_572D468C4A0CA2E83F222F9E5DFD766E;    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         SpawnDeadCount_19_F2184CB645C1400AF81DD7BCE5F043BA; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnDelay_21_0E12E61C4DEA55F4E211D1A7A5A319CA;    // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FShootBallControl;

}

