#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: Slate

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "SlateCore_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Slate.ButtonWidgetStyle
// 0x03A0 (0x03D0 - 0x0030)
class UButtonWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FButtonStyle                           ButtonStyle;                                       // 0x0030(0x03A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ButtonWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ButtonWidgetStyle")
	}
	static class UButtonWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UButtonWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UButtonWidgetStyle;

// Class Slate.CheckBoxWidgetStyle
// 0x0810 (0x0840 - 0x0030)
class UCheckBoxWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FCheckBoxStyle                         CheckBoxStyle;                                     // 0x0030(0x0810)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CheckBoxWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CheckBoxWidgetStyle")
	}
	static class UCheckBoxWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCheckBoxWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UCheckBoxWidgetStyle;

// Class Slate.ComboBoxWidgetStyle
// 0x05C0 (0x05F0 - 0x0030)
class UComboBoxWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FComboBoxStyle                         ComboBoxStyle;                                     // 0x0030(0x05C0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ComboBoxWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ComboBoxWidgetStyle")
	}
	static class UComboBoxWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComboBoxWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UComboBoxWidgetStyle;

// Class Slate.ComboButtonWidgetStyle
// 0x0580 (0x05B0 - 0x0030)
class UComboButtonWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FComboButtonStyle                      ComboButtonStyle;                                  // 0x0030(0x0580)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ComboButtonWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ComboButtonWidgetStyle")
	}
	static class UComboButtonWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComboButtonWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UComboButtonWidgetStyle;

// Class Slate.EditableTextBoxWidgetStyle
// 0x0D70 (0x0DA0 - 0x0030)
class UEditableTextBoxWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FEditableTextBoxStyle                  EditableTextBoxStyle;                              // 0x0030(0x0D70)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EditableTextBoxWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EditableTextBoxWidgetStyle")
	}
	static class UEditableTextBoxWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditableTextBoxWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UEditableTextBoxWidgetStyle;

// Class Slate.EditableTextWidgetStyle
// 0x0300 (0x0330 - 0x0030)
class UEditableTextWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FEditableTextStyle                     EditableTextStyle;                                 // 0x0030(0x0300)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EditableTextWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EditableTextWidgetStyle")
	}
	static class UEditableTextWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditableTextWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UEditableTextWidgetStyle;

// Class Slate.ProgressWidgetStyle
// 0x0280 (0x02B0 - 0x0030)
class UProgressWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FProgressBarStyle                      ProgressBarStyle;                                  // 0x0030(0x0280)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProgressWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProgressWidgetStyle")
	}
	static class UProgressWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UProgressWidgetStyle;

// Class Slate.ScrollBarWidgetStyle
// 0x0910 (0x0940 - 0x0030)
class UScrollBarWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FScrollBarStyle                        ScrollBarStyle;                                    // 0x0030(0x0910)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScrollBarWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScrollBarWidgetStyle")
	}
	static class UScrollBarWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScrollBarWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UScrollBarWidgetStyle;

// Class Slate.ScrollBoxWidgetStyle
// 0x0350 (0x0380 - 0x0030)
class UScrollBoxWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FScrollBoxStyle                        ScrollBoxStyle;                                    // 0x0030(0x0350)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScrollBoxWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScrollBoxWidgetStyle")
	}
	static class UScrollBoxWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScrollBoxWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UScrollBoxWidgetStyle;

// Class Slate.SlateSettings
// 0x0008 (0x0030 - 0x0028)
class USlateSettings final : public UObject
{
public:
	bool                                          bExplicitCanvasChildZOrder;                        // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SlateSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SlateSettings")
	}
	static class USlateSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlateSettings>();
	}
};
DUMPER7_ASSERTS_USlateSettings;

// Class Slate.SpinBoxWidgetStyle
// 0x0460 (0x0490 - 0x0030)
class USpinBoxWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FSpinBoxStyle                          SpinBoxStyle;                                      // 0x0030(0x0460)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpinBoxWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpinBoxWidgetStyle")
	}
	static class USpinBoxWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpinBoxWidgetStyle>();
	}
};
DUMPER7_ASSERTS_USpinBoxWidgetStyle;

// Class Slate.TextBlockWidgetStyle
// 0x0360 (0x0390 - 0x0030)
class UTextBlockWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FTextBlockStyle                        TextBlockStyle;                                    // 0x0030(0x0360)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TextBlockWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TextBlockWidgetStyle")
	}
	static class UTextBlockWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextBlockWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UTextBlockWidgetStyle;

// Class Slate.ToolMenuBase
// 0x0000 (0x0028 - 0x0028)
class UToolMenuBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ToolMenuBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ToolMenuBase")
	}
	static class UToolMenuBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolMenuBase>();
	}
};
DUMPER7_ASSERTS_UToolMenuBase;

}

