#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: SQ_Login_Start_light

#include "Basic.hpp"


namespace SDK::Params
{

// Function SQ_Login_Start_light.SequenceDirector_C.ExecuteUbergraph_SequenceDirector
// 0x0020 (0x0020 - 0x0000)
struct SequenceDirector_C_ExecuteUbergraph_SequenceDirector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class AEnvirSystemActor_C*                    K2Node_CustomEvent_Env_Void;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LightingPara_C*                     K2Node_CustomEvent_BP_LightingPara_C_5;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LightingPara_C*                     K2Node_CustomEvent_BP_LightingPara_C_6;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_ExecuteUbergraph_SequenceDirector;

// Function SQ_Login_Start_light.SequenceDirector_C.SequenceUpdateLight_0
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_SequenceUpdateLight_0 final
{
public:
	class AEnvirSystemActor_C*                    Env_Void;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_SequenceUpdateLight_0;

// Function SQ_Login_Start_light.SequenceDirector_C.Cinematic_1
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_Cinematic_1 final
{
public:
	class ABP_LightingPara_C*                     BP_LightingPara_C_6;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_Cinematic_1;

// Function SQ_Login_Start_light.SequenceDirector_C.Cinematic_0
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_Cinematic_0 final
{
public:
	class ABP_LightingPara_C*                     BP_LightingPara_C_5;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_Cinematic_0;

// Function SQ_Login_Start_light.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_0
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_0 final
{
public:
	class ABP_LightingPara_C*                     BP_LightingPara_C_5;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_0;

// Function SQ_Login_Start_light.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_1
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_1 final
{
public:
	class ABP_LightingPara_C*                     BP_LightingPara_C_6;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_1;

// Function SQ_Login_Start_light.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_2
// 0x0008 (0x0008 - 0x0000)
struct SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_2 final
{
public:
	class AEnvirSystemActor_C*                    Env_Void;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_2;

}

