#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: SQ_Login_MTS

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function SQ_Login_MTS.SequenceDirector_C.ExecuteUbergraph_SequenceDirector
// 0x0014 (0x0014 - 0x0000)
struct SequenceDirector_C_ExecuteUbergraph_SequenceDirector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
};
DUMPER7_ASSERTS_SequenceDirector_C_ExecuteUbergraph_SequenceDirector;

// Function SQ_Login_MTS.SequenceDirector_C.Loop
// 0x0038 (0x0038 - 0x0000)
struct SequenceDirector_C_Loop final
{
public:
	int32                                         StartFrame;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFrameNumber                           K2Node_MakeStruct_FrameNumber;                     // 0x0004(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FFrameTime                             K2Node_MakeStruct_FrameTime;                       // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneSequencePlaybackParams      K2Node_MakeStruct_MovieSceneSequencePlaybackParams; // 0x0010(0x0028)()
};
DUMPER7_ASSERTS_SequenceDirector_C_Loop;

}

