#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_FogCone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_FogCone.ST_FogCone
// 0x0030 (0x0030 - 0x0000)
struct FST_FogCone final
{
public:
	float                                         透明度_8_A12FD50E403FBC6513263B990268D2AA;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         雾效范围_9_5CF79D5E484BA58D1F224B8EF19CC959;       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           雾颜色_10_9D000B1D41D65D0C16C17EA678FBC6C2;        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         雾内角范围_13_D1CE77B542FAC20A74075FA27577A2A4;    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         雾上部渐变过度_23_54AB948A42B9436C4DE3F7A7B2EFE344; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         雾下部渐变过度_21_5E92518E4878EF6A398B4FB99A6B9AC1; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                大小_19_62F4DE1E4B76FC186F1BD7B4897D75D4;          // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_FogCone;

}

