#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TapCommon

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function TapCommon.TapButtonSlot.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct TapButtonSlot_SetHorizontalAlignment final
{
public:
	EHorizontalAlignment                          InHorizontalAlignment;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TapButtonSlot_SetHorizontalAlignment;

// Function TapCommon.TapButtonSlot.SetPadding
// 0x0010 (0x0010 - 0x0000)
struct TapButtonSlot_SetPadding final
{
public:
	struct FMargin                                InPadding;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TapButtonSlot_SetPadding;

// Function TapCommon.TapButtonSlot.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct TapButtonSlot_SetVerticalAlignment final
{
public:
	EVerticalAlignment                            InVerticalAlignment;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TapButtonSlot_SetVerticalAlignment;

// Function TapCommon.TapCommonBPLibrary.CallHandler
// 0x0010 (0x0010 - 0x0000)
struct TapCommonBPLibrary_CallHandler final
{
public:
	class FString                                 Command;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TapCommonBPLibrary_CallHandler;

// Function TapCommon.TapCommonBPLibrary.Register
// 0x0020 (0x0020 - 0x0000)
struct TapCommonBPLibrary_Register final
{
public:
	class FString                                 serviceClz;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 serviceImpl;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TapCommonBPLibrary_Register;

// Function TapCommon.TapCommonBPLibrary.RemoveEmptyKey
// 0x00A0 (0x00A0 - 0x0000)
struct TapCommonBPLibrary_RemoveEmptyKey final
{
public:
	TMap<class FString, class FString>            stringMap;                                         // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            ReturnValue;                                       // 0x0050(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TapCommonBPLibrary_RemoveEmptyKey;

// Function TapCommon.TapCommonBPLibrary.RemoveEmptyString
// 0x0020 (0x0020 - 0x0000)
struct TapCommonBPLibrary_RemoveEmptyString final
{
public:
	TArray<class FString>                         StringArray;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TapCommonBPLibrary_RemoveEmptyString;

// Function TapCommon.TUHUD.ShowToast
// 0x0018 (0x0018 - 0x0000)
struct TUHUD_ShowToast final
{
public:
	class FString                                 Toast;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeInterval;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TUHUD_ShowToast;

// Function TapCommon.TUHUD.ShowWaitAndToast
// 0x0010 (0x0010 - 0x0000)
struct TUHUD_ShowWaitAndToast final
{
public:
	class FString                                 Toast;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TUHUD_ShowWaitAndToast;

}

