#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TapLogin

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "TapCommon_structs.hpp"


namespace SDK
{

// ScriptStruct TapLogin.TULoginError
// 0x0040 (0x0040 - 0x0000)
struct FTULoginError final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Error;                                             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 error_description;                                 // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTULoginError;

// ScriptStruct TapLogin.LoginWrapper
// 0x0018 (0x0018 - 0x0000)
struct FLoginWrapper final
{
public:
	class FString                                 wrapper;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        loginCallbackCode;                                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLoginWrapper;

// ScriptStruct TapLogin.FriendWrapper
// 0x0020 (0x0020 - 0x0000)
struct FFriendWrapper final
{
public:
	class FString                                 Content;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Code;                                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFriendWrapper;

// ScriptStruct TapLogin.PermissionCheckBoxStyle
// 0x0B78 (0x0B80 - 0x0008)
struct FPermissionCheckBoxStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCheckBoxStyle                         PermissionCheckBoxStyle;                           // 0x0010(0x0810)(Edit, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        PermissionTextBlockStyle;                          // 0x0820(0x0360)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPermissionCheckBoxStyle;

// ScriptStruct TapLogin.QrCodeScanTipButtonStyle
// 0x05D8 (0x05E0 - 0x0008)
struct FQrCodeScanTipButtonStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextBlockStyle                        ScanTipTextBlockStyle;                             // 0x0010(0x0360)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            IconBrush;                                         // 0x0370(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OpenBrush;                                         // 0x0440(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            CloseBrush;                                        // 0x0510(0x00D0)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQrCodeScanTipButtonStyle;

// ScriptStruct TapLogin.TapLoginStyle
// 0x37C8 (0x37D0 - 0x0008)
struct FTapLoginStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextBlockStyle                        TitleTextBlockStyle;                               // 0x0010(0x0360)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                TitlePadding;                                      // 0x0370(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        SubtitleTextBlockStyle;                            // 0x0380(0x0360)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                QrCodePadding;                                     // 0x06E0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                QrCodeDescription2Padding;                         // 0x06F0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        QrCodeDescriptionStyle;                            // 0x0700(0x0360)(Edit, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        QrCodeDescriptionStyle2;                           // 0x0A60(0x0360)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            TipContainerBrush;                                 // 0x0DC0(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FQrCodeScanTipButtonStyle              QrCodeScanTipButtonStyle;                          // 0x0E90(0x05E0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            RetryBrush;                                        // 0x1470(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                RetryContentPadding;                               // 0x1540(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateBrush                            QrCodeRetryIconBrush;                              // 0x1550(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        QrCodeRetryTextBlockStyle;                         // 0x1620(0x0360)(Edit, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        QrCodeRetryDescriptionStyle;                       // 0x1980(0x0360)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                NoPermissionPadding;                               // 0x1CE0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateBrush                            NoPermissionBrush;                                 // 0x1CF0(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                WebAuthButtonPadding;                              // 0x1DC0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        WebAuthTextBlockStyle;                             // 0x1DD0(0x0360)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            WebAuthArrow;                                      // 0x2130(0x00D0)(Edit, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          WebAuthHAlignment;                                 // 0x2200(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2201[0xF];                                     // 0x2201(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextBlockStyle                        WebAuthTipTextBlockStyle;                          // 0x2210(0x0360)(Edit, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        WebAuthTipTextBlockStyle2;                         // 0x2570(0x0360)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                WebAuthTip2Padding;                                // 0x28D0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                PermissionItemPadding;                             // 0x28E0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        PermissionTitleTextBlockStyle;                     // 0x28F0(0x0360)(Edit, NativeAccessSpecifierPublic)
	struct FPermissionCheckBoxStyle               PermissionCheckBoxStyle;                           // 0x2C50(0x0B80)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTapLoginStyle;

// ScriptStruct TapLogin.TUAccessToken
// 0x0060 (0x0060 - 0x0000)
struct FTUAccessToken final
{
public:
	class FString                                 kid;                                               // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 access_token;                                      // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 token_type;                                        // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 mac_key;                                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 mac_algorithm;                                     // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Scope;                                             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTUAccessToken;

// ScriptStruct TapLogin.TUAntiAddictionModel
// 0x0010 (0x0010 - 0x0000)
struct FTUAntiAddictionModel final
{
public:
	class FString                                 Code;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTUAntiAddictionModel;

// ScriptStruct TapLogin.TULoginFriendInfo
// 0x0030 (0x0030 - 0x0000)
struct FTULoginFriendInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Avatar;                                            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OpenID;                                            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTULoginFriendInfo;

// ScriptStruct TapLogin.TULoginFriendResult
// 0x0020 (0x0020 - 0x0000)
struct FTULoginFriendResult final
{
public:
	TArray<struct FTULoginFriendInfo>             Data;                                              // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Cursor;                                            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTULoginFriendResult;

// ScriptStruct TapLogin.TULoginProfileModel
// 0x0040 (0x0040 - 0x0000)
struct FTULoginProfileModel final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Avatar;                                            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OpenID;                                            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 unionid;                                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTULoginProfileModel;

// ScriptStruct TapLogin.TULoginStorage
// 0x0001 (0x0001 - 0x0000)
struct FTULoginStorage final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTULoginStorage;

// ScriptStruct TapLogin.TULoginConfig
// 0x0018 (0x0018 - 0x0000)
struct FTULoginConfig final
{
public:
	class FString                                 ClientId;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERegionType                                   RegionType;                                        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRoundCorner;                                      // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTULoginConfig;

// ScriptStruct TapLogin.TUQrCodeModel
// 0x0050 (0x0050 - 0x0000)
struct FTUQrCodeModel final
{
public:
	class FString                                 qrcode_url;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 verification_url;                                  // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 device_code;                                       // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 user_code;                                         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         expires_in;                                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Interval;                                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTUQrCodeModel;

}

