#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: TargetFilterComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TargetFilterComponent.TargetFilterComponent_C
// 0x0088 (0x0188 - 0x0100)
class UTargetFilterComponent_C final : public UTargetFilterBaseComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TScriptInterface<class IEffectSourceInterface> Source;                                           // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<int32>                                 目标eid列表;                                       // 0x0118(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         RingInnerRadius;                                   // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Int;                                               // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BuffId;                                            // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ConditionId;                                       // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EffectId;                                          // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TargetFilterName;                                  // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllWeaponRangeModify;                              // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 ActorName;                                         // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          AllowSkillRangeModify;                             // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	int32                                         ChooseNum;                                         // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 LocalResult;                                       // 0x0168(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         BuffType;                                          // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SPTargetTag;                                       // 0x017C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SPTargetIndex;                                     // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Common_Near(TArray<int32>* 返回的eid列表);
	void Mon_SpecificTarget(TArray<int32>* 返回的eid列表);
	void Suyi_Skill01_Funnel(TArray<int32>* 返回的eid列表);
	void Zhiliu_Skill02_TD(TArray<int32>* 返回的eid列表);
	void Mon_SQWanjuSummon(TArray<int32>* 返回的eid列表);
	void Mon_JTBlastRobot_OnlyTrolly(TArray<int32>* 返回的eid列表);
	void Mon_JTBlastRobot_ExceptTrolly(TArray<int32>* 返回的eid列表);
	void Mon_ShijingzheSkill11(TArray<int32>* 返回的eid列表);
	void Grab_SelectRandomOne_ExceptShijingzhePillar(TArray<int32>* 返回的eid列表);
	void Grab_SelectRandomOne(TArray<int32>* 返回的eid列表);
	void Xibi_Skill02(TArray<int32>* 返回的eid列表);
	void Xibi_Skill01(TArray<int32>* 返回的eid列表);
	void Nifu_Skill01_Search(TArray<int32>* 返回的eid列表);
	void Mon_ExceptShijingzhePillar(TArray<int32>* 返回的eid列表);
	void Mon_RandomChoose(TArray<int32>* 返回的eid列表);
	void Mon_ShijingzhePillar(TArray<int32>* 返回的eid列表);
	void Mon_ExceptMechanism(TArray<int32>* 返回的eid列表);
	void Mon_ExceptBuffType(TArray<int32>* 返回的eid列表);
	void Mon_FilterBuffType(TArray<int32>* 返回的eid列表);
	void Mon_IsPlayer(TArray<int32>* 返回的eid列表);
	void Mon_ReplaceMechanism(TArray<int32>* 返回的eid列表);
	void Mon_DisFilter(TArray<int32>* 返回的eid列表);
	void Linen_Skill02(TArray<int32>* 返回的eid列表);
	void Maer_Skill01(TArray<int32>* 返回的eid列表);
	void Char_Baiheng_Skill01(TArray<int32>* 返回的eid列表);
	void Zhangyu_Skill01_FindSummon(TArray<int32>* 返回的eid列表);
	void Heitao_Skill02_Search(TArray<int32>* 返回的eid列表);
	void Common_NotBreakableItem(TArray<int32>* 返回的eid列表);
	void Common_IsRealSummon(TArray<int32>* 返回的eid列表);
	void Common_CreatorFilter(TArray<int32>* 返回的eid列表);
	void Common_NotCombatProp(TArray<int32>* 返回的eid列表);
	void Common_CreatureIdFilter(TArray<int32>* 返回的eid列表);
	void Common_ConditionFilter(TArray<int32>* 返回的eid列表);
	void Common_BuffFilter(TArray<int32>* 返回的eid列表);
	void Common_AttrFilter(TArray<int32>* 返回的eid列表);
	void FilterResult(TScriptInterface<class IEffectSourceInterface> Source_0, const TArray<int32>& 目标eid列表_0, TArray<int32>& 返回的eid列表, const class FString& 过滤函数名);
	void Common_RoleIdFilter(TArray<int32>* 返回的eid列表);
	void Common_InnerRing(TArray<int32>* 返回的eid列表);
	void Common_Random(TArray<int32>* 返回的eid列表);
	void LockOn(TArray<int32>* 返回的eid列表);
	void HelpAimFilter(TArray<int32>* 返回的eid列表);
	void AimFilter(TArray<int32>* 返回的eid列表);
	void DoBPFilter(const TScriptInterface<class IEffectSourceInterface>& Source_0, const TArray<int32>& TargetEids);
	void ExecuteUbergraph_TargetFilterComponent(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TargetFilterComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TargetFilterComponent_C")
	}
	static class UTargetFilterComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetFilterComponent_C>();
	}
};
DUMPER7_ASSERTS_UTargetFilterComponent_C;

}

