#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: Transient

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "EM_structs.hpp"
#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// LuaFunction Transient.LUA_OVERRIDES_BP_CameraRotationComponent_C_2147482615.CameraLookToActor
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_CameraRotationComponent_C_2147482615_CameraLookToActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEasingFunc                                   EasingFunc;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableUserInput;                                 // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_CameraRotationComponent_C_2147482615_CameraLookToActor;

// LuaFunction Transient.LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_ReceiveEndPlay;

// LuaFunction Transient.LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241.CommonInitInfo
// 0x03C0 (0x03C0 - 0x0000)
struct LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_CommonInitInfo final
{
public:
	struct FCreateUnitContext                     Info;                                              // 0x0000(0x03C0)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_CommonInitInfo;

// LuaFunction Transient.LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241.OnActorReady
// 0x03C0 (0x03C0 - 0x0000)
struct LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_OnActorReady final
{
public:
	struct FCreateUnitContext                     Info;                                              // 0x0000(0x03C0)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_OnActorReady;

// LuaFunction Transient.LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241.PreInitInfo
// 0x03C0 (0x03C0 - 0x0000)
struct LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_PreInitInfo final
{
public:
	struct FCreateUnitContext                     Info;                                              // 0x0000(0x03C0)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_PreInitInfo;

// LuaFunction Transient.LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241.SetBoxExtent_Lua
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_SetBoxExtent_Lua final
{
public:
	struct FVector                                NewBoxExtent;                                      // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TipBoxExtent;                                      // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_SetBoxExtent_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241.ClientInitInfo
// 0x03C0 (0x03C0 - 0x0000)
struct LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_ClientInitInfo final
{
public:
	struct FCreateUnitContext                     Info;                                              // 0x0000(0x03C0)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_ClientInitInfo;

// LuaFunction Transient.LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241.CheckUnitNeedStorage
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_CheckUnitNeedStorage final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_CheckUnitNeedStorage;

// LuaFunction Transient.LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241.GetUnitRealType
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_GetUnitRealType final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_GetUnitRealType;

// LuaFunction Transient.LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241.InitActorInfo
// 0x03C0 (0x03C0 - 0x0000)
struct LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_InitActorInfo final
{
public:
	struct FCreateUnitContext                     Info;                                              // 0x0000(0x03C0)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_InitActorInfo;

// LuaFunction Transient.LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241.CreateMechanismData_Lua
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_CreateMechanismData_Lua final
{
public:
	class FName                                   InUnitType;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InUnitId;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_CreateMechanismData_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241.AuthorityInitInfo
// 0x03C0 (0x03C0 - 0x0000)
struct LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_AuthorityInitInfo final
{
public:
	struct FCreateUnitContext                     Info;                                              // 0x0000(0x03C0)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_AuthorityInitInfo;

// LuaFunction Transient.LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241.InitCreatorInfo
// 0x03C0 (0x03C0 - 0x0000)
struct LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_InitCreatorInfo final
{
public:
	struct FCreateUnitContext                     Info;                                              // 0x0000(0x03C0)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_InitCreatorInfo;

// LuaFunction Transient.LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241.RegionOnEMActorDestroy
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_RegionOnEMActorDestroy final
{
public:
	EDestroyReason                                DestroyReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class AEMGameMode*                            GameMode;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_RegionOnEMActorDestroy;

// LuaFunction Transient.LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241.OnRegionDataAllocated_Lua
// 0x0040 (0x0040 - 0x0000)
struct LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_OnRegionDataAllocated_Lua final
{
public:
	int32                                         InRegionDataTableIndex;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 InWorldRegionEid;                                  // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERegionDataType                               InRegionDataType;                                  // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	int32                                         InSubRegionId;                                     // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InUnitType;                                        // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InUnitId;                                          // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InLocation;                                        // 0x0034(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_OnRegionDataAllocated_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241.OnEMActorDestroy
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_OnEMActorDestroy final
{
public:
	EDestroyReason                                DestroyReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_OnEMActorDestroy;

// LuaFunction Transient.LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241.SetCollisionType_Lua
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_SetCollisionType_Lua final
{
public:
	class FName                                   componentName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChannelIndex;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionResponse                            Response;                                          // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Reset;                                             // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_AOITriggerBox_C_2147472241_SetCollisionType_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_GameFlowManager_C_2147482618.CreateFlow
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_GameFlowManager_C_2147482618_CreateFlow final
{
public:
	class FName                                   FlowName;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameFlow*                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_GameFlowManager_C_2147482618_CreateFlow;

// LuaFunction Transient.LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983.IsCanInteractive
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983_IsCanInteractive final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983_IsCanInteractive;

// LuaFunction Transient.LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983.OnStartInteractive
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983_OnStartInteractive final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983_OnStartInteractive;

// LuaFunction Transient.LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983.DisplayInteractiveBtn
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983_DisplayInteractiveBtn final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983_DisplayInteractiveBtn;

// LuaFunction Transient.LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983.OnEndInteractive
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983_OnEndInteractive final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983_OnEndInteractive;

// LuaFunction Transient.LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983.BtnClicked
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983_BtnClicked final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InPressTimeSeconds;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983_BtnClicked;

// LuaFunction Transient.LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983.SetInteractiveName
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983_SetInteractiveName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983_SetInteractiveName;

// LuaFunction Transient.LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983.RefreshInteractiveBtn
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983_RefreshInteractiveBtn final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983_RefreshInteractiveBtn;

// LuaFunction Transient.LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983.NotDisplayInteractiveBtn
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983_NotDisplayInteractiveBtn final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_TalkItemInteractiveComponent_C_2147480983_NotDisplayInteractiveBtn;

// LuaFunction Transient.LUA_OVERRIDES_BP_FXComponent_C_2147482314.GetPlayCircleFxDecalCNParamName
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_BP_FXComponent_C_2147482314_GetPlayCircleFxDecalCNParamName final
{
public:
	class FName                                   OutInnterRadiusName;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutOutsideRadiusName;                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutAngelName;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_FXComponent_C_2147482314_GetPlayCircleFxDecalCNParamName;

// LuaFunction Transient.LUA_OVERRIDES_BP_EMWidgetComponent_C_2147480426.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BP_EMWidgetComponent_C_2147480426_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_EMWidgetComponent_C_2147480426_ReceiveEndPlay;

// LuaFunction Transient.LUA_OVERRIDES_BP_EMWidgetComponent_C_2147480426.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BP_EMWidgetComponent_C_2147480426_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_EMWidgetComponent_C_2147480426_ReceiveTick;

// LuaFunction Transient.LUA_OVERRIDES_BP_StoryLogSubsystem_C_2147482619.OnPrintToFeiShu
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_BP_StoryLogSubsystem_C_2147482619_OnPrintToFeiShu final
{
public:
	class FString                                 Title;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Message;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_StoryLogSubsystem_C_2147482619_OnPrintToFeiShu;

// LuaFunction Transient.LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616.BtnClicked
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_BtnClicked final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InPressTimeSeconds;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_BtnClicked;

// LuaFunction Transient.LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616.DisplayInteractiveBtn
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_DisplayInteractiveBtn final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_DisplayInteractiveBtn;

// LuaFunction Transient.LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616.OnStartInteractive
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_OnStartInteractive final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_OnStartInteractive;

// LuaFunction Transient.LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616.OnEndInteractive
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_OnEndInteractive final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_OnEndInteractive;

// LuaFunction Transient.LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616.SetInteractiveName
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_SetInteractiveName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_SetInteractiveName;

// LuaFunction Transient.LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616.NotDisplayInteractiveBtn
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_NotDisplayInteractiveBtn final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_NotDisplayInteractiveBtn;

// LuaFunction Transient.LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616.RefreshInteractiveBtn
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_RefreshInteractiveBtn final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_RefreshInteractiveBtn;

// LuaFunction Transient.LUA_OVERRIDES_ClassCacheSubsystem_2147482480.GetMaxNum
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_ClassCacheSubsystem_2147482480_GetMaxNum final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_ClassCacheSubsystem_2147482480_GetMaxNum;

// LuaFunction Transient.LUA_OVERRIDES_BP_ExpressionComponent_C_2147482617.PlayFacialAnimation
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BP_ExpressionComponent_C_2147482617_PlayFacialAnimation final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_ExpressionComponent_C_2147482617_PlayFacialAnimation;

// LuaFunction Transient.LUA_OVERRIDES_TargetFilterComponent_C_2147481162.DoBPFilter
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_TargetFilterComponent_C_2147481162_DoBPFilter final
{
public:
	TScriptInterface<class IEffectSourceInterface> Source;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper)
	TArray<int32>                                 TargetEids;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_TargetFilterComponent_C_2147481162_DoBPFilter;

// LuaFunction Transient.LUA_OVERRIDES_BP_RPCComponent_C_2147482614.OnRequestSabotageGuideInfo_Lua
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_BP_RPCComponent_C_2147482614_OnRequestSabotageGuideInfo_Lua final
{
public:
	TArray<int32>                                 Eids;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                 UnitIds;                                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_RPCComponent_C_2147482614_OnRequestSabotageGuideInfo_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_RPCComponent_C_2147482614.OnRequestGuideInfo_Lua
// 0x00D0 (0x00D0 - 0x0000)
struct LUA_OVERRIDES_BP_RPCComponent_C_2147482614_OnRequestGuideInfo_Lua final
{
public:
	struct FSnapShotInfo                          Info;                                              // 0x0000(0x00D0)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_RPCComponent_C_2147482614_OnRequestGuideInfo_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_RPCComponent_C_2147482614.GMServerGetDrop_Lua
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_RPCComponent_C_2147482614_GMServerGetDrop_Lua final
{
public:
	int32                                         DropId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_RPCComponent_C_2147482614_GMServerGetDrop_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_RPCComponent_C_2147482614.OnDungeonSettlement_Server_Lua
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BP_RPCComponent_C_2147482614_OnDungeonSettlement_Server_Lua final
{
public:
	bool                                          bIsWin;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_RPCComponent_C_2147482614_OnDungeonSettlement_Server_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_RPCComponent_C_2147482614.OnDungeonSettlement_Client_Lua
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BP_RPCComponent_C_2147482614_OnDungeonSettlement_Client_Lua final
{
public:
	bool                                          bIsWin;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_RPCComponent_C_2147482614_OnDungeonSettlement_Client_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_RPCComponent_C_2147482614.SetVariableBool_Lua
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_RPCComponent_C_2147482614_SetVariableBool_Lua final
{
public:
	class FName                                   VariableName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Variable;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	int32                                         TargetEid;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_RPCComponent_C_2147482614_SetVariableBool_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_DestructablePart_C_2147481173.OnDamaged
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_DestructablePart_C_2147481173_OnDamaged final
{
public:
	class UDamageStruct*                          DamageEvent;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_DestructablePart_C_2147481173_OnDamaged;

// LuaFunction Transient.LUA_OVERRIDES_BP_DestructablePart_C_2147481173.SetTimeDilationByBattle
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_DestructablePart_C_2147481173_SetTimeDilationByBattle final
{
public:
	float                                         TimeDilation;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPause;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_DestructablePart_C_2147481173_SetTimeDilationByBattle;

// LuaFunction Transient.LUA_OVERRIDES_BP_DestructablePart_C_2147481173.GetTableAttrNames_Lua
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_DestructablePart_C_2147481173_GetTableAttrNames_Lua final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_DestructablePart_C_2147481173_GetTableAttrNames_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_DestructablePart_C_2147481173.GetEid_Lua
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BP_DestructablePart_C_2147481173_GetEid_Lua final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_DestructablePart_C_2147481173_GetEid_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_DestructablePart_C_2147481173.InitInfoFromComponent
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_DestructablePart_C_2147481173_InitInfoFromComponent final
{
public:
	class ACharacterBase*                         InOnwer;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDestructableBodyComponent*             InfoComp;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_DestructablePart_C_2147481173_InitInfoFromComponent;

// LuaFunction Transient.LUA_OVERRIDES_BP_DestructablePart_C_2147481173.OnDead_Lua
// 0x000C (0x000C - 0x0000)
struct LUA_OVERRIDES_BP_DestructablePart_C_2147481173_OnDead_Lua final
{
public:
	int32                                         KillMineRoleEid;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KillMineSkillId;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDeathReason                                  DeathReason;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_DestructablePart_C_2147481173_OnDead_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_DestructablePart_C_2147481173.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BP_DestructablePart_C_2147481173_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_DestructablePart_C_2147481173_ReceiveEndPlay;

// LuaFunction Transient.LUA_OVERRIDES_NpcHeadImpressionWidgetMgr_2147482541.GetNpcImpressionState
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_NpcHeadImpressionWidgetMgr_2147482541_GetNpcImpressionState final
{
public:
	class ANpcCharacter*                          NPC;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_NpcHeadImpressionWidgetMgr_2147482541_GetNpcImpressionState;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.DoBattleCommand
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_DoBattleCommand final
{
public:
	struct FEffectStruct                          EffectStruct;                                      // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	bool                                          bPrintToClient;                                    // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	int32                                         EidFrom;                                           // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_DoBattleCommand;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.ExecuteFireDanmaku
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_ExecuteFireDanmaku final
{
public:
	TScriptInterface<class IEffectSourceInterface> Source;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	int32                                         DanmakuId;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_ExecuteFireDanmaku;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.GetConfigFilterResults_Lua
// 0x0150 (0x0150 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_GetConfigFilterResults_Lua final
{
public:
	TScriptInterface<class IEffectSourceInterface> Source;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	const class AActor*                           PreTarget;                                         // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LuaFilter;                                         // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetFilterKey;                                   // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRangeModifyInfo                       ModifyInfo;                                        // 0x0028(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          Debug;                                             // 0x0034(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0xB];                                       // 0x0035(0x000B)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FSkillEffectInfo                       SkillEffectInfo;                                   // 0x0040(0x00A0)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	const class USkillObject*                     Skill;                                             // 0x00E0(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         Targets;                                           // 0x00E8(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	TMap<int32, struct FCollisionsArray>          Eid2CollisionComponents;                           // 0x00F8(0x0050)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_GetConfigFilterResults_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.AddCaptureResult
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_AddCaptureResult final
{
public:
	class FString                                 ResultName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetEid;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KillMineRoleEid;                                   // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KillMineSkillId;                                   // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDeathReason                                  DeathReason;                                       // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_AddCaptureResult;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.FiringRaySkillCreature
// 0x0060 (0x0060 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_FiringRaySkillCreature final
{
public:
	struct FRaySkillCreateData                    RaySkillCreateData;                                // 0x0000(0x0060)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_FiringRaySkillCreature;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.PreloadSkillCreature_Lua
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_PreloadSkillCreature_Lua final
{
public:
	const class ACharacterBase*                   Source;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AWeaponBase*                      Weapon;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPersistent;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_PreloadSkillCreature_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.IsInSettlement
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_IsInSettlement final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_IsInSettlement;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.RealExecuteOneEffect_Lua
// 0x02B0 (0x02B0 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_RealExecuteOneEffect_Lua final
{
public:
	struct FSkillEffectStruct                     EffectStruct;                                      // 0x0000(0x02A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	uint8                                         Index_0;                                           // 0x02A0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_RealExecuteOneEffect_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.ShowError_UI_Inner_Lua
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_ShowError_UI_Inner_Lua final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Title;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_ShowError_UI_Inner_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.GetServerClientBothFunction_Lua
// 0x0050 (0x0050 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_GetServerClientBothFunction_Lua final
{
public:
	TSet<class FName>                             ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_GetServerClientBothFunction_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_ReceiveEndPlay;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.GetPureServerTargetFilters_Lua
// 0x0050 (0x0050 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_GetPureServerTargetFilters_Lua final
{
public:
	TSet<class FName>                             ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_GetPureServerTargetFilters_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.GetLimitSeNumEachAttack
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_GetLimitSeNumEachAttack final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_GetLimitSeNumEachAttack;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.GetServerClientBothNetMulticastFunction_Lua
// 0x0050 (0x0050 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_GetServerClientBothNetMulticastFunction_Lua final
{
public:
	TSet<class FName>                             ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_GetServerClientBothNetMulticastFunction_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.GetSkillCreaturePoolRefreshTime
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_GetSkillCreaturePoolRefreshTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_GetSkillCreaturePoolRefreshTime;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.GetLuaOverrideFunction_Lua
// 0x0050 (0x0050 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_GetLuaOverrideFunction_Lua final
{
public:
	TSet<class FName>                             ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_GetLuaOverrideFunction_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.Recovery
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_Recovery final
{
public:
	int32                                         TargetEid;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_Recovery;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.GetSkillCreaturePoolCleanTime
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_GetSkillCreaturePoolCleanTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_GetSkillCreaturePoolCleanTime;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.GetClientOnlyFunction_Lua
// 0x0050 (0x0050 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_GetClientOnlyFunction_Lua final
{
public:
	TSet<class FName>                             ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_GetClientOnlyFunction_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.StandardShowBattleErrorLua
// 0x0030 (0x0030 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_StandardShowBattleErrorLua final
{
public:
	EShowBattleErrorType                          Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 Title;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Content;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCallFromCpp;                                      // 0x0028(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_StandardShowBattleErrorLua;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.ShowBattleErrorLua
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_ShowBattleErrorLua final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HideTraceback;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_ShowBattleErrorLua;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.QuickRecovery_Impl
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_QuickRecovery_Impl final
{
public:
	TScriptInterface<class IEffectSourceInterface> EffectSourceInterface;                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_QuickRecovery_Impl;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.ExecuteEffectResults
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_ExecuteEffectResults final
{
public:
	struct FEffectStruct                          EffectStruct;                                      // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_ExecuteEffectResults;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.ShowError_Monster_Inner_Lua
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_ShowError_Monster_Inner_Lua final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Title;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_ShowError_Monster_Inner_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_Battle_C_2147481163.GetClientPredictFunction_Lua
// 0x0050 (0x0050 - 0x0000)
struct LUA_OVERRIDES_BP_Battle_C_2147481163_GetClientPredictFunction_Lua final
{
public:
	TSet<class FName>                             ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_Battle_C_2147481163_GetClientPredictFunction_Lua;

// LuaFunction Transient.LUA_OVERRIDES_WorldTravelSubsystem_2147482451.K2_PreChangeScene
// 0x0002 (0x0002 - 0x0000)
struct LUA_OVERRIDES_WorldTravelSubsystem_2147482451_K2_PreChangeScene final
{
public:
	EWorldTravelType                              WorldType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bQueryHotfix;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WorldTravelSubsystem_2147482451_K2_PreChangeScene;

// LuaFunction Transient.LUA_OVERRIDES_WorldTravelSubsystem_2147482451.SetLevelLoadJsonName
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_WorldTravelSubsystem_2147482451_SetLevelLoadJsonName final
{
public:
	int32                                         DungeonId;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WorldTravelSubsystem_2147482451_SetLevelLoadJsonName;

// LuaFunction Transient.LUA_OVERRIDES_BP_EMGameViewportClient_C_2147482574.OnInputAxis_Lua
// 0x0030 (0x0030 - 0x0000)
struct LUA_OVERRIDES_BP_EMGameViewportClient_C_2147482574_OnInputAxis_Lua final
{
public:
	int32                                         ControllerId;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FKey                                   Key;                                               // 0x0008(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delta;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSamples;                                        // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGamepad;                                          // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_EMGameViewportClient_C_2147482574_OnInputAxis_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_EMGameViewportClient_C_2147482574.OnInputKey_Lua
// 0x0028 (0x0028 - 0x0000)
struct LUA_OVERRIDES_BP_EMGameViewportClient_C_2147482574_OnInputKey_Lua final
{
public:
	int32                                         ControllerId;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FKey                                   Key;                                               // 0x0008(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   EventType;                                         // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_EMGameViewportClient_C_2147482574_OnInputKey_Lua;

// LuaFunction Transient.LUA_OVERRIDES_WBP_BlackScreen_C_2147482613.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_WBP_BlackScreen_C_2147482613_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_BlackScreen_C_2147482613_PreConstruct;

// LuaFunction Transient.LUA_OVERRIDES_WBP_PlayerBloodReturn_C_2147480065.SequenceEvent_PlayUISound
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_PlayerBloodReturn_C_2147480065_SequenceEvent_PlayUISound final
{
public:
	class FString                                 EventPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventKey;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_PlayerBloodReturn_C_2147480065_SequenceEvent_PlayUISound;

// LuaFunction Transient.LUA_OVERRIDES_WBP_PlayerBloodReturn_C_2147480065.OnPreviewKeyDown
// 0x0128 (0x0128 - 0x0000)
struct LUA_OVERRIDES_WBP_PlayerBloodReturn_C_2147480065_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(Parm, NativeAccessSpecifierPublic)
