#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "EM_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// LuaFunction Transient.LUA_OVERRIDES_WBP_NPC_Bubble_Short_C_2147482252.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_WBP_NPC_Bubble_Short_C_2147482252_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_NPC_Bubble_Short_C_2147482252_PreConstruct;

// LuaFunction Transient.LUA_OVERRIDES_WBP_NPC_Bubble_Short_C_2147482252.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_NPC_Bubble_Short_C_2147482252_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_NPC_Bubble_Short_C_2147482252_OnAnimationFinished;

// LuaFunction Transient.LUA_OVERRIDES_BP_TalkSubsystem_C_2147482611.PlayTalk
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_BP_TalkSubsystem_C_2147482611_PlayTalk final
{
public:
	int32                                         TalkConfigKey;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayTalkAsyncAction*                   TalkAction;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 AudioAttachActor;                                  // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_TalkSubsystem_C_2147482611_PlayTalk;

// LuaFunction Transient.LUA_OVERRIDES_BP_TalkSubsystem_C_2147482611.ScreenCaptureForUISequenceEvent
// 0x0030 (0x0030 - 0x0000)
struct LUA_OVERRIDES_BP_TalkSubsystem_C_2147482611_ScreenCaptureForUISequenceEvent final
{
public:
	class FString                                 UIName;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WidgetName;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         MaterialParamName;                                 // 0x0020(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_TalkSubsystem_C_2147482611_ScreenCaptureForUISequenceEvent;

// LuaFunction Transient.LUA_OVERRIDES_BP_TalkSubsystem_C_2147482611.RegisterTalkTask
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_TalkSubsystem_C_2147482611_RegisterTalkTask final
{
public:
	int32                                         TalkConfigKey;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_TalkSubsystem_C_2147482611_RegisterTalkTask;

// LuaFunction Transient.LUA_OVERRIDES_BP_TalkSubsystem_C_2147482611.IsGameUIHidden
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BP_TalkSubsystem_C_2147482611_IsGameUIHidden final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_TalkSubsystem_C_2147482611_IsGameUIHidden;

// LuaFunction Transient.LUA_OVERRIDES_BP_TalkSubsystem_C_2147482611.PlayUIAnimationSequenceEvent
// 0x0038 (0x0038 - 0x0000)
struct LUA_OVERRIDES_BP_TalkSubsystem_C_2147482611_PlayUIAnimationSequenceEvent final
{
public:
	class FString                                 UIName;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AnimationName;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 QuestChainId;                                      // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCloseUIAfterPlay;                                 // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_TalkSubsystem_C_2147482611_PlayUIAnimationSequenceEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ServerSelect_C_2147482169.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_PreConstruct;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ServerSelect_C_2147482169.PlayUISound
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_PlayUISound final
{
public:
	class FString                                 EventPath;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_PlayUISound;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ServerSelect_C_2147482169.ReceiveExitState
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_ReceiveExitState final
{
public:
	EStackAction                                  StackAction;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_ReceiveExitState;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ServerSelect_C_2147482169.CreateWidgetNew
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_CreateWidgetNew final
{
public:
	class FString                                 UIName;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUIState*                               ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_CreateWidgetNew;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ServerSelect_C_2147482169.OnFocusReceived
// 0x00F8 (0x00F8 - 0x0000)
struct LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_OnFocusReceived;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ServerSelect_C_2147482169.OnKeyUp
// 0x0128 (0x0128 - 0x0000)
struct LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(Parm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_OnKeyUp;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ServerSelect_C_2147482169.OnPreviewKeyDown
// 0x0128 (0x0128 - 0x0000)
struct LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(Parm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_OnPreviewKeyDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ServerSelect_C_2147482169.SwitchArea
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_SwitchArea final
{
public:
	int32                                         Area;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_SwitchArea;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ServerSelect_C_2147482169.OnKeyDown
// 0x0128 (0x0128 - 0x0000)
struct LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(Parm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_OnKeyDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ServerSelect_C_2147482169.ReceiveEnterState
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_ReceiveEnterState final
{
public:
	EStackAction                                  StackAction;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_ReceiveEnterState;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ServerSelect_C_2147482169.Show
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_Show final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_Show;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ServerSelect_C_2147482169.Hide
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_Hide final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_Hide;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ServerSelect_C_2147482169.SearchServer
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_SearchServer final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_SearchServer;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ServerSelect_C_2147482169.GetWorldPosition
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_GetWorldPosition final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_GetWorldPosition;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ServerSelect_C_2147482169.SequenceEvent_PlayUISound
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_SequenceEvent_PlayUISound final
{
public:
	class FString                                 EventPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventKey;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ServerSelect_C_2147482169_SequenceEvent_PlayUISound;

// LuaFunction Transient.LUA_OVERRIDES_BP_CameraRotationComponent_C_2147482615.CameraLookToActor
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_CameraRotationComponent_C_2147482615_CameraLookToActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEasingFunc                                   EasingFunc;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableUserInput;                                 // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_CameraRotationComponent_C_2147482615_CameraLookToActor;

// LuaFunction Transient.LUA_OVERRIDES_BP_BuffManager_C_2147482313.InitBPVarsForBuff
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_BuffManager_C_2147482313_InitBPVarsForBuff final
{
public:
	class UBuff*                                  Buff;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_BuffManager_C_2147482313_InitBPVarsForBuff;

// LuaFunction Transient.LUA_OVERRIDES_BP_BuffManager_C_2147482313.HasDestructParts
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_BuffManager_C_2147482313_HasDestructParts final
{
public:
	bool                                          Invincible;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentLockHp;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_BuffManager_C_2147482313_HasDestructParts;

// LuaFunction Transient.LUA_OVERRIDES_BP_BuffManager_C_2147482313.OnBuffsChanged_New
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_BuffManager_C_2147482313_OnBuffsChanged_New final
{
public:
	TArray<struct FBuffChangedPropInfo_Lua>       BuffChangedPropInfo;                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_BuffManager_C_2147482313_OnBuffsChanged_New;

// LuaFunction Transient.LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616.OnEndInteractive
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_OnEndInteractive final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_OnEndInteractive;

// LuaFunction Transient.LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616.DisplayInteractiveBtn
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_DisplayInteractiveBtn final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_DisplayInteractiveBtn;

// LuaFunction Transient.LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616.RefreshInteractiveBtn
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_RefreshInteractiveBtn final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_RefreshInteractiveBtn;

// LuaFunction Transient.LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616.NotDisplayInteractiveBtn
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_NotDisplayInteractiveBtn final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_NotDisplayInteractiveBtn;

// LuaFunction Transient.LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616.SetInteractiveName
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_SetInteractiveName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_SetInteractiveName;

// LuaFunction Transient.LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616.OnStartInteractive
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_OnStartInteractive final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_OnStartInteractive;

// LuaFunction Transient.LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616.BtnClicked
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_BtnClicked final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InPressTimeSeconds;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_PickUpInteractiveComponent_C_2147482616_BtnClicked;

// LuaFunction Transient.LUA_OVERRIDES_AvatarFunctionLibrary_2147482482.GetExploreGroupStatus
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_GetExploreGroupStatus final
{
public:
	int32                                         ExploreGroupId;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EExploreGroupStatus                           ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_GetExploreGroupStatus;

// LuaFunction Transient.LUA_OVERRIDES_AvatarFunctionLibrary_2147482482.GetAvatarName
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_GetAvatarName final
{
public:
	int32                                         InParam;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_GetAvatarName;

// LuaFunction Transient.LUA_OVERRIDES_AvatarFunctionLibrary_2147482482.IsQuestChainUnlock
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsQuestChainUnlock final
{
public:
	int32                                         QuestChainId;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsQuestChainUnlock;

// LuaFunction Transient.LUA_OVERRIDES_AvatarFunctionLibrary_2147482482.RougeLikeTryRecover
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_RougeLikeTryRecover final
{
public:
	class ACharacterBase*                         Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTeamRecoveryRespawnRuleHandler_Rouge*  Handler;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_RougeLikeTryRecover;

// LuaFunction Transient.LUA_OVERRIDES_AvatarFunctionLibrary_2147482482.IsQuestChainLock
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsQuestChainLock final
{
public:
	int32                                         QuestChainId;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsQuestChainLock;

// LuaFunction Transient.LUA_OVERRIDES_AvatarFunctionLibrary_2147482482.IsQuestChainFinished
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsQuestChainFinished final
{
public:
	int32                                         QuestChainId;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsQuestChainFinished;

// LuaFunction Transient.LUA_OVERRIDES_AvatarFunctionLibrary_2147482482.GetAvatarUid
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_GetAvatarUid final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_GetAvatarUid;

// LuaFunction Transient.LUA_OVERRIDES_AvatarFunctionLibrary_2147482482.IsStorylineComplete
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsStorylineComplete final
{
public:
	int32                                         TalkTriggerId;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsStorylineComplete;

// LuaFunction Transient.LUA_OVERRIDES_AvatarFunctionLibrary_2147482482.IsQuestDoing
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsQuestDoing final
{
public:
	int32                                         QuestId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsQuestDoing;

// LuaFunction Transient.LUA_OVERRIDES_AvatarFunctionLibrary_2147482482.IsImpressionCheckFailure
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsImpressionCheckFailure final
{
public:
	int32                                         DialogueId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsImpressionCheckFailure;

// LuaFunction Transient.LUA_OVERRIDES_AvatarFunctionLibrary_2147482482.IsImpressionCheckSuccess
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsImpressionCheckSuccess final
{
public:
	int32                                         DialogueId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsImpressionCheckSuccess;

// LuaFunction Transient.LUA_OVERRIDES_AvatarFunctionLibrary_2147482482.IsQuestUnaccpted
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsQuestUnaccpted final
{
public:
	int32                                         QuestId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsQuestUnaccpted;

// LuaFunction Transient.LUA_OVERRIDES_AvatarFunctionLibrary_2147482482.IsQuestChainDoing
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsQuestChainDoing final
{
public:
	int32                                         QuestChainId;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsQuestChainDoing;

// LuaFunction Transient.LUA_OVERRIDES_AvatarFunctionLibrary_2147482482.IsQuestFinished
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsQuestFinished final
{
public:
	int32                                         QuestId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsQuestFinished;

// LuaFunction Transient.LUA_OVERRIDES_AvatarFunctionLibrary_2147482482.IsStorylineUnComplete
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsStorylineUnComplete final
{
public:
	int32                                         TalkTriggerId;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_AvatarFunctionLibrary_2147482482_IsStorylineUnComplete;

// LuaFunction Transient.LUA_OVERRIDES_BP_StoryLogSubsystem_C_2147482619.OnPrintToFeiShu
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_BP_StoryLogSubsystem_C_2147482619_OnPrintToFeiShu final
{
public:
	class FString                                 Title;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Message;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_StoryLogSubsystem_C_2147482619_OnPrintToFeiShu;

// LuaFunction Transient.LUA_OVERRIDES_BP_GameFlowManager_C_2147482618.CreateFlow
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_GameFlowManager_C_2147482618_CreateFlow final
{
public:
	class FName                                   FlowName;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameFlow*                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_GameFlowManager_C_2147482618_CreateFlow;

// LuaFunction Transient.LUA_OVERRIDES_WBP_Npc_Name_C_2147482249.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_WBP_Npc_Name_C_2147482249_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_Npc_Name_C_2147482249_PreConstruct;

// LuaFunction Transient.LUA_OVERRIDES_BP_ExpressionComponent_C_2147482617.PlayFacialAnimation
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BP_ExpressionComponent_C_2147482617_PlayFacialAnimation final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_ExpressionComponent_C_2147482617_PlayFacialAnimation;

// LuaFunction Transient.LUA_OVERRIDES_BP_RPCComponent_C_2147482614.GMServerGetDrop_Lua
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_RPCComponent_C_2147482614_GMServerGetDrop_Lua final
{
public:
	int32                                         DropId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_RPCComponent_C_2147482614_GMServerGetDrop_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_RPCComponent_C_2147482614.OnDungeonSettlement_Server_Lua
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BP_RPCComponent_C_2147482614_OnDungeonSettlement_Server_Lua final
{
public:
	bool                                          bIsWin;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_RPCComponent_C_2147482614_OnDungeonSettlement_Server_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_RPCComponent_C_2147482614.OnRequestGuideInfo_Lua
// 0x00D0 (0x00D0 - 0x0000)
struct LUA_OVERRIDES_BP_RPCComponent_C_2147482614_OnRequestGuideInfo_Lua final
{
public:
	struct FSnapShotInfo                          Info;                                              // 0x0000(0x00D0)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_RPCComponent_C_2147482614_OnRequestGuideInfo_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_RPCComponent_C_2147482614.OnDungeonSettlement_Client_Lua
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_BP_RPCComponent_C_2147482614_OnDungeonSettlement_Client_Lua final
{
public:
	bool                                          bIsWin;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_RPCComponent_C_2147482614_OnDungeonSettlement_Client_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_RPCComponent_C_2147482614.SetVariableBool_Lua
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_RPCComponent_C_2147482614_SetVariableBool_Lua final
{
public:
	class FName                                   VariableName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Variable;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetEid;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_RPCComponent_C_2147482614_SetVariableBool_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_RPCComponent_C_2147482614.OnRequestSabotageGuideInfo_Lua
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_BP_RPCComponent_C_2147482614_OnRequestSabotageGuideInfo_Lua final
{
public:
	TArray<int32>                                 Eids;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                 UnitIds;                                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_RPCComponent_C_2147482614_OnRequestSabotageGuideInfo_Lua;

// LuaFunction Transient.LUA_OVERRIDES_WBP_BlackScreen_C_2147482613.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_WBP_BlackScreen_C_2147482613_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_BlackScreen_C_2147482613_PreConstruct;

// LuaFunction Transient.LUA_OVERRIDES_BP_WildcardGameInstanceSubsystem_C_2147482612.ReplaceWildcard
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_BP_WildcardGameInstanceSubsystem_C_2147482612_ReplaceWildcard final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_WildcardGameInstanceSubsystem_C_2147482612_ReplaceWildcard;

// LuaFunction Transient.LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_PreConstruct;

// LuaFunction Transient.LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978.OnKeyUp
// 0x0128 (0x0128 - 0x0000)
struct LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(Parm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_OnKeyUp;

// LuaFunction Transient.LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978.OnPreviewKeyDown
// 0x0128 (0x0128 - 0x0000)
struct LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(Parm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_OnPreviewKeyDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978.OnKeyDown
// 0x0128 (0x0128 - 0x0000)
struct LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(Parm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_OnKeyDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978.Hide
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_Hide final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_Hide;

// LuaFunction Transient.LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978.Show
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_Show final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_Show;

// LuaFunction Transient.LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978.Tick
// 0x003C (0x003C - 0x0000)
struct LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_Tick;

// LuaFunction Transient.LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978.SequenceEvent_PlayUISound
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_SequenceEvent_PlayUISound final
{
public:
	class FString                                 EventPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventKey;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_SequenceEvent_PlayUISound;

// LuaFunction Transient.LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978.ReceiveExitState
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_ReceiveExitState final
{
public:
	EStackAction                                  StackAction;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_ReceiveExitState;

// LuaFunction Transient.LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978.CreateWidgetNew
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_CreateWidgetNew final
{
public:
	class FString                                 UIName;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUIState*                               ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_CreateWidgetNew;

// LuaFunction Transient.LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978.OnFocusReceived
// 0x00F8 (0x00F8 - 0x0000)
struct LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_OnFocusReceived;

// LuaFunction Transient.LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978.GetWorldPosition
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_GetWorldPosition final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_GetWorldPosition;

// LuaFunction Transient.LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978.ReceiveEnterState
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_ReceiveEnterState final
{
public:
	EStackAction                                  StackAction;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_Battle_Interactive_P_C_2147481978_ReceiveEnterState;

// LuaFunction Transient.LUA_OVERRIDES_BP_WeaponFashion_C_2147482609.GetDefaultFresnel_Lua
// 0x0034 (0x0034 - 0x0000)
struct LUA_OVERRIDES_BP_WeaponFashion_C_2147482609_GetDefaultFresnel_Lua final
{
public:
	struct FFresnelParams                         ReturnValue;                                       // 0x0000(0x0034)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_WeaponFashion_C_2147482609_GetDefaultFresnel_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_HollowSphereComponent_C_2147482315.HandleOnBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_BP_HollowSphereComponent_C_2147482315_HandleOnBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_HollowSphereComponent_C_2147482315_HandleOnBeginOverlap;

// LuaFunction Transient.LUA_OVERRIDES_NpcHeadImpressionWidgetMgr_2147482541.GetNpcImpressionState
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_NpcHeadImpressionWidgetMgr_2147482541_GetNpcImpressionState final
{
public:
	class ANpcCharacter*                          NPC;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_NpcHeadImpressionWidgetMgr_2147482541_GetNpcImpressionState;

// LuaFunction Transient.LUA_OVERRIDES_BP_BDCUploadSubSystem_C_2147482593.GetSceneNo_Lua
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_BDCUploadSubSystem_C_2147482593_GetSceneNo_Lua final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_BDCUploadSubSystem_C_2147482593_GetSceneNo_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_BDCUploadSubSystem_C_2147482593.RecordDamageTrack
// 0x00A8 (0x00A8 - 0x0000)
struct LUA_OVERRIDES_BP_BDCUploadSubSystem_C_2147482593_RecordDamageTrack final
{
public:
	struct FDamageStructFowShow                   DamageEvent;                                       // 0x0000(0x00A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_BDCUploadSubSystem_C_2147482593_RecordDamageTrack;

// LuaFunction Transient.LUA_OVERRIDES_BP_BDCUploadSubSystem_C_2147482593.GetUploadBDCTrackStructCommonInfo_Lua
// 0x0038 (0x0038 - 0x0000)
struct LUA_OVERRIDES_BP_BDCUploadSubSystem_C_2147482593_GetUploadBDCTrackStructCommonInfo_Lua final
{
public:
	class FString                                 BonesId;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MapID;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Position;                                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_BDCUploadSubSystem_C_2147482593_GetUploadBDCTrackStructCommonInfo_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_BDCUploadSubSystem_C_2147482593.RecordDoDamageTrack
// 0x00A8 (0x00A8 - 0x0000)
struct LUA_OVERRIDES_BP_BDCUploadSubSystem_C_2147482593_RecordDoDamageTrack final
{
public:
	struct FDamageStructFowShow                   DamageEvent;                                       // 0x0000(0x00A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_BDCUploadSubSystem_C_2147482593_RecordDoDamageTrack;

// LuaFunction Transient.LUA_OVERRIDES_BP_UnitBudgetAllocatorSubsystem_C_2147482592.GetPlayerHighMeshLODIDConfig
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_UnitBudgetAllocatorSubsystem_C_2147482592_GetPlayerHighMeshLODIDConfig final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_UnitBudgetAllocatorSubsystem_C_2147482592_GetPlayerHighMeshLODIDConfig;

// LuaFunction Transient.LUA_OVERRIDES_BP_EMGameViewportClient_C_2147482574.OnInputAxis_Lua
// 0x0030 (0x0030 - 0x0000)
struct LUA_OVERRIDES_BP_EMGameViewportClient_C_2147482574_OnInputAxis_Lua final
{
public:
	int32                                         ControllerId;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Key;                                               // 0x0008(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delta;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSamples;                                        // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGamepad;                                          // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_EMGameViewportClient_C_2147482574_OnInputAxis_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_EMGameViewportClient_C_2147482574.OnInputKey_Lua
// 0x0028 (0x0028 - 0x0000)
struct LUA_OVERRIDES_BP_EMGameViewportClient_C_2147482574_OnInputKey_Lua final
{
public:
	int32                                         ControllerId;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Key;                                               // 0x0008(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   EventType;                                         // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_EMGameViewportClient_C_2147482574_OnInputKey_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_EMGameInstance_C_2147482570.GetDataInt
// 0x0018 (0x0018 - 0x0000)
struct LUA_OVERRIDES_BP_EMGameInstance_C_2147482570_GetDataInt final
{
public:
	class FName                                   TableName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TableId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_EMGameInstance_C_2147482570_GetDataInt;

// LuaFunction Transient.LUA_OVERRIDES_BP_EMGameInstance_C_2147482570.OnStart_Lua
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_BP_EMGameInstance_C_2147482570_OnStart_Lua final
{
public:
	int32                                         _GroupId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_EMGameInstance_C_2147482570_OnStart_Lua;

// LuaFunction Transient.LUA_OVERRIDES_BP_EMGameInstance_C_2147482570.OnPostWorldCleanup
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_BP_EMGameInstance_C_2147482570_OnPostWorldCleanup final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSessionEnded;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bCleanupResources;                                 // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_BP_EMGameInstance_C_2147482570_OnPostWorldCleanup;

// LuaFunction Transient.LUA_OVERRIDES_BP_EMGameInstance_C_2147482570.GetInt
// 0x0014 (0x0014 - 0x0000)
