#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: UIParticleSystem

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class UIParticleSystem.ParticleSystemWidget
// 0x0030 (0x0168 - 0x0138)
class UParticleSystemWidget final : public UWidget
{
public:
	class UParticleSystem*                        ParticleSystemTemplate;                            // 0x0138(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoActivate;                                     // 0x0140(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReactivate;                                       // 0x0141(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-DNA ])
	class UUIParticleComponent*                   WorldParticleComponent;                            // 0x0148(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 WorldParticleActor;                                // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_158[0x10];                                     // 0x0158(0x0010)(Fixing Struct Size After Last Property [ Dumper-DNA ])

public:
	void ActivateParticles(bool bActive, bool bReset);
	void SetReactivate(bool bActivateAndReset);

	class UParticleSystemComponent* GetParticleComponent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ParticleSystemWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ParticleSystemWidget")
	}
	static class UParticleSystemWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParticleSystemWidget>();
	}
};
DUMPER7_ASSERTS_UParticleSystemWidget;

// Class UIParticleSystem.UIParticleComponent
// 0x0000 (0x06D0 - 0x06D0)
class UUIParticleComponent final : public UParticleSystemComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIParticleComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIParticleComponent")
	}
	static class UUIParticleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIParticleComponent>();
	}
};
DUMPER7_ASSERTS_UUIParticleComponent;

// Class UIParticleSystem.UIParticleActor
// 0x0000 (0x02A0 - 0x02A0)
class AUIParticleActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIParticleActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIParticleActor")
	}
	static class AUIParticleActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUIParticleActor>();
	}
};
DUMPER7_ASSERTS_AUIParticleActor;

}

