#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: UnLua

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UnLua.UnLuaFunctionLibrary.GetFileLastModifiedTimestamp
// 0x0018 (0x0018 - 0x0000)
struct UnLuaFunctionLibrary_GetFileLastModifiedTimestamp final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaFunctionLibrary_GetFileLastModifiedTimestamp;

// Function UnLua.UnLuaFunctionLibrary.GetScriptRootPath
// 0x0010 (0x0010 - 0x0000)
struct UnLuaFunctionLibrary_GetScriptRootPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaFunctionLibrary_GetScriptRootPath;

// Function UnLua.UnLuaFunctionLibrary.LuaModuleHotfix
// 0x0030 (0x0030 - 0x0000)
struct UnLuaFunctionLibrary_LuaModuleHotfix final
{
public:
	class FString                                 ModuleName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewScriptStr;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaFunctionLibrary_LuaModuleHotfix;

// Function UnLua.UnLuaInterface.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct UnLuaInterface_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaInterface_GetModuleName;

// Function UnLua.UnLuaLatentAction.GetTickableWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct UnLuaLatentAction_GetTickableWhenPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaLatentAction_GetTickableWhenPaused;

// Function UnLua.UnLuaLatentAction.OnLegacyCallback
// 0x0004 (0x0004 - 0x0000)
struct UnLuaLatentAction_OnLegacyCallback final
{
public:
	int32                                         InLinkage;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaLatentAction_OnLegacyCallback;

// Function UnLua.UnLuaLatentAction.SetTickableWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct UnLuaLatentAction_SetTickableWhenPaused final
{
public:
	bool                                          bTickableWhenPaused;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaLatentAction_SetTickableWhenPaused;

// Function UnLua.UnLuaLatentAction.OnCompleted
// 0x0004 (0x0004 - 0x0000)
struct UnLuaLatentAction_OnCompleted final
{
public:
	int32                                         InLinkage;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaLatentAction_OnCompleted;

// Function UnLua.UnLuaManager.EnhancedInputActionAxis1D
// 0x000C (0x000C - 0x0000)
struct UnLuaManager_EnhancedInputActionAxis1D final
{
public:
	float                                         ActionValue;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElapsedSeconds;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggeredSeconds;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_EnhancedInputActionAxis1D;

// Function UnLua.UnLuaManager.EnhancedInputActionAxis2D
// 0x0010 (0x0010 - 0x0000)
struct UnLuaManager_EnhancedInputActionAxis2D final
{
public:
	struct FVector2D                              ActionValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElapsedSeconds;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggeredSeconds;                                  // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_EnhancedInputActionAxis2D;

// Function UnLua.UnLuaManager.EnhancedInputActionAxis3D
// 0x0014 (0x0014 - 0x0000)
struct UnLuaManager_EnhancedInputActionAxis3D final
{
public:
	struct FVector                                ActionValue;                                       // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElapsedSeconds;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggeredSeconds;                                  // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_EnhancedInputActionAxis3D;

// Function UnLua.UnLuaManager.EnhancedInputActionDigital
// 0x000C (0x000C - 0x0000)
struct UnLuaManager_EnhancedInputActionDigital final
{
public:
	bool                                          ActionValue;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	float                                         ElapsedSeconds;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggeredSeconds;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_EnhancedInputActionDigital;

// Function UnLua.UnLuaManager.GetOrAddBindingObject
// 0x0018 (0x0018 - 0x0000)
struct UnLuaManager_GetOrAddBindingObject final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 BindingClass;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicBlueprintBinding*               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_GetOrAddBindingObject;

// Function UnLua.UnLuaManager.InputAction
// 0x0018 (0x0018 - 0x0000)
struct UnLuaManager_InputAction final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_InputAction;

// Function UnLua.UnLuaManager.InputAxis
// 0x0004 (0x0004 - 0x0000)
struct UnLuaManager_InputAxis final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_InputAxis;

// Function UnLua.UnLuaManager.InputGesture
// 0x0004 (0x0004 - 0x0000)
struct UnLuaManager_InputGesture final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_InputGesture;

// Function UnLua.UnLuaManager.InputTouch
// 0x0010 (0x0010 - 0x0000)
struct UnLuaManager_InputTouch final
{
public:
	ETouchIndex                                   FingerIndex;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FVector                                Location;                                          // 0x0004(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_InputTouch;

// Function UnLua.UnLuaManager.InputVectorAxis
// 0x000C (0x000C - 0x0000)
struct UnLuaManager_InputVectorAxis final
{
public:
	struct FVector                                AxisValue;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_InputVectorAxis;

// Function UnLua.UnLuaManager.OnLatentActionCompleted
// 0x0004 (0x0004 - 0x0000)
struct UnLuaManager_OnLatentActionCompleted final
{
public:
	int32                                         LinkID;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_OnLatentActionCompleted;

// Function UnLua.UnLuaManager.Override
// 0x0018 (0x0018 - 0x0000)
struct UnLuaManager_Override final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FunctionName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LuaFunctionName;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_Override;

// Function UnLua.UnLuaPerformanceTestProxy.Simulate
// 0x0004 (0x0004 - 0x0000)
struct UnLuaPerformanceTestProxy_Simulate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaPerformanceTestProxy_Simulate;

// Function UnLua.UnLuaPerformanceTestProxy.UpdateIndices
// 0x0010 (0x0010 - 0x0000)
struct UnLuaPerformanceTestProxy_UpdateIndices final
{
public:
	TArray<int32>                                 NewIndices;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaPerformanceTestProxy_UpdateIndices;

// Function UnLua.UnLuaPerformanceTestProxy.UpdateMeshID
// 0x0008 (0x0008 - 0x0000)
struct UnLuaPerformanceTestProxy_UpdateMeshID final
{
public:
	int32                                         NewID;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaPerformanceTestProxy_UpdateMeshID;

// Function UnLua.UnLuaPerformanceTestProxy.UpdateMeshName
// 0x0020 (0x0020 - 0x0000)
struct UnLuaPerformanceTestProxy_UpdateMeshName final
{
public:
	class FString                                 NewName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaPerformanceTestProxy_UpdateMeshName;

// Function UnLua.UnLuaPerformanceTestProxy.UpdatePositions
// 0x0010 (0x0010 - 0x0000)
struct UnLuaPerformanceTestProxy_UpdatePositions final
{
public:
	TArray<struct FVector>                        NewPositions;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaPerformanceTestProxy_UpdatePositions;

// Function UnLua.UnLuaPerformanceTestProxy.GetCOM
// 0x000C (0x000C - 0x0000)
struct UnLuaPerformanceTestProxy_GetCOM final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaPerformanceTestProxy_GetCOM;

// Function UnLua.UnLuaPerformanceTestProxy.GetIndices
// 0x0010 (0x0010 - 0x0000)
struct UnLuaPerformanceTestProxy_GetIndices final
{
public:
	TArray<int32>                                 OutIndices;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaPerformanceTestProxy_GetIndices;

// Function UnLua.UnLuaPerformanceTestProxy.GetMeshID
// 0x0004 (0x0004 - 0x0000)
struct UnLuaPerformanceTestProxy_GetMeshID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaPerformanceTestProxy_GetMeshID;

// Function UnLua.UnLuaPerformanceTestProxy.GetMeshInfo
// 0x0060 (0x0060 - 0x0000)
struct UnLuaPerformanceTestProxy_GetMeshInfo final
{
public:
	int32                                         OutMeshID;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 OutMeshName;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutCOM;                                            // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	TArray<int32>                                 OutIndices;                                        // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        OutPositions;                                      // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        OutPredictedPositions;                             // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-DNA ])
};
DUMPER7_ASSERTS_UnLuaPerformanceTestProxy_GetMeshInfo;

// Function UnLua.UnLuaPerformanceTestProxy.GetMeshName
// 0x0010 (0x0010 - 0x0000)
struct UnLuaPerformanceTestProxy_GetMeshName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaPerformanceTestProxy_GetMeshName;

// Function UnLua.UnLuaPerformanceTestProxy.GetPositions
// 0x0010 (0x0010 - 0x0000)
struct UnLuaPerformanceTestProxy_GetPositions final
{
public:
	TArray<struct FVector>                        OutPositions;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaPerformanceTestProxy_GetPositions;

// Function UnLua.UnLuaPerformanceTestProxy.GetPredictedPositions
// 0x0010 (0x0010 - 0x0000)
struct UnLuaPerformanceTestProxy_GetPredictedPositions final
{
public:
	TArray<struct FVector>                        ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaPerformanceTestProxy_GetPredictedPositions;

// Function UnLua.UnLuaPerformanceTestProxy.Raycast
// 0x001C (0x001C - 0x0000)
struct UnLuaPerformanceTestProxy_Raycast final
{
public:
	struct FVector                                Origin;                                            // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-DNA ])
};
DUMPER7_ASSERTS_UnLuaPerformanceTestProxy_Raycast;

}

