#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnLua

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class UnLua.LuaOverridesClass
// 0x0058 (0x0288 - 0x0230)
class ULuaOverridesClass : public UClass
{
public:
	uint8                                         Pad_230[0x8];                                      // 0x0230(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UFunction*>                        OverriddenFunctions;                               // 0x0238(0x0050)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaOverridesClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaOverridesClass")
	}
	static class ULuaOverridesClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaOverridesClass>();
	}
};
DUMPER7_ASSERTS_ULuaOverridesClass;

// Class UnLua.LuaDelegateHandler
// 0x0020 (0x0048 - 0x0028)
class ULuaDelegateHandler : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Dummy();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaDelegateHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaDelegateHandler")
	}
	static class ULuaDelegateHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaDelegateHandler>();
	}
};
DUMPER7_ASSERTS_ULuaDelegateHandler;

// Class UnLua.LuaEnvLocator
// 0x0018 (0x0040 - 0x0028)
class ULuaEnvLocator : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class ULuaOverriddenSubsystem*                OverriddenSubsystem;                               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaEnvLocator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaEnvLocator")
	}
	static class ULuaEnvLocator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaEnvLocator>();
	}
};
DUMPER7_ASSERTS_ULuaEnvLocator;

// Class UnLua.LuaEnvLocator_ByGameInstance
// 0x0050 (0x0090 - 0x0040)
class ULuaEnvLocator_ByGameInstance final : public ULuaEnvLocator
{
public:
	uint8                                         Pad_40[0x50];                                      // 0x0040(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaEnvLocator_ByGameInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaEnvLocator_ByGameInstance")
	}
	static class ULuaEnvLocator_ByGameInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaEnvLocator_ByGameInstance>();
	}
};
DUMPER7_ASSERTS_ULuaEnvLocator_ByGameInstance;

// Class UnLua.LuaFunction
// 0x0038 (0x0118 - 0x00E0)
class ULuaFunction final : public UFunction
{
public:
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFunction*                              Overridden;                                        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F0[0x28];                                      // 0x00F0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaFunction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaFunction")
	}
	static class ULuaFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaFunction>();
	}
};
DUMPER7_ASSERTS_ULuaFunction;

// Class UnLua.LuaModuleLocator
// 0x0000 (0x0028 - 0x0028)
class ULuaModuleLocator : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaModuleLocator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaModuleLocator")
	}
	static class ULuaModuleLocator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaModuleLocator>();
	}
};
DUMPER7_ASSERTS_ULuaModuleLocator;

// Class UnLua.LuaModuleLocator_ByPackage
// 0x0050 (0x0078 - 0x0028)
class ULuaModuleLocator_ByPackage final : public ULuaModuleLocator
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaModuleLocator_ByPackage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaModuleLocator_ByPackage")
	}
	static class ULuaModuleLocator_ByPackage* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaModuleLocator_ByPackage>();
	}
};
DUMPER7_ASSERTS_ULuaModuleLocator_ByPackage;

// Class UnLua.LuaOverriddenSubsystem
// 0x0050 (0x0078 - 0x0028)
class ULuaOverriddenSubsystem final : public UObject
{
public:
	TMap<class UFunction*, int32>                 OverriddenFunctions;                               // 0x0028(0x0050)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaOverriddenSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaOverriddenSubsystem")
	}
	static class ULuaOverriddenSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaOverriddenSubsystem>();
	}
};
DUMPER7_ASSERTS_ULuaOverriddenSubsystem;

// Class UnLua.LuaTimerDelegateHandler
// 0x0008 (0x0050 - 0x0048)
class ULuaTimerDelegateHandler final : public ULuaDelegateHandler
{
public:
	bool                                          bLoop;                                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaTimerDelegateHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaTimerDelegateHandler")
	}
	static class ULuaTimerDelegateHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaTimerDelegateHandler>();
	}
};
DUMPER7_ASSERTS_ULuaTimerDelegateHandler;

// Class UnLua.UnLuaFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UUnLuaFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int64 GetFileLastModifiedTimestamp(const class FString& Path);
	static class FString GetScriptRootPath();
	static void HotReload();
	static class FString LuaModuleHotfix(const class FString& ModuleName, const class FString& NewScriptStr);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UnLuaFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UnLuaFunctionLibrary")
	}
	static class UUnLuaFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnLuaFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UUnLuaFunctionLibrary;

// Class UnLua.UnLuaInterface
// 0x0000 (0x0000 - 0x0000)
class IUnLuaInterface final
{
public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UnLuaInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UnLuaInterface")
	}
	static class IUnLuaInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IUnLuaInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IUnLuaInterface;

// Class UnLua.UnLuaLatentAction
// 0x0028 (0x0050 - 0x0028)
class UUnLuaLatentAction final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 InLinkage)>              Callback;                                          // 0x0030(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bTickEvenWhenPaused : 1;                           // 0x0048(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetTickableWhenPaused();
	void OnLegacyCallback(int32 InLinkage);
	void SetTickableWhenPaused(bool bTickableWhenPaused);

	void OnCompleted(int32 InLinkage) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UnLuaLatentAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UnLuaLatentAction")
	}
	static class UUnLuaLatentAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnLuaLatentAction>();
	}
};
DUMPER7_ASSERTS_UUnLuaLatentAction;

// Class UnLua.UnLuaManager
// 0x0188 (0x01B0 - 0x0028)
class UUnLuaManager final : public UObject
{
public:
	uint8                                         Pad_28[0x188];                                     // 0x0028(0x0188)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EnhancedInputActionAxis1D(float ActionValue, float ElapsedSeconds, float TriggeredSeconds);
	void EnhancedInputActionAxis2D(const struct FVector2D& ActionValue, float ElapsedSeconds, float TriggeredSeconds);
	void EnhancedInputActionAxis3D(const struct FVector& ActionValue, float ElapsedSeconds, float TriggeredSeconds);
	void EnhancedInputActionDigital(bool ActionValue, float ElapsedSeconds, float TriggeredSeconds);
	class UDynamicBlueprintBinding* GetOrAddBindingObject(class UClass* Class_0, class UClass* BindingClass);
	void InputAction(const struct FKey& Key);
	void InputAxis(float AxisValue);
	void InputGesture(float Value);
	void InputTouch(ETouchIndex FingerIndex, const struct FVector& Location);
	void InputVectorAxis(const struct FVector& AxisValue);
	void OnLatentActionCompleted(int32 LinkID);
	void Override(class UClass* Class_0, class FName FunctionName, class FName LuaFunctionName);
	void TriggerAnimNotify();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UnLuaManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UnLuaManager")
	}
	static class UUnLuaManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnLuaManager>();
	}
};
DUMPER7_ASSERTS_UUnLuaManager;

// Class UnLua.UnLuaPerformanceTestProxy
// 0x0060 (0x0300 - 0x02A0)
class AUnLuaPerformanceTestProxy final : public AActor
{
public:
	uint8                                         Pad_2A0[0x8];                                      // 0x02A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MeshID;                                            // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MeshName;                                          // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                COM;                                               // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Indices;                                           // 0x02D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                        Positions;                                         // 0x02E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                        PredictedPositions;                                // 0x02F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void NOP();
	void Simulate(float DeltaTime);
	void UpdateIndices(const TArray<int32>& NewIndices);
	int32 UpdateMeshID(int32 NewID);
	class FString UpdateMeshName(const class FString& NewName);
	void UpdatePositions(const TArray<struct FVector>& NewPositions);

	const struct FVector GetCOM() const;
	void GetIndices(TArray<int32>* OutIndices) const;
	int32 GetMeshID() const;
	bool GetMeshInfo(int32* OutMeshID, class FString* OutMeshName, struct FVector* OutCOM, TArray<int32>* OutIndices, TArray<struct FVector>* OutPositions, TArray<struct FVector>* OutPredictedPositions) const;
	class FString GetMeshName() const;
	void GetPositions(TArray<struct FVector>* OutPositions) const;
	const TArray<struct FVector> GetPredictedPositions() const;
	bool Raycast(const struct FVector& Origin, const struct FVector& Direction) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UnLuaPerformanceTestProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UnLuaPerformanceTestProxy")
	}
	static class AUnLuaPerformanceTestProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUnLuaPerformanceTestProxy>();
	}
};
DUMPER7_ASSERTS_AUnLuaPerformanceTestProxy;

// Class UnLua.UnLuaSettings
// 0x0050 (0x0078 - 0x0028)
class UUnLuaSettings final : public UObject
{
public:
	class FString                                 StartupModuleName;                                 // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeadLoopCheck;                                     // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DanglingCheck;                                     // 0x003C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintLuaStackOnSystemError;                       // 0x003D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ULuaEnvLocator>             EnvLocatorClass;                                   // 0x0040(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaModuleLocator>          ModuleLocatorClass;                                // 0x0048(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftClassPath>                 PreBindClasses;                                    // 0x0050(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bEnableEditorLuaNewLog;                            // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EncryptionKey;                                     // 0x0068(0x0010)(Edit, ZeroConstructor, Config, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UnLuaSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UnLuaSettings")
	}
	static class UUnLuaSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnLuaSettings>();
	}
};
DUMPER7_ASSERTS_UUnLuaSettings;

}

