#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_Battle_Map_Phantom

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Battle_Map_Phantom.WBP_Battle_Map_Phantom_C.ExecuteUbergraph_WBP_Battle_Map_Phantom
// 0x0048 (0x0048 - 0x0000)
struct WBP_Battle_Map_Phantom_C_ExecuteUbergraph_WBP_Battle_Map_Phantom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ArrowVisibility;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Battle_Map_Phantom_C_ExecuteUbergraph_WBP_Battle_Map_Phantom;

// Function WBP_Battle_Map_Phantom.WBP_Battle_Map_Phantom_C.SetArrowVisibility
// 0x0004 (0x0004 - 0x0000)
struct WBP_Battle_Map_Phantom_C_SetArrowVisibility final
{
public:
	int32                                         ArrowVisibility;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Battle_Map_Phantom_C_SetArrowVisibility;

// Function WBP_Battle_Map_Phantom.WBP_Battle_Map_Phantom_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Battle_Map_Phantom_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Battle_Map_Phantom_C_Tick;

// Function WBP_Battle_Map_Phantom.WBP_Battle_Map_Phantom_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Battle_Map_Phantom_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Battle_Map_Phantom_C_GetModuleName;

}

