#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_Battle_P

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Battle_P.WBP_Battle_P_C.ExecuteUbergraph_WBP_Battle_P
// 0x0030 (0x0030 - 0x0000)
struct WBP_Battle_P_C_ExecuteUbergraph_WBP_Battle_P final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EScreenOrientation                            K2Node_CustomEvent_inScreenOrientation;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-DNA ])
	TDelegate<void(EScreenOrientation inScreenOrientation)> K2Node_CreateDelegate_OutputDelegate;    // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlatformGameInstance*                  K2Node_DynamicCast_As______;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Battle_P_C_ExecuteUbergraph_WBP_Battle_P;

// Function WBP_Battle_P.WBP_Battle_P_C.ScreenOrientation
// 0x0001 (0x0001 - 0x0000)
struct WBP_Battle_P_C_ScreenOrientation final
{
public:
	EScreenOrientation                            inScreenOrientation;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Battle_P_C_ScreenOrientation;

// Function WBP_Battle_P.WBP_Battle_P_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Battle_P_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Battle_P_C_GetModuleName;

}

