#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_Com_Toast

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Com_Toast.WBP_Com_Toast_C.ShowToast
// 0x0028 (0x0028 - 0x0000)
struct WBP_Com_Toast_C_ShowToast final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         TotalTime;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_Toast_C_ShowToast;

// Function WBP_Com_Toast.WBP_Com_Toast_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Com_Toast_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_Toast_C_GetModuleName;

}

