#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_Com_TipsMenuAnchor

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Com_TipsMenuAnchor.WBP_Com_TipsMenuAnchor_C.On_ItemDetailsMenuAnchor_GetUserMenuContent
// 0x0028 (0x0028 - 0x0000)
struct WBP_Com_TipsMenuAnchor_C_On_ItemDetailsMenuAnchor_GetUserMenuContent final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Com_Tips_C*                        CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIManagerComponent*                    CallFunc_GetUIManager_CPP_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Com_Tips_C*                        K2Node_DynamicCast_AsWBP_Com_Tips;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Com_TipsMenuAnchor_C_On_ItemDetailsMenuAnchor_GetUserMenuContent;

// Function WBP_Com_TipsMenuAnchor.WBP_Com_TipsMenuAnchor_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Com_TipsMenuAnchor_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_TipsMenuAnchor_C_GetModuleName;

}

