#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_Map_Mark

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Map_Mark.WBP_Map_Mark_C.ExecuteUbergraph_WBP_Map_Mark
// 0x0004 (0x0004 - 0x0000)
struct WBP_Map_Mark_C_ExecuteUbergraph_WBP_Map_Mark final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Map_Mark_C_ExecuteUbergraph_WBP_Map_Mark;

// Function WBP_Map_Mark.WBP_Map_Mark_C.NewMarkType
// 0x0018 (0x0018 - 0x0000)
struct WBP_Map_Mark_C_NewMarkType final
{
public:
	class UWidget*                                MarkType;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Map_MarkBtn_C*                     CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Map_Mark_C_NewMarkType;

// Function WBP_Map_Mark.WBP_Map_Mark_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct WBP_Map_Mark_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
DUMPER7_ASSERTS_WBP_Map_Mark_C_OnMouseButtonDown;

// Function WBP_Map_Mark.WBP_Map_Mark_C.OnMouseButtonUp
// 0x0218 (0x0218 - 0x0000)
struct WBP_Map_Mark_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
DUMPER7_ASSERTS_WBP_Map_Mark_C_OnMouseButtonUp;

// Function WBP_Map_Mark.WBP_Map_Mark_C.OnTouchStarted
// 0x0218 (0x0218 - 0x0000)
struct WBP_Map_Mark_C_OnTouchStarted final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InTouchEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
DUMPER7_ASSERTS_WBP_Map_Mark_C_OnTouchStarted;

// Function WBP_Map_Mark.WBP_Map_Mark_C.OnTouchEnded
// 0x0218 (0x0218 - 0x0000)
struct WBP_Map_Mark_C_OnTouchEnded final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InTouchEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
DUMPER7_ASSERTS_WBP_Map_Mark_C_OnTouchEnded;

// Function WBP_Map_Mark.WBP_Map_Mark_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Map_Mark_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Map_Mark_C_GetModuleName;

}

