#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_Com_KeyImg

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Com_KeyImg.WBP_Com_KeyImg_C.ExecuteUbergraph_WBP_Com_KeyImg
// 0x0040 (0x0040 - 0x0000)
struct WBP_Com_KeyImg_C_ExecuteUbergraph_WBP_Com_KeyImg final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_KeyImg_C_ExecuteUbergraph_WBP_Com_KeyImg;

// Function WBP_Com_KeyImg.WBP_Com_KeyImg_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Com_KeyImg_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_KeyImg_C_Tick;

// Function WBP_Com_KeyImg.WBP_Com_KeyImg_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Com_KeyImg_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_KeyImg_C_GetModuleName;

}

