#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_SelectRole_FM_M

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_SelectRole_FM_M.WBP_SelectRole_FM_M_C.ExecuteUbergraph_WBP_SelectRole_FM_M
// 0x0010 (0x0010 - 0x0000)
struct WBP_SelectRole_FM_M_C_ExecuteUbergraph_WBP_SelectRole_FM_M final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SelectRole_FM_M_C_ExecuteUbergraph_WBP_SelectRole_FM_M;

// Function WBP_SelectRole_FM_M.WBP_SelectRole_FM_M_C.ChangeButtonImage
// 0x0C20 (0x0C20 - 0x0000)
struct WBP_SelectRole_FM_M_C_ChangeButtonImage final
{
public:
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0000(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x00D0(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x01A0(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_3;                    // 0x0270(0x00D0)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x0340(0x03A0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_4;                    // 0x06E0(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_5;                    // 0x07B0(0x00D0)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle_1;                   // 0x0880(0x03A0)()
};
DUMPER7_ASSERTS_WBP_SelectRole_FM_M_C_ChangeButtonImage;

// Function WBP_SelectRole_FM_M.WBP_SelectRole_FM_M_C.OnTouchStarted
// 0x0160 (0x0160 - 0x0000)
struct WBP_SelectRole_FM_M_C_OnTouchStarted final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InTouchEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_WBP_SelectRole_FM_M_C_OnTouchStarted;

// Function WBP_SelectRole_FM_M.WBP_SelectRole_FM_M_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_SelectRole_FM_M_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SelectRole_FM_M_C_GetModuleName;

}

