#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_Battle_Map_Enemy

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Battle_Map_Enemy.WBP_Battle_Map_Enemy_C.ExecuteUbergraph_WBP_Battle_Map_Enemy
// 0x0040 (0x0040 - 0x0000)
struct WBP_Battle_Map_Enemy_C_ExecuteUbergraph_WBP_Battle_Map_Enemy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Battle_Map_Enemy_C_ExecuteUbergraph_WBP_Battle_Map_Enemy;

// Function WBP_Battle_Map_Enemy.WBP_Battle_Map_Enemy_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Battle_Map_Enemy_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Battle_Map_Enemy_C_Tick;

// Function WBP_Battle_Map_Enemy.WBP_Battle_Map_Enemy_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Battle_Map_Enemy_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Battle_Map_Enemy_C_GetModuleName;

}

