#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_Map_Convey

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Map_Convey.WBP_Map_Convey_C.ExecuteUbergraph_WBP_Map_Convey
// 0x0018 (0x0018 - 0x0000)
struct WBP_Map_Convey_C_ExecuteUbergraph_WBP_Map_Convey final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Map_Convey_C_ExecuteUbergraph_WBP_Map_Convey;

// Function WBP_Map_Convey.WBP_Map_Convey_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_Convey_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Map_Convey_C_OnAnimationFinished;

// Function WBP_Map_Convey.WBP_Map_Convey_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Map_Convey_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Map_Convey_C_GetModuleName;

}

