#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_Com_Item_M

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Com_Item_M.WBP_Com_Item_M_C.ExecuteUbergraph_WBP_Com_Item_M
// 0x0028 (0x0028 - 0x0000)
struct WBP_Com_Item_M_C_ExecuteUbergraph_WBP_Com_Item_M final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-DNA ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Com_Item_M_C_ExecuteUbergraph_WBP_Com_Item_M;

// Function WBP_Com_Item_M.WBP_Com_Item_M_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Com_Item_M_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Com_Item_M_C_PreConstruct;

// Function WBP_Com_Item_M.WBP_Com_Item_M_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Com_Item_M_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_Item_M_C_OnListItemObjectSet;

// Function WBP_Com_Item_M.WBP_Com_Item_M_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Com_Item_M_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Com_Item_M_C_BP_OnItemSelectionChanged;

// Function WBP_Com_Item_M.WBP_Com_Item_M_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Com_Item_M_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Com_Item_M_C_BP_OnItemExpansionChanged;

// Function WBP_Com_Item_M.WBP_Com_Item_M_C.SetIconShadow
// 0x0018 (0x0018 - 0x0000)
struct WBP_Com_Item_M_C_SetIconShadow final
{
public:
	bool                                          bIconShadow;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-DNA ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_Item_M_C_SetIconShadow;

// Function WBP_Com_Item_M.WBP_Com_Item_M_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Com_Item_M_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_Item_M_C_GetModuleName;

}

