#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_Com_Tips

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Com_Tips.WBP_Com_Tips_C.ExecuteUbergraph_WBP_Com_Tips
// 0x000C (0x000C - 0x0000)
struct WBP_Com_Tips_C_ExecuteUbergraph_WBP_Com_Tips final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility_1;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Com_Tips_C_ExecuteUbergraph_WBP_Com_Tips;

// Function WBP_Com_Tips.WBP_Com_Tips_C.BndEvt__WBP_Com_Tips_Btn02_Mod_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Com_Tips_C_BndEvt__WBP_Com_Tips_Btn02_Mod_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_Tips_C_BndEvt__WBP_Com_Tips_Btn02_Mod_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature;

// Function WBP_Com_Tips.WBP_Com_Tips_C.BndEvt__WBP_Com_Tips_Btn01_Mod_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Com_Tips_C_BndEvt__WBP_Com_Tips_Btn01_Mod_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_Tips_C_BndEvt__WBP_Com_Tips_Btn01_Mod_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature;

// Function WBP_Com_Tips.WBP_Com_Tips_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Com_Tips_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Com_Tips_C_PreConstruct;

// Function WBP_Com_Tips.WBP_Com_Tips_C.On_Bg_24_8_8_24_MouseButtonDown_0
// 0x0218 (0x0218 - 0x0000)
struct WBP_Com_Tips_C_On_Bg_24_8_8_24_MouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
DUMPER7_ASSERTS_WBP_Com_Tips_C_On_Bg_24_8_8_24_MouseButtonDown_0;

// Function WBP_Com_Tips.WBP_Com_Tips_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Com_Tips_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_Tips_C_GetModuleName;

}

