#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_PlayerBloodReturn

#include "Basic.hpp"

#include "EM_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerBloodReturn.WBP_PlayerBloodReturn_C
// 0x0028 (0x0610 - 0x05E8)
class UWBP_PlayerBloodReturn_C final : public UUIState
{
public:
	class UWidgetAnimation*                       Player_BloodReturnEnd;                             // 0x05E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Player_BloodReturning;                             // 0x05F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Player_BloodReturn;                                // 0x05F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 VX_Health;                                         // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   VX_ParHealth;                                      // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_PlayerBloodReturn_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_PlayerBloodReturn_C")
	}
	static class UWBP_PlayerBloodReturn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerBloodReturn_C>();
	}
};
DUMPER7_ASSERTS_UWBP_PlayerBloodReturn_C;

}

