#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_Battle_Aim

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Battle_Aim.WBP_Battle_Aim_C.ExecuteUbergraph_WBP_Battle_Aim
// 0x0060 (0x0060 - 0x0000)
struct WBP_Battle_Aim_C_ExecuteUbergraph_WBP_Battle_Aim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0024(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Battle_Aim_C_ExecuteUbergraph_WBP_Battle_Aim;

// Function WBP_Battle_Aim.WBP_Battle_Aim_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Battle_Aim_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Battle_Aim_C_Tick;

// Function WBP_Battle_Aim.WBP_Battle_Aim_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Battle_Aim_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Battle_Aim_C_GetModuleName;

}

