#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Battle_Map_MapImg

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EM_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Battle_Map_MapImg.WBP_Battle_Map_MapImg_C
// 0x0028 (0x05F8 - 0x05D0)
class UWBP_Battle_Map_MapImg_C final : public UEMUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Map;                                               // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       CurrentAni;                                        // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Battle_Map_MapImg(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Battle_Map_MapImg_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Battle_Map_MapImg_C")
	}
	static class UWBP_Battle_Map_MapImg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Battle_Map_MapImg_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Battle_Map_MapImg_C;

}

