#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerSelect

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ServerSelect.WBP_ServerSelect_C.ExecuteUbergraph_WBP_ServerSelect
// 0x0090 (0x0090 - 0x0000)
struct WBP_ServerSelect_C_ExecuteUbergraph_WBP_ServerSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0008(0x0018)(ConstParm)
	class UObject*                                K2Node_ComponentBoundEvent_Item_2;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_1;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UServerAreaItemContent_C*               K2Node_DynamicCast_AsServer_Area_Item_Content;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0040(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_1;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UServerListItemContent_C*               K2Node_DynamicCast_AsServer_List_Item_Content;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_ServerSelect_C_ExecuteUbergraph_WBP_ServerSelect;

// Function WBP_ServerSelect.WBP_ServerSelect_C.BndEvt__WBP_ServerSelect_List_K2Node_ComponentBoundEvent_8_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ServerSelect_C_BndEvt__WBP_ServerSelect_List_K2Node_ComponentBoundEvent_8_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ServerSelect_C_BndEvt__WBP_ServerSelect_List_K2Node_ComponentBoundEvent_8_SimpleListItemEventDynamic__DelegateSignature;

// Function WBP_ServerSelect.WBP_ServerSelect_C.BndEvt__WBP_ServerSelect_List_K2Node_ComponentBoundEvent_7_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerSelect_C_BndEvt__WBP_ServerSelect_List_K2Node_ComponentBoundEvent_7_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_ServerSelect_C_BndEvt__WBP_ServerSelect_List_K2Node_ComponentBoundEvent_7_OnListItemSelectionChangedDynamic__DelegateSignature;

// Function WBP_ServerSelect.WBP_ServerSelect_C.BndEvt__WBP_ServerSelect_Input_Search_Server_K2Node_ComponentBoundEvent_5_OnEditableTextCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_ServerSelect_C_BndEvt__WBP_ServerSelect_Input_Search_Server_K2Node_ComponentBoundEvent_5_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ServerSelect_C_BndEvt__WBP_ServerSelect_Input_Search_Server_K2Node_ComponentBoundEvent_5_OnEditableTextCommittedEvent__DelegateSignature;

// Function WBP_ServerSelect.WBP_ServerSelect_C.BndEvt__WBP_ServerSelect_ListView_Area_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerSelect_C_BndEvt__WBP_ServerSelect_ListView_Area_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_ServerSelect_C_BndEvt__WBP_ServerSelect_ListView_Area_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature;

// Function WBP_ServerSelect.WBP_ServerSelect_C.BndEvt__WBP_ServerSelect_Input_Search_Server_K2Node_ComponentBoundEvent_4_OnEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_ServerSelect_C_BndEvt__WBP_ServerSelect_Input_Search_Server_K2Node_ComponentBoundEvent_4_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_ServerSelect_C_BndEvt__WBP_ServerSelect_Input_Search_Server_K2Node_ComponentBoundEvent_4_OnEditableTextChangedEvent__DelegateSignature;

// Function WBP_ServerSelect.WBP_ServerSelect_C.SearchServer
// 0x0018 (0x0018 - 0x0000)
struct WBP_ServerSelect_C_SearchServer final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_ServerSelect_C_SearchServer;

// Function WBP_ServerSelect.WBP_ServerSelect_C.SwitchArea
// 0x0004 (0x0004 - 0x0000)
struct WBP_ServerSelect_C_SwitchArea final
{
public:
	int32                                         Area;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ServerSelect_C_SwitchArea;

// Function WBP_ServerSelect.WBP_ServerSelect_C.ClickArea
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerSelect_C_ClickArea final
{
public:
	class UObject*                                Obj;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSeleted;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_ServerSelect_C_ClickArea;

// Function WBP_ServerSelect.WBP_ServerSelect_C.PlayUISound
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerSelect_C_PlayUISound final
{
public:
	class FString                                 EventPath;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ServerSelect_C_PlayUISound;

// Function WBP_ServerSelect.WBP_ServerSelect_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerSelect_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ServerSelect_C_GetModuleName;

}

