#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Battle_Map_Icon

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Battle_Map_Icon.WBP_Battle_Map_Icon_C.ExecuteUbergraph_WBP_Battle_Map_Icon
// 0x000C (0x000C - 0x0000)
struct WBP_Battle_Map_Icon_C_ExecuteUbergraph_WBP_Battle_Map_Icon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ArrowVisibility;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Battle_Map_Icon_C_ExecuteUbergraph_WBP_Battle_Map_Icon;

// Function WBP_Battle_Map_Icon.WBP_Battle_Map_Icon_C.SetArrowVisibility
// 0x0004 (0x0004 - 0x0000)
struct WBP_Battle_Map_Icon_C_SetArrowVisibility final
{
public:
	int32                                         ArrowVisibility;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Battle_Map_Icon_C_SetArrowVisibility;

// Function WBP_Battle_Map_Icon.WBP_Battle_Map_Icon_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Battle_Map_Icon_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Battle_Map_Icon_C_GetModuleName;

}

