#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_Com_BtnReward

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Com_BtnReward.WBP_Com_BtnReward_C.ExecuteUbergraph_WBP_Com_BtnReward
// 0x0018 (0x0018 - 0x0000)
struct WBP_Com_BtnReward_C_ExecuteUbergraph_WBP_Com_BtnReward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_BtnReward_C_ExecuteUbergraph_WBP_Com_BtnReward;

// Function WBP_Com_BtnReward.WBP_Com_BtnReward_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Com_BtnReward_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Com_BtnReward_C_PreConstruct;

// Function WBP_Com_BtnReward.WBP_Com_BtnReward_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Com_BtnReward_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_BtnReward_C_GetModuleName;

}

