#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NPC_UniformHeadWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_NPC_UniformHeadWidget.WBP_NPC_UniformHeadWidget_C.GetExternWidgetClass
// 0x0058 (0x0058 - 0x0000)
struct WBP_NPC_UniformHeadWidget_C_GetExternWidgetClass final
{
public:
	class FName                                   WidgetType;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 WidgetClass;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_Map_Find_Value;                           // 0x0010(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_As____;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_NPC_UniformHeadWidget_C_GetExternWidgetClass;

// Function WBP_NPC_UniformHeadWidget.WBP_NPC_UniformHeadWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_NPC_UniformHeadWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_NPC_UniformHeadWidget_C_Tick;

// Function WBP_NPC_UniformHeadWidget.WBP_NPC_UniformHeadWidget_C.ExecuteUbergraph_WBP_NPC_UniformHeadWidget
// 0x0040 (0x0040 - 0x0000)
struct WBP_NPC_UniformHeadWidget_C_ExecuteUbergraph_WBP_NPC_UniformHeadWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_NPC_UniformHeadWidget_C_ExecuteUbergraph_WBP_NPC_UniformHeadWidget;

// Function WBP_NPC_UniformHeadWidget.WBP_NPC_UniformHeadWidget_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_NPC_UniformHeadWidget_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_NPC_UniformHeadWidget_C_GetModuleName;

}

