#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Map_RegionInfo

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Map_RegionInfo.WBP_Map_RegionInfo_C.ExecuteUbergraph_WBP_Map_RegionInfo
// 0x0020 (0x0020 - 0x0000)
struct WBP_Map_RegionInfo_C_ExecuteUbergraph_WBP_Map_RegionInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Map_RegionInfo_C_ExecuteUbergraph_WBP_Map_RegionInfo;

// Function WBP_Map_RegionInfo.WBP_Map_RegionInfo_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Map_RegionInfo_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Map_RegionInfo_C_GetModuleName;

}

