#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_Char_LevelUp

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Char_LevelUp.WBP_Char_LevelUp_C.ExecuteUbergraph_WBP_Char_LevelUp
// 0x0068 (0x0068 - 0x0000)
struct WBP_Char_LevelUp_C_ExecuteUbergraph_WBP_Char_LevelUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class FString                                 K2Node_CustomEvent_EventPath_2;                    // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventKey_2;                     // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventPath_1;                    // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventKey_1;                     // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventPath;                      // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventKey;                       // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Char_LevelUp_C_ExecuteUbergraph_WBP_Char_LevelUp;

// Function WBP_Char_LevelUp.WBP_Char_LevelUp_C.SequenceEvent_2
// 0x0020 (0x0020 - 0x0000)
struct WBP_Char_LevelUp_C_SequenceEvent_2 final
{
public:
	class FString                                 EventPath;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EventKey;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Char_LevelUp_C_SequenceEvent_2;

// Function WBP_Char_LevelUp.WBP_Char_LevelUp_C.SequenceEvent_1
// 0x0020 (0x0020 - 0x0000)
struct WBP_Char_LevelUp_C_SequenceEvent_1 final
{
public:
	class FString                                 EventPath;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EventKey;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Char_LevelUp_C_SequenceEvent_1;

// Function WBP_Char_LevelUp.WBP_Char_LevelUp_C.SequenceEvent_0
// 0x0020 (0x0020 - 0x0000)
struct WBP_Char_LevelUp_C_SequenceEvent_0 final
{
public:
	class FString                                 EventPath;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EventKey;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Char_LevelUp_C_SequenceEvent_0;

// Function WBP_Char_LevelUp.WBP_Char_LevelUp_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Char_LevelUp_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Char_LevelUp_C_GetModuleName;

}

