#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_SelectRole_Name_P

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_SelectRole_Name_P.WBP_SelectRole_Name_P_C.ExecuteUbergraph_WBP_SelectRole_Name_P
// 0x0058 (0x0058 - 0x0000)
struct WBP_SelectRole_Name_P_C_ExecuteUbergraph_WBP_SelectRole_Name_P final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0040(0x0018)(ConstParm)
};
DUMPER7_ASSERTS_WBP_SelectRole_Name_P_C_ExecuteUbergraph_WBP_SelectRole_Name_P;

// Function WBP_SelectRole_Name_P.WBP_SelectRole_Name_P_C.BndEvt__SelectRole_Name_Widget_PC_Text_InputName_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_SelectRole_Name_P_C_BndEvt__SelectRole_Name_Widget_PC_Text_InputName_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_SelectRole_Name_P_C_BndEvt__SelectRole_Name_Widget_PC_Text_InputName_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature;

// Function WBP_SelectRole_Name_P.WBP_SelectRole_Name_P_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_SelectRole_Name_P_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SelectRole_Name_P_C_Tick;

// Function WBP_SelectRole_Name_P.WBP_SelectRole_Name_P_C.OnNameChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_SelectRole_Name_P_C_OnNameChanged final
{
public:
	class FText                                   NewName;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_SelectRole_Name_P_C_OnNameChanged;

// Function WBP_SelectRole_Name_P.WBP_SelectRole_Name_P_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_SelectRole_Name_P_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SelectRole_Name_P_C_GetModuleName;

}

