#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_Com_KeyTextDesc

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Com_KeyTextDesc.WBP_Com_KeyTextDesc_C.ExecuteUbergraph_WBP_Com_KeyTextDesc
// 0x0050 (0x0050 - 0x0000)
struct WBP_Com_KeyTextDesc_C_ExecuteUbergraph_WBP_Com_KeyTextDesc final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-DNA ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-DNA ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_KeyTextDesc_C_ExecuteUbergraph_WBP_Com_KeyTextDesc;

// Function WBP_Com_KeyTextDesc.WBP_Com_KeyTextDesc_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Com_KeyTextDesc_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_KeyTextDesc_C_Tick;

// Function WBP_Com_KeyTextDesc.WBP_Com_KeyTextDesc_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Com_KeyTextDesc_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Com_KeyTextDesc_C_PreConstruct;

// Function WBP_Com_KeyTextDesc.WBP_Com_KeyTextDesc_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_Com_KeyTextDesc_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_KeyTextDesc_C_OnListItemObjectSet;

// Function WBP_Com_KeyTextDesc.WBP_Com_KeyTextDesc_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Com_KeyTextDesc_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Com_KeyTextDesc_C_BP_OnItemSelectionChanged;

// Function WBP_Com_KeyTextDesc.WBP_Com_KeyTextDesc_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Com_KeyTextDesc_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Com_KeyTextDesc_C_BP_OnItemExpansionChanged;

// Function WBP_Com_KeyTextDesc.WBP_Com_KeyTextDesc_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Com_KeyTextDesc_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_KeyTextDesc_C_GetModuleName;

}

