#pragma once

/*
* SDK generated by Dumper-DNA
*/

// Package: WBP_Com_KeyText

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Com_KeyText.WBP_Com_KeyText_C.ExecuteUbergraph_WBP_Com_KeyText
// 0x0050 (0x0050 - 0x0000)
struct WBP_Com_KeyText_C_ExecuteUbergraph_WBP_Com_KeyText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-DNA ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_KeyText_C_ExecuteUbergraph_WBP_Com_KeyText;

// Function WBP_Com_KeyText.WBP_Com_KeyText_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Com_KeyText_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_KeyText_C_Tick;

// Function WBP_Com_KeyText.WBP_Com_KeyText_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Com_KeyText_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Com_KeyText_C_GetModuleName;

}

